qsyn> qcir read benchmark/qasm/qc2ts/control_z.qasm

qsyn> logger trace
[info]     Setting logger level to "trace"

qsyn> qc2ts
[info]     Converting to QCir 0 to tensor 0...
[debug]    Add boundary
[trace]      - Add Qubit 0 input port: 1
[trace]      - Add Qubit 2 input port: 3
[debug]    Gate 0 (x)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 2 -> 2 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 0 output: 1 -> 1
[debug]    Gate 1 (rz)
[debug]    new:1 info._qubit:1 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 2 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 1 output: 1 -> 2
[debug]    Gate 2 (sx)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 0 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 1 output: 2 -> 2
[debug]    Gate 3 (rz)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 0 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 1 output: 2 -> 2
[debug]    Gate 4 (cx)
[debug]    new:1 info._qubit:0 old:1
[debug]    new:3 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 0 -> 1 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 0 output: 2 -> 2
[debug]    Gate 5 (x)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 1 -> 1 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 0 output: 2 -> 2
[debug]    Gate 6 (rz)
[debug]    new:1 info._qubit:1 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 1 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 1 output: 2 -> 2
[debug]    Gate 7 (sx)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 0 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 1 output: 2 -> 2
[debug]    Gate 8 (rz)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 0 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 1 output: 2 -> 2
[info]     Successfully created and checked out to Tensor 0
[info]     Note: Replacing Tensor 0...

qsyn> logger warning

qsyn> qcir read benchmark/qasm/qc2ts/control_h.qasm -r

qsyn> logger trace
[info]     Setting logger level to "trace"

qsyn> qc2ts
[info]     Converting to QCir 0 to tensor 1...
[debug]    Add boundary
[trace]      - Add Qubit 0 input port: 1
[trace]      - Add Qubit 2 input port: 3
[debug]    Gate 0 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 2 -> 2 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 0 output: 1 -> 1
[debug]    Gate 1 (rz)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 2 -> 2 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 0 output: 1 -> 1
[debug]    Gate 2 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 2 -> 2 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 0 output: 1 -> 1
[debug]    Gate 3 (rz)
[debug]    new:1 info._qubit:1 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 2 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 1 output: 1 -> 2
[debug]    Gate 4 (sx)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 0 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 1 output: 2 -> 2
[debug]    Gate 5 (rz)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 0 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 1 output: 2 -> 2
[debug]    Gate 6 (cx)
[debug]    new:1 info._qubit:0 old:1
[debug]    new:3 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 0 -> 1 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 0 output: 2 -> 2
[debug]    Gate 7 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 1 -> 1 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 0 output: 2 -> 2
[debug]    Gate 8 (rz)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 1 -> 1 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 0 output: 2 -> 2
[debug]    Gate 9 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 1 -> 1 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 0 output: 2 -> 2
[debug]    Gate 10 (rz)
[debug]    new:1 info._qubit:1 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 1 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 1 output: 2 -> 2
[debug]    Gate 11 (sx)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 0 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 1 output: 2 -> 2
[debug]    Gate 12 (rz)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 1 input : 0 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 1 output: 2 -> 2
[info]     Successfully created and checked out to Tensor 1
[info]     Note: Replacing Tensor 1...

qsyn> logger warning

qsyn> qcir read benchmark/qasm/qc2ts/toffoli_dec.qasm -r

qsyn> logger trace
[info]     Setting logger level to "trace"

qsyn> qc2ts
[info]     Converting to QCir 0 to tensor 2...
[debug]    Add boundary
[trace]      - Add Qubit 0 input port: 1
[trace]      - Add Qubit 2 input port: 3
[trace]      - Add Qubit 4 input port: 5
[debug]    Gate 0 (h)
[debug]    new:1 info._qubit:2 old:4
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 4 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 3 output: 3 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 1 -> 2
[debug]    Gate 1 (cx)
[debug]    new:1 info._qubit:1 old:3
[debug]    new:3 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 3 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 2 output: 2 -> 3
[debug]    Gate 2 (tdg)
[debug]    new:1 info._qubit:2 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 3 (cx)
[debug]    new:1 info._qubit:0 old:2
[debug]    new:3 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 0 output: 3 -> 3
[debug]    Gate 4 (t)
[debug]    new:1 info._qubit:2 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 5 (cx)
[debug]    new:1 info._qubit:1 old:2
[debug]    new:3 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 2 output: 3 -> 3
[debug]    Gate 6 (t)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 7 (tdg)
[debug]    new:1 info._qubit:2 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 8 (cx)
[debug]    new:1 info._qubit:0 old:2
[debug]    new:3 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 0 output: 3 -> 3
[debug]    Gate 9 (cx)
[debug]    new:1 info._qubit:0 old:0
[debug]    new:3 info._qubit:1 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 10 (t)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 11 (tdg)
[debug]    new:1 info._qubit:1 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 12 (cx)
[debug]    new:1 info._qubit:0 old:1
[debug]    new:3 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 0 output: 3 -> 3
[debug]    Gate 13 (t)
[debug]    new:1 info._qubit:2 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 14 (h)
[debug]    new:1 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 1 output: 3 -> 3
[info]     Successfully created and checked out to Tensor 2
[info]     Note: Replacing Tensor 2...

qsyn> logger warning

qsyn> qcir read benchmark/qasm/qc2ts/toffoli_qiskit.qasm -r

qsyn> logger trace
[info]     Setting logger level to "trace"

qsyn> qc2ts
[info]     Converting to QCir 0 to tensor 3...
[debug]    Add boundary
[trace]      - Add Qubit 0 input port: 1
[trace]      - Add Qubit 2 input port: 3
[trace]      - Add Qubit 4 input port: 5
[debug]    Gate 0 (rz)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 4 -> 4 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 0 output: 1 -> 1
[debug]    Gate 1 (cx)
[debug]    new:1 info._qubit:1 old:2
[debug]    new:3 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 4 -> 4 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 0 output: 3 -> 3
[trace]      - Qubit: 0 input : 0 -> 1 output: 1 -> 2
[debug]    Gate 2 (rz)
[debug]    new:1 info._qubit:0 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 4 -> 4 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 3 -> 3
[trace]      - Qubit: 0 input : 1 -> 0 output: 2 -> 2
[debug]    Gate 3 (cx)
[debug]    new:1 info._qubit:2 old:4
[debug]    new:3 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 4 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 2 output: 3 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 2 -> 3
[debug]    Gate 4 (rz)
[debug]    new:1 info._qubit:0 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 0 output: 3 -> 3
[debug]    Gate 5 (cx)
[debug]    new:1 info._qubit:1 old:2
[debug]    new:3 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 7 (rz)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 1 output: 3 -> 3
[debug]    Gate 6 (rz)
[debug]    new:1 info._qubit:0 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 0 output: 3 -> 3
[debug]    Gate 8 (cx)
[debug]    new:1 info._qubit:2 old:2
[debug]    new:3 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 13 (cx)
[debug]    new:1 info._qubit:2 old:0
[debug]    new:3 info._qubit:1 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 2 output: 3 -> 3
[debug]    Gate 14 (rz)
[debug]    new:1 info._qubit:1 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 15 (cx)
[debug]    new:1 info._qubit:2 old:1
[debug]    new:3 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 22 (rz)
[debug]    new:1 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 9 (rz)
[debug]    new:1 info._qubit:0 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 0 output: 3 -> 3
[debug]    Gate 10 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 11 (rz)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 12 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 16 (cx)
[debug]    new:1 info._qubit:1 old:2
[debug]    new:3 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 17 (rz)
[debug]    new:1 info._qubit:0 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 0 output: 3 -> 3
[debug]    Gate 18 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 19 (rz)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 20 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 21 (rz)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 23 (cx)
[debug]    new:1 info._qubit:2 old:2
[debug]    new:3 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 24 (rz)
[debug]    new:1 info._qubit:0 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 0 output: 3 -> 3
[debug]    Gate 25 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 26 (rz)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 27 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 28 (rz)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 29 (cx)
[debug]    new:1 info._qubit:1 old:2
[debug]    new:3 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 30 (rz)
[debug]    new:1 info._qubit:0 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 0 output: 3 -> 3
[debug]    Gate 31 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 32 (rz)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 33 (sx)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 34 (rz)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[info]     Successfully created and checked out to Tensor 3
[info]     Note: Replacing Tensor 3...

qsyn> logger warning

qsyn> qcir read benchmark/SABRE/small/3_17_13.qasm

qsyn> qcir print --diagram
Q 0  -----------------cx( 1)-- h( 3)-- t( 6)----------------------------------cx( 8)----------cx( 9)-- t(14)--------------------------cx(15)----------cx(16)-- h(18)-- t(20)------------------cx(23)--------------------------cx(25)----------cx(27)--td(28)--------------------------cx(32)----------cx(33)-
Q 1  ---------------------------------cx( 2)-- t( 4)----------cx( 7)--------------------------cx( 9)----------cx(11)--td(12)--------------------------cx(16)----------cx(17)-- t(21)----------cx(23)----------cx(24)--td(26)------------------cx(27)--td(29)----------cx(31)--------------------------cx(33)----------cx(35)-
Q 2  - x( 0)----------cx( 1)----------cx( 2)-- t( 5)----------cx( 7)----------cx( 8)--td(10)------------------cx(11)--td(13)----------cx(15)--------------------------cx(17)-- h(19)-- t(22)------------------cx(24)----------cx(25)-- t(30)--------------------------cx(31)----------cx(32)-- h(34)------------------cx(35)-

qsyn> logger trace
[info]     Setting logger level to "trace"

qsyn> qc2ts
[info]     Converting to QCir 1 to tensor 4...
[debug]    Add boundary
[trace]      - Add Qubit 0 input port: 1
[trace]      - Add Qubit 2 input port: 3
[trace]      - Add Qubit 4 input port: 5
[debug]    Gate 0 (x)
[debug]    new:1 info._qubit:2 old:4
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 4 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 3 output: 3 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 1 -> 2
[debug]    Gate 1 (cx)
[debug]    new:1 info._qubit:0 old:1
[debug]    new:3 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 3 -> 3 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 0 output: 2 -> 2
[debug]    Gate 3 (h)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 3 -> 3 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 2 -> 2
[debug]    Gate 6 (t)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 3 -> 3 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 2 -> 2
[debug]    Gate 2 (cx)
[debug]    new:1 info._qubit:2 old:1
[debug]    new:3 info._qubit:1 old:3
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 3 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 2 output: 2 -> 3
[debug]    Gate 5 (t)
[debug]    new:1 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 4 (t)
[debug]    new:1 info._qubit:1 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 7 (cx)
[debug]    new:1 info._qubit:2 old:1
[debug]    new:3 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 8 (cx)
[debug]    new:1 info._qubit:0 old:2
[debug]    new:3 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 0 output: 3 -> 3
[debug]    Gate 10 (tdg)
[debug]    new:1 info._qubit:2 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 9 (cx)
[debug]    new:1 info._qubit:1 old:2
[debug]    new:3 info._qubit:0 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 1 output: 3 -> 3
[debug]    Gate 11 (cx)
[debug]    new:1 info._qubit:1 old:0
[debug]    new:3 info._qubit:2 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 2 output: 3 -> 3
[debug]    Gate 12 (tdg)
[debug]    new:1 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 13 (tdg)
[debug]    new:1 info._qubit:2 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 14 (t)
[debug]    new:1 info._qubit:0 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 0 output: 3 -> 3
[debug]    Gate 15 (cx)
[debug]    new:1 info._qubit:0 old:0
[debug]    new:3 info._qubit:2 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 16 (cx)
[debug]    new:1 info._qubit:1 old:2
[debug]    new:3 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 18 (h)
[debug]    new:1 info._qubit:0 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 0 output: 3 -> 3
[debug]    Gate 20 (t)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 17 (cx)
[debug]    new:1 info._qubit:2 old:2
[debug]    new:3 info._qubit:1 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 2 output: 3 -> 3
[debug]    Gate 19 (h)
[debug]    new:1 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 22 (t)
[debug]    new:1 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 21 (t)
[debug]    new:1 info._qubit:1 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 23 (cx)
[debug]    new:1 info._qubit:1 old:0
[debug]    new:3 info._qubit:0 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 1 output: 3 -> 3
[debug]    Gate 24 (cx)
[debug]    new:1 info._qubit:2 old:2
[debug]    new:3 info._qubit:1 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 2 output: 3 -> 3
[debug]    Gate 26 (tdg)
[debug]    new:1 info._qubit:1 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 25 (cx)
[debug]    new:1 info._qubit:0 old:2
[debug]    new:3 info._qubit:2 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 0 output: 3 -> 3
[debug]    Gate 27 (cx)
[debug]    new:1 info._qubit:0 old:0
[debug]    new:3 info._qubit:1 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 28 (tdg)
[debug]    new:1 info._qubit:0 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 0 output: 3 -> 3
[debug]    Gate 29 (tdg)
[debug]    new:1 info._qubit:1 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 30 (t)
[debug]    new:1 info._qubit:2 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 2 output: 3 -> 3
[debug]    Gate 31 (cx)
[debug]    new:1 info._qubit:2 old:0
[debug]    new:3 info._qubit:1 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 1 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 2 output: 3 -> 3
[debug]    Gate 32 (cx)
[debug]    new:1 info._qubit:0 old:2
[debug]    new:3 info._qubit:2 old:0
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 1 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 2 -> 0 output: 3 -> 3
[debug]    Gate 34 (h)
[debug]    new:1 info._qubit:2 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 1 -> 0 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 2 output: 4 -> 4
[trace]      - Qubit: 0 input : 0 -> 1 output: 3 -> 3
[debug]    Gate 33 (cx)
[debug]    new:1 info._qubit:1 old:2
[debug]    new:3 info._qubit:0 old:1
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 0 -> 2 output: 5 -> 5
[trace]      - Qubit: 1 input : 2 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 1 output: 3 -> 3
[debug]    Gate 35 (cx)
[debug]    new:1 info._qubit:1 old:0
[debug]    new:3 info._qubit:2 old:2
[trace]    Pin Permutation
[trace]      - Qubit: 2 input : 2 -> 1 output: 5 -> 5
[trace]      - Qubit: 1 input : 0 -> 0 output: 4 -> 4
[trace]      - Qubit: 0 input : 1 -> 2 output: 3 -> 3
[info]     Successfully created and checked out to Tensor 4
[info]     Note: Replacing Tensor 4...

qsyn> logger warning

qsyn> quit -f

