DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr benchmark/benchmark_SABRE/small/qft_4.qasm

qsyn> qc2zx

qsyn> zxgas 0 I X 0

qsyn> zxgas 1 I X 0

qsyn> zxgas 2 I X 0

qsyn> zxgas 0 O X 0

qsyn> zxgas 1 O X 0

qsyn> zxgas 2 O X 0

qsyn> zxgp -v

ID:   6 (â—, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (15, -) 
ID:   7 (â—, 0)           (Qubit, Col): (3, 6)	  #Neighbors:   1     (19, -) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (9, -) (10, -) (20, -) 
ID:   9 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (8, -) (12, -) (21, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   3     (8, -) (11, -) (14, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 2)	  #Neighbors:   3     (10, -) (13, -) (22, -) 
ID:  12 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 3)	  #Neighbors:   3     (9, -) (13, -) (16, -) 
ID:  13 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 3)	  #Neighbors:   3     (11, -) (12, -) (18, -) 
ID:  14 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 3)	  #Neighbors:   3     (10, -) (15, -) (23, -) 
ID:  15 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 3)	  #Neighbors:   3     (6, -) (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 4)	  #Neighbors:   3     (12, -) (17, -) (24, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 4)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 5)	  #Neighbors:   3     (13, -) (19, -) (25, -) 
ID:  19 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 5)	  #Neighbors:   3     (7, -) (17, -) (18, -) 
ID:  20 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:  22 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (11, -) 
ID:  23 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (14, -) 
ID:  24 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (16, -) 
ID:  25 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (18, -) 
Total #Vertices: 20


qsyn> zxgs -FR

All rules applied in order:
Spider Fusion Rule            3 iterations.
Identity Removal Rule         1 iterations.
Spider Fusion Rule            1 iterations.
Pivot Rule                    1 iterations.
Identity Removal Rule         1 iterations.

qsyn> zxgp -v

ID:   6 (â—, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (7, -) 
ID:   7 (â—, 0)           (Qubit, Col): (3, 6)	  #Neighbors:   1     (6, -) 
Total #Vertices: 2


qsyn> zx2ts
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.+0.i,  0.+0.i},
 { 0.+0.i,  1.+0.i}}
#Dim:    2	Info: ZX 0

qsyn> qq -f

