DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qccr benchmark/benchmark_SABRE/small/qft_4.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qc2zx

qsyn> zxgas 0 I X pi

qsyn> zxgas 1 I X pi

qsyn> zxgas 2 I X pi

qsyn> zxgp -v

ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(16, -) 
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(18, -) 
ID:	6	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(15, -) 
ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(19, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(9, -) (10, -) (20, -) 
ID:	9	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(8, -) (12, -) (21, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(8, -) (11, -) (14, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(10, -) (13, -) (22, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(9, -) (13, -) (16, -) 
ID:	13	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(11, -) (12, -) (18, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (10, -) (15, -) 
ID:	15	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(6, -) (14, -) (17, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (12, -) (17, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(15, -) (16, -) (19, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(5, -) (13, -) (19, -) 
ID:	19	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(7, -) (17, -) (18, -) 
ID:	20	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	1	(8, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	π	#Neighbors:	1	(9, -) 
ID:	22	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	π	#Neighbors:	1	(11, -) 
Total #Vertices: 20


qsyn> zx2ts
Stored the resulting tensor as tensor id 0

qsyn> zxgs -SR

qsyn> zxgp -v

ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(9, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(20, -) 
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(11, -) 
ID:	6	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(15, -) 
ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(15, -) 
ID:	9	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	π	#Neighbors:	1	(1, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	1	(5, -) 
ID:	15	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	π	#Neighbors:	2	(6, -) (7, -) 
ID:	20	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 9


qsyn> zx2ts
Stored the resulting tensor as tensor id 1

qsyn> tsp 1
{{-6.305713e-33+0.000000e+00i,  6.305713e-33+1.029801e-16i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   6.305713e-33+1.029801e-16i,  1.681793e+00-2.059602e-16i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 6.305713e-33+1.029801e-16i, -6.305713e-33+0.000000e+00i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   1.681793e+00-2.059602e-16i,  6.305713e-33+1.029801e-16i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i}}
#Dim:    2	Info: ZX 0

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> q -f

