DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccp -q
Error: QCir list is empty now. Please QCNEW/QCCRead/QCBAdd before QCCPrint.

qsyn> qcga -cx 0 1
Error: QCir list is empty now. Please QCNEW/QCCRead/QCBAdd before QCGAdd.

qsyn> qcba
Note: QCir list is empty now. Create a new one.
Create and checkout to QCir 0

qsyn> qccp -q
Q 0  

qsyn> qcga -h
Error: Missing option after (-h)!!

qsyn> qcga -h 0

qsyn> qccp -q
Q 0  - h( 0)-

qsyn> qcga -cx 0 1
Error: qubit ID is not in current circuit!!
Error: Illegal option!! (1)

qsyn> qcba 3

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  
Q 2  
Q 3  

qsyn> qcga -cx 0 2

qsyn> qccp -q
Q 0  - h( 0)--cx( 1)-
Q 1  
Q 2  ---------cx( 1)-
Q 3  

qsyn> qcga -cx 1 3

qsyn> qccp -q
Q 0  - h( 0)--cx( 1)-
Q 1  -cx( 2)-
Q 2  ---------cx( 1)-
Q 3  -cx( 2)-

qsyn> qcga -t 2

qsyn> qcga -cx 2 1

qsyn> qcga -x 3

qsyn> qcga -t 3

qsyn> qcga -cx 3 2

qsyn> qcga -cx 0 1

qsyn> qccp -q
Q 0  - h( 0)--cx( 1)------------------cx( 8)-
Q 1  -cx( 2)------------------cx( 4)--cx( 8)-
Q 2  ---------cx( 1)-- t( 3)--cx( 4)--cx( 7)-
Q 3  -cx( 2)-- x( 5)-- t( 6)----------cx( 7)-

qsyn> qcga -pr -rz -ph 0.00001 0

qsyn> qcga -pr -rz -ph 1.2345 0

qsyn> qcgp 10
          ┌────┐ 
Q0 Start ─┤ RZ ├─ G9
          └────┘ 
Rotate Phase: 112π/285

qsyn> qcgp 9 -t
        ┌────┐ 
Q0 G10 ─┤ RZ ├─ G0
        └────┘ 
Rotate Phase: 0
Execute at t= 1

qsyn> qccp -q
Q 0  -rz(10)--rz( 9)-- h( 0)--cx( 1)------------------cx( 8)-
Q 1  -cx( 2)----------------------------------cx( 4)--cx( 8)-
Q 2  -------------------------cx( 1)-- t( 3)--cx( 4)--cx( 7)-
Q 3  -cx( 2)-- x( 5)-- t( 6)--------------------------cx( 7)-

qsyn> qcgd 2

qsyn> qcgd 4

qsyn> qcgd 8

qsyn> qcgd 7

qsyn> qcbd 1

qsyn> qccp -q
Q 0  -rz(10)--rz( 9)-- h( 0)--cx( 1)-
Q 2  -------------------------cx( 1)-- t( 3)-
Q 3  - x( 5)-- t( 6)-

qsyn> qccop
Successfully copied QCir 0 to QCir 1
Checkout to QCir 1

qsyn> qcba

qsyn> qccp -q
Q 0  -rz(10)--rz( 9)-- h( 0)--cx( 1)-
Q 2  -------------------------cx( 1)-- t( 3)-
Q 3  - x( 5)-- t( 6)-
Q 4  

qsyn> qcga -pr -cx 0 4

qsyn> qcga -cx 2 4

qsyn> qcga -pr -rz -ph 1.2345 0

qsyn> qccp -q
Q 0  -rz(13)--cx(11)--rz(10)--rz( 9)-- h( 0)--cx( 1)-
Q 2  -----------------------------------------cx( 1)-- t( 3)--cx(12)-
Q 3  - x( 5)-- t( 6)-
Q 4  ---------cx(11)------------------------------------------cx(12)-

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgp
Graph 0( 4 inputs, 4 outputs, 21 vertices, 20 edges )

qsyn> qq -f

