qsyn> ver 2
Note: verbose level is set to 2

qsyn> qccr benchmark/pseudoSimp/toGraph2.qasm

qsyn> qccp -q
Q 0  -cx( 0)-- t( 1)-- h( 2)--cx( 3)-
Q 1  -cx( 0)------------------cx( 3)-

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qczxm

qsyn> zxgp
Graph 0
Inputs:        2
Outputs:       2
Vertices:      10
Edges:         10

qsyn> zxgp -e
( 4, 5 )	Type:	-
( 2, 5 )	Type:	-
( 0, 4 )	Type:	-
( 4, 6 )	Type:	-
( 6, 7 )	Type:	-
( 8, 9 )	Type:	-
( 7, 9 )	Type:	-
( 5, 8 )	Type:	-
( 9, 1 )	Type:	-
( 8, 3 )	Type:	-
Total #Edges: 10

qsyn> q -f

