DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm85a_209.qasm

qsyn> qccp -a
Clifford: 6430
└── CX: 4986
T-family: 4984
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 7.51 seconds
Total time used  : 7.51 seconds
Total memory used: 202 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed
#swap: 13578 (decomposed into CXs)

qsyn> usage
Period time used : 8643 seconds
Total time used  : 8651 seconds
Total memory used: 1045 M Bytes

qsyn> qcp -list
  0    cm85a_209           
  1    cm85a_209           QC2ZX ➔ FR ➔ ZX2QC
★ 2    cm85a_209           QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 52619 gates)
Clifford: 51107
└── CX: 47455
T-family: 1950
Others  : 0
Depth: 36104

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 14.25 seconds
Total time used  : 8665 seconds
Total memory used: 1060 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> zxp -list
  0    cm85a_209           QC2ZX ➔ FR
  1    cm85a_209           QC2ZX ➔ FR ➔ ZX2QC
★ 2    cm85a_209           QC2ZX ➔ FR ➔ ZX2QC ➔ QC2ZX ➔ FR

qsyn> exts -p false

qsyn> zxch 0

qsyn> zx2qc
Finish extracting!

qsyn> qcp -list
  0    cm85a_209           
  1    cm85a_209           QC2ZX ➔ FR ➔ ZX2QC
  2    cm85a_209           QC2ZX ➔ FR ➔ ZX2QC (Physical)
★ 3    cm85a_209           QC2ZX ➔ FR ➔ ZX2QC

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  36546
Total Time:     99120
#SWAP:          13877


qsyn> qccp
QCir 4( 16 qubits, 52142 gates)
Clifford: 50630
└── CX: 46978
T-family: 1950
Others  : 0
Depth: 36546

qsyn> qq -f

