DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/hwb8_113.qasm

qsyn> qccp -a
Clifford: 39042
└── CX: 30372
T-family: 30338
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 30.85 seconds
Total time used  : 30.85 seconds
Total memory used: 707.4 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed
#swap: 49152 (decomposed into CXs)

qsyn> usage
Period time used : 5287 seconds
Total time used  : 5318 seconds
Total memory used: 1521 M Bytes

qsyn> qcp -list
  0    hwb8_113            
  1    hwb8_113            QC2ZX ➔ FR ➔ ZX2QC
★ 2    hwb8_113            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 214788 gates)
Clifford: 204414
└── CX: 175380
T-family: 14934
Others  : 0
Depth: 170911

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 425.6 seconds
Total time used  : 5744 seconds
Total memory used: 1699 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> zxp -list
  0    hwb8_113            QC2ZX ➔ FR
  1    hwb8_113            QC2ZX ➔ FR ➔ ZX2QC
★ 2    hwb8_113            QC2ZX ➔ FR ➔ ZX2QC ➔ QC2ZX ➔ FR

qsyn> exts -p false

qsyn> zxch 0

qsyn> zx2qc
Finish extracting!

qsyn> qcp -list
  0    hwb8_113            
  1    hwb8_113            QC2ZX ➔ FR ➔ ZX2QC
  2    hwb8_113            QC2ZX ➔ FR ➔ ZX2QC (Physical)
★ 3    hwb8_113            QC2ZX ➔ FR ➔ ZX2QC

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  172235
Total Time:     394124
#SWAP:          49947


qsyn> qccp
QCir 4( 16 qubits, 216766 gates)
Clifford: 206392
└── CX: 177358
T-family: 14934
Others  : 0
Depth: 172235

qsyn> qq -f

