DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/inc_237.qasm

qsyn> qccp -a
Clifford: 5985
└── CX: 4636
T-family: 4634
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 7.45 seconds
Total time used  : 7.45 seconds
Total memory used: 279 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed
#swap: 8018 (decomposed into CXs)

qsyn> usage
Period time used : 2168 seconds
Total time used  : 2176 seconds
Total memory used: 438.1 M Bytes

qsyn> qcp -list
  0    inc_237             
  1    inc_237             QC2ZX ➔ FR ➔ ZX2QC
★ 2    inc_237             QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 33037 gates)
Clifford: 31469
└── CX: 27869
T-family: 1942
Others  : 0
Depth: 24162

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.97 seconds
Total time used  : 2184 seconds
Total memory used: 453.1 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> zxp -list
  0    inc_237             QC2ZX ➔ FR
  1    inc_237             QC2ZX ➔ FR ➔ ZX2QC
★ 2    inc_237             QC2ZX ➔ FR ➔ ZX2QC ➔ QC2ZX ➔ FR

qsyn> exts -p false

qsyn> zxch 0

qsyn> zx2qc
Finish extracting!

qsyn> qcp -list
  0    inc_237             
  1    inc_237             QC2ZX ➔ FR ➔ ZX2QC
  2    inc_237             QC2ZX ➔ FR ➔ ZX2QC (Physical)
★ 3    inc_237             QC2ZX ➔ FR ➔ ZX2QC

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  24528
Total Time:     61204
#SWAP:          8143


qsyn> qccp
QCir 4( 16 qubits, 33186 gates)
Clifford: 31618
└── CX: 28018
T-family: 1942
Others  : 0
Depth: 24528

qsyn> qq -f

