DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/root_255.qasm

qsyn> qccp -a
Clifford: 9669
└── CX: 7493
T-family: 7490
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 16.86 seconds
Total time used  : 16.86 seconds
Total memory used: 537.7 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed
#swap: 18717 (decomposed into CXs)

qsyn> usage
Period time used : 8551 seconds
Total time used  : 8568 seconds
Total memory used: 1088 M Bytes

qsyn> qcp -list
  0    root_255            
  1    root_255            QC2ZX ➔ FR ➔ ZX2QC
★ 2    root_255            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 73310 gates)
Clifford: 71144
└── CX: 65098
T-family: 3114
Others  : 0
Depth: 50436

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 31.29 seconds
Total time used  : 8599 seconds
Total memory used: 1163 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> zxp -list
  0    root_255            QC2ZX ➔ FR
  1    root_255            QC2ZX ➔ FR ➔ ZX2QC
★ 2    root_255            QC2ZX ➔ FR ➔ ZX2QC ➔ QC2ZX ➔ FR

qsyn> exts -p false

qsyn> zxch 0

qsyn> zx2qc
Finish extracting!

qsyn> qcp -list
  0    root_255            
  1    root_255            QC2ZX ➔ FR ➔ ZX2QC
  2    root_255            QC2ZX ➔ FR ➔ ZX2QC (Physical)
★ 3    root_255            QC2ZX ➔ FR ➔ ZX2QC

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  50640
Total Time:     136906
#SWAP:          18810


qsyn> qccp
QCir 4( 16 qubits, 72559 gates)
Clifford: 70393
└── CX: 64347
T-family: 3114
Others  : 0
Depth: 50640

qsyn> qq -f

