DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqrt8_260.qasm

qsyn> qccp -a
Clifford: 1700
└── CX: 1314
T-family: 1309
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.48 seconds
Total time used  : 0.48 seconds
Total memory used: 33.25 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed
#swap: 3268 (decomposed into CXs)

qsyn> usage
Period time used : 702.7 seconds
Total time used  : 703.1 seconds
Total memory used: 131.9 M Bytes

qsyn> qcp -list
  0    sqrt8_260           
  1    sqrt8_260           QC2ZX ➔ FR ➔ ZX2QC
★ 2    sqrt8_260           QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 13067 gates)
Clifford: 12804
└── CX: 11489
T-family: 581
Others  : 0
Depth: 9025

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.04 seconds
Total time used  : 704.2 seconds
Total memory used: 145.8 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> zxp -list
  0    sqrt8_260           QC2ZX ➔ FR
  1    sqrt8_260           QC2ZX ➔ FR ➔ ZX2QC
★ 2    sqrt8_260           QC2ZX ➔ FR ➔ ZX2QC ➔ QC2ZX ➔ FR

qsyn> exts -p false

qsyn> zxch 0

qsyn> zx2qc
Finish extracting!

qsyn> qcp -list
  0    sqrt8_260           
  1    sqrt8_260           QC2ZX ➔ FR ➔ ZX2QC
  2    sqrt8_260           QC2ZX ➔ FR ➔ ZX2QC (Physical)
★ 3    sqrt8_260           QC2ZX ➔ FR ➔ ZX2QC

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  9160
Total Time:     23038
#SWAP:          3116


qsyn> qccp
QCir 4( 16 qubits, 12308 gates)
Clifford: 12045
└── CX: 10730
T-family: 581
Others  : 0
Depth: 9160

qsyn> qq -f

