DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 2
Note: verbose level is set to 2

qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn

qsyn> zxge -addi 0

qsyn> zxge -addo 0

qsyn> zxge -addv 0 Z 0

qsyn> zxge -addv 0 Z 0

qsyn> zxge -adde 0 2 SIMPLE

qsyn> zxge -adde 2 3 SIMPLE

qsyn> zxge -adde 3 1 SIMPLE

qsyn> zx2ts
---- TRAVERSE AND BUILD THE TENSOR ----
Stored the resulting tensor as tensor id 0

qsyn> zxge -adde 2 3 SIMPLE

qsyn> zx2ts
---- TRAVERSE AND BUILD THE TENSOR ----
Stored the resulting tensor as tensor id 1

qsyn> ver 3
Note: verbose level is set to 3

qsyn> tsp -l
Tensor    0: #Dim:    2	Info: ZX 0
Tensor    1: #Dim:    2	Info: ZX 0
Total #Tensor: 2

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 0 1 -Strict
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> q -f

