qsyn> ver 2
Note: verbose level is set to 2

qsyn> qcba 2

qsyn> qcga -cx 0 1

qsyn> qcga -cx 1 0

qsyn> qcga -cx 0 1

qsyn> qctsm
Stored the resulting tensor as tensor id 0

qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxgr benchmark/zx/swap.zx

qsyn> zxgtsm
Stored the resulting tensor as tensor id 1

qsyn> ver 3
Note: verbose level is set to 3

qsyn> tsp -l
Tensor    0: #Dim:    2	Info: QC
Tensor    1: #Dim:    2	Info: ZX 0
Total #Tensor: 2

qsyn> tseq 0 1 -Strict
[1m[31mNot Equivalent[0m[0m

qsyn> q -f

