DV Lab, NTUEE, Qsyn 0.5.1
qsyn> ver 2
Note: verbose level is set to 2

qsyn> qcba 2
Note: QCir list is empty now. Create a new one.

qsyn> qcga -cx 0 1

qsyn> qcga -cx 1 0

qsyn> qcga -cx 0 1

qsyn> qc2ts

qsyn> zxgr benchmark/zx/swap.zx

qsyn> zx2ts

qsyn> ver 3
Note: verbose level is set to 3

qsyn> tsp -l
  0                        QC2TS
★ 1    swap                ZX2TS

qsyn> tseq 0 1 -Strict
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> tsr

qsyn> zxr

qsyn> ver 2
Note: verbose level is set to 2

qsyn> zxgr benchmark/zx/tof3.zx

qsyn> zx2ts

qsyn> zxgr benchmark/zx/tof3_ZH.zx

qsyn> zx2ts

qsyn> ver 3
Note: verbose level is set to 3

qsyn> tsp -l
  0    tof3                ZX2TS
★ 1    tof3_ZH             ZX2TS

qsyn> tseq 0 1 
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 0 1 -Strict
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

