qsyn> qcba 2
Note: QCir list is empty now. Create a new one.

qsyn> qcga cx 0 1

qsyn> qcga cx 1 0

qsyn> qcga cx 0 1

qsyn> qc2ts

qsyn> zxgr benchmark/zx/swap.zx

qsyn> zx2ts

qsyn> tsp -l
  0                        #Dim: 2   QC2TS
★ 1    swap                #Dim: 2   ZX2TS

qsyn> tseq 0 1 -strict
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> tsr

qsyn> zxr

qsyn> zxgr benchmark/zx/tof3.zx

qsyn> zx2ts

qsyn> zxgr benchmark/zx/tof3_zh.zx

qsyn> zx2ts

qsyn> tsp -l
  0    tof3                #Dim: 2   ZX2TS
★ 1    tof3_zh             #Dim: 2   ZX2TS

qsyn> tseq 0 1 
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 0 1 -strict
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

