qsyn> qcba 2
Note: QCir list is empty now. Create a new one.

qsyn> qcga cx 0 1

qsyn> qcga cx 1 0

qsyn> qcga cx 0 1

qsyn> qc2ts

qsyn> zxgr benchmark/zx/swap.zx

qsyn> zx2ts

qsyn> tensor list
  0                        #Dim: 2   QC2TS
â˜… 1    swap                #Dim: 2   ZX2TS

qsyn> tensor equiv 0 1 -strict
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> tensor clear

qsyn> zxr

qsyn> zxgr benchmark/zx/tof3.zx

qsyn> zx2ts

qsyn> zxgr benchmark/zx/tof3_zh.zx

qsyn> zx2ts

qsyn> tensor list
  0    tof3                #Dim: 2   ZX2TS
â˜… 1    tof3_zh             #Dim: 2   ZX2TS

qsyn> tensor equiv 0 1 
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> tensor equiv 0 1 -strict
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> quit -f

