qsyn> ver 2
Note: verbose level is set to 2

qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxgr benchmark/zx/tof3.zx

qsyn> zxgtsm

qsyn> zxgr benchmark/zx/tof3_ZH.zx

qsyn> zxgtsm

qsyn> ver 3
Note: verbose level is set to 3

qsyn> tsp
Tensor    0: #Dim:    2	Info: ZX 0
Tensor    1: #Dim:    2	Info: ZX 1
Total #Tensor: 2

qsyn> tsp -l
Tensor    0: #Dim:    2	Info: ZX 0
Tensor    1: #Dim:    2	Info: ZX 1
Total #Tensor: 2

qsyn> tsp -l 1
#Dim:    2	Info: ZX 1

qsyn> tsp 0 -l
#Dim:    2	Info: ZX 0

qsyn> tsp 0
{{1.000000e+00 -3.532708e-16i, 0.000000e+00 +3.532708e-16i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +3.532708e-16i, 1.000000e+00 -3.532708e-16i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  1.000000e+00 -6.585821e-16i, 0.000000e+00 +4.795947e-17i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +4.795947e-17i, 1.000000e+00 -6.585821e-16i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  1.000000e+00 -6.503350e-16i, 5.551115e-17 +5.620665e-17i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  5.551115e-17 +5.620665e-17i, 1.000000e+00 -6.503350e-16i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  5.551115e-17 -2.390763e-16i, 1.000000e+00 -5.530948e-16i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i, 
  1.000000e+00 -5.530948e-16i, 5.551115e-17 -2.390763e-16i}}
#Dim:    2	Info: ZX 0

qsyn> tsp 1
{{ 1.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i, 
   0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  1.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i, 
   0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  1.      +0.i,  0.      +0.i,  0.      +0.i, 
   0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  1.      +0.i,  0.      +0.i, 
   0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,  1.      +0.i, 
   0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i, 
   1.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i, 
   0.      +0.i,  0.      +0.i,  1.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i, 
   0.      +0.i,  1.      +0.i,  0.      +0.i}}
#Dim:    2	Info: ZX 1

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> q -f

