qsyn> ver 2
Note: verbose level is set to 2

qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxgr benchmark/zx/tof3.zx

qsyn> zxgtsm
Stored the resulting tensor as tensor id 0

qsyn> zxgr benchmark/zx/tof3_ZH.zx

qsyn> zxgtsm
Stored the resulting tensor as tensor id 1

qsyn> ver 3
Note: verbose level is set to 3

qsyn> tsp -l
Tensor    0: #Dim:    2	Info: ZX 0
Tensor    1: #Dim:    2	Info: ZX 1
Total #Tensor: 2

qsyn> tseq 0 1 
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 0 1 -Strict
[1m[31mNot Equivalent[0m[0m

qsyn> q -f

