DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/9symml_195.qasm

qsyn> qccp -a
Clifford: 19649
└── CX: 15232
T-family: 15232
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 39.95 seconds
Total time used  : 39.95 seconds
Total memory used: 968 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 1.009e+04 seconds
Total time used  : 1.013e+04 seconds
Total memory used: 1932 M Bytes

qsyn> qcp -list
  0    9symml_195          
  1    9symml_195          QC2ZX ➔ FR ➔ ZX2QC
★ 2    9symml_195          QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 144964 gates)
Clifford: 139754
└── CX: 127970
T-family: 6450
Others  : 0
Depth: 102953

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 164.5 seconds
Total time used  : 1.03e+04 seconds
Total memory used: 1972 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> zxp -list
  0    9symml_195          QC2ZX ➔ FR
  1    9symml_195          QC2ZX ➔ FR ➔ ZX2QC
★ 2    9symml_195          QC2ZX ➔ FR ➔ ZX2QC ➔ QC2ZX ➔ FR

qsyn> exts -p false

qsyn> zxch 0

qsyn> zx2qc
Finish extracting!

qsyn> qcp -list
  0    9symml_195          
  1    9symml_195          QC2ZX ➔ FR ➔ ZX2QC
  2    9symml_195          QC2ZX ➔ FR ➔ ZX2QC (Physical)
★ 3    9symml_195          QC2ZX ➔ FR ➔ ZX2QC

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  103734
Total Time:     272344
#SWAP:          37532


qsyn> qccp
QCir 4( 16 qubits, 144669 gates)
Clifford: 139459
└── CX: 127675
T-family: 6450
Others  : 0
Depth: 103734

qsyn> qq -f

