DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/9symml_195.qasm

qsyn> qccp -a
Clifford: 19649
└── CX: 15232
T-family: 15232
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 40.41 seconds
Total time used  : 40.41 seconds
Total memory used: 968 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 1.016e+04 seconds
Total time used  : 1.02e+04 seconds
Total memory used: 1932 M Bytes

qsyn> qcp -list
  0    9symml_195          
  1    9symml_195          QC2ZX ➔ FR ➔ ZX2QC
★ 2    9symml_195          QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 144964 gates)
Clifford: 139754
└── CX: 127970
T-family: 6450
Others  : 0
Depth: 102953

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 167.3 seconds
Total time used  : 1.037e+04 seconds
Total memory used: 1971 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

