DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/adr4_197.qasm

qsyn> qccp -a
Clifford: 1941
└── CX: 1498
T-family: 1498
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.42 seconds
Total time used  : 0.42 seconds
Total memory used: 24.42 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 1268 seconds
Total time used  : 1268 seconds
Total memory used: 127.1 M Bytes

qsyn> qcp -list
  0    adr4_197            
  1    adr4_197            QC2ZX ➔ FR ➔ ZX2QC
★ 2    adr4_197            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 15802 gates)
Clifford: 15336
└── CX: 13896
T-family: 692
Others  : 0
Depth: 11222

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.09 seconds
Total time used  : 1269 seconds
Total memory used: 131.4 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

