DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm82a_208.qasm

qsyn> qccp -a
Clifford: 370
└── CX: 283
T-family: 280
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.02 seconds
Total time used  : 0.02 seconds
Total memory used: 2.375 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 46.16 seconds
Total time used  : 46.18 seconds
Total memory used: 10.11 M Bytes

qsyn> qcp -list
  0    cm82a_208           
  1    cm82a_208           QC2ZX ➔ FR ➔ ZX2QC
★ 2    cm82a_208           QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 2436 gates)
Clifford: 2410
└── CX: 2084
T-family: 122
Others  : 0
Depth: 1872

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.05 seconds
Total time used  : 46.23 seconds
Total memory used: 10.87 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

