DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm85a_209.qasm

qsyn> qccp -a
Clifford: 6430
└── CX: 4986
T-family: 4984
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 7.48 seconds
Total time used  : 7.48 seconds
Total memory used: 202.1 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 8933 seconds
Total time used  : 8940 seconds
Total memory used: 1045 M Bytes

qsyn> qcp -list
  0    cm85a_209           
  1    cm85a_209           QC2ZX ➔ FR ➔ ZX2QC
★ 2    cm85a_209           QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 52619 gates)
Clifford: 51107
└── CX: 47455
T-family: 1950
Others  : 0
Depth: 36104

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 14.71 seconds
Total time used  : 8955 seconds
Total memory used: 1061 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

