DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dc2_222.qasm

qsyn> qccp -a
Clifford: 5332
└── CX: 4131
T-family: 4130
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 4.37 seconds
Total time used  : 4.37 seconds
Total memory used: 144.3 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 2226 seconds
Total time used  : 2230 seconds
Total memory used: 434.1 M Bytes

qsyn> qcp -list
  0    dc2_222             
  1    dc2_222             QC2ZX ➔ FR ➔ ZX2QC
★ 2    dc2_222             QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 34187 gates)
Clifford: 32801
└── CX: 29502
T-family: 1758
Others  : 0
Depth: 25018

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 6.73 seconds
Total time used  : 2237 seconds
Total memory used: 443.8 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

