DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dist_223.qasm

qsyn> qccp -a
Clifford: 21428
└── CX: 16624
T-family: 16618
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 63.61 seconds
Total time used  : 63.61 seconds
Total memory used: 1103 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 1.481e+04 seconds
Total time used  : 1.487e+04 seconds
Total memory used: 2137 M Bytes

qsyn> qcp -list
  0    dist_223            
  1    dist_223            QC2ZX ➔ FR ➔ ZX2QC
★ 2    dist_223            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 148261 gates)
Clifford: 143395
└── CX: 130208
T-family: 6868
Others  : 0
Depth: 103284

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 122.6 seconds
Total time used  : 1.499e+04 seconds
Total memory used: 2181 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

