DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dist_223.qasm

qsyn> qccp -a
Clifford: 21428
└── CX: 16624
T-family: 16618
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 64.37 seconds
Total time used  : 64.37 seconds
Total memory used: 1103 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 1.519e+04 seconds
Total time used  : 1.525e+04 seconds
Total memory used: 2138 M Bytes

qsyn> qcp -list
  0    dist_223            
  1    dist_223            QC2ZX ➔ FR ➔ ZX2QC
★ 2    dist_223            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 148261 gates)
Clifford: 143395
└── CX: 130208
T-family: 6868
Others  : 0
Depth: 103284

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 122.6 seconds
Total time used  : 1.538e+04 seconds
Total memory used: 2181 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> zxp -list
  0    dist_223            QC2ZX ➔ FR
  1    dist_223            QC2ZX ➔ FR ➔ ZX2QC
★ 2    dist_223            QC2ZX ➔ FR ➔ ZX2QC ➔ QC2ZX ➔ FR

qsyn> exts -p false

qsyn> zxch 0

qsyn> zx2qc
Finish extracting!

qsyn> qcp -list
  0    dist_223            
  1    dist_223            QC2ZX ➔ FR ➔ ZX2QC
  2    dist_223            QC2ZX ➔ FR ➔ ZX2QC (Physical)
★ 3    dist_223            QC2ZX ➔ FR ➔ ZX2QC

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  105778
Total Time:     281085
#SWAP:          38348


qsyn> qccp
QCir 4( 16 qubits, 149569 gates)
Clifford: 144703
└── CX: 131516
T-family: 6868
Others  : 0
Depth: 105778

qsyn> qq -f

