DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/hwb8_113.qasm

qsyn> qccp -a
Clifford: 39042
└── CX: 30372
T-family: 30338
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 30.73 seconds
Total time used  : 30.73 seconds
Total memory used: 707.5 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 5210 seconds
Total time used  : 5241 seconds
Total memory used: 1521 M Bytes

qsyn> qcp -list
  0    hwb8_113            
  1    hwb8_113            QC2ZX ➔ FR ➔ ZX2QC
★ 2    hwb8_113            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 214788 gates)
Clifford: 204414
└── CX: 175380
T-family: 14934
Others  : 0
Depth: 170911

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 422.2 seconds
Total time used  : 5663 seconds
Total memory used: 1700 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

