DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/life_238.qasm

qsyn> qccp -a
Clifford: 12645
└── CX: 9800
T-family: 9800
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 15.18 seconds
Total time used  : 15.18 seconds
Total memory used: 373.6 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 5159 seconds
Total time used  : 5174 seconds
Total memory used: 1166 M Bytes

qsyn> qcp -list
  0    life_238            
  1    life_238            QC2ZX ➔ FR ➔ ZX2QC
★ 2    life_238            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 90985 gates)
Clifford: 87605
└── CX: 79994
T-family: 4152
Others  : 0
Depth: 65317

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 59.09 seconds
Total time used  : 5233 seconds
Total memory used: 1191 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

