DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/mlp4_245.qasm

qsyn> qccp -a
Clifford: 10620
└── CX: 8232
T-family: 8232
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 33.16 seconds
Total time used  : 33.16 seconds
Total memory used: 836.4 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 1.824e+04 seconds
Total time used  : 1.828e+04 seconds
Total memory used: 1973 M Bytes

qsyn> qcp -list
  0    mlp4_245            
  1    mlp4_245            QC2ZX ➔ FR ➔ ZX2QC
★ 2    mlp4_245            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 81132 gates)
Clifford: 78456
└── CX: 72343
T-family: 3324
Others  : 0
Depth: 57067

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 36.16 seconds
Total time used  : 1.831e+04 seconds
Total memory used: 2067 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

