DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/pm1_249.qasm

qsyn> qccp -a
Clifford: 1006
└── CX: 771
T-family: 770
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.22 seconds
Total time used  : 0.22 seconds
Total memory used: 17.82 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 159.6 seconds
Total time used  : 159.8 seconds
Total memory used: 45.02 M Bytes

qsyn> qcp -list
  0    pm1_249             
  1    pm1_249             QC2ZX ➔ FR ➔ ZX2QC
★ 2    pm1_249             QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 5257 gates)
Clifford: 4967
└── CX: 4208
T-family: 370
Others  : 0
Depth: 4256

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.27 seconds
Total time used  : 160.1 seconds
Total memory used: 47.07 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

