DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd53_251.qasm

qsyn> qccp -a
Clifford: 731
└── CX: 564
T-family: 560
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.03 seconds
Total time used  : 0.03 seconds
Total memory used: 3.621 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 27.03 seconds
Total time used  : 27.06 seconds
Total memory used: 14.43 M Bytes

qsyn> qcp -list
  0    rd53_251            
  1    rd53_251            QC2ZX ➔ FR ➔ ZX2QC
★ 2    rd53_251            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 3270 gates)
Clifford: 3098
└── CX: 2488
T-family: 280
Others  : 0
Depth: 2756

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.18 seconds
Total time used  : 27.24 seconds
Total memory used: 15.82 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

