DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd73_252.qasm

qsyn> qccp -a
Clifford: 3004
└── CX: 2319
T-family: 2317
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.42 seconds
Total time used  : 0.42 seconds
Total memory used: 25.7 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 1528 seconds
Total time used  : 1529 seconds
Total memory used: 181 M Bytes

qsyn> qcp -list
  0    rd73_252            
  1    rd73_252            QC2ZX ➔ FR ➔ ZX2QC
★ 2    rd73_252            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 23089 gates)
Clifford: 22412
└── CX: 20264
T-family: 1045
Others  : 0
Depth: 16492

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.28 seconds
Total time used  : 1531 seconds
Total memory used: 186.6 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

