DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd84_253.qasm

qsyn> qccp -a
Clifford: 7701
└── CX: 5960
T-family: 5957
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.48 seconds
Total time used  : 8.48 seconds
Total memory used: 276.2 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 5800 seconds
Total time used  : 5809 seconds
Total memory used: 689.3 M Bytes

qsyn> qcp -list
  0    rd84_253            
  1    rd84_253            QC2ZX ➔ FR ➔ ZX2QC
★ 2    rd84_253            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 58659 gates)
Clifford: 56762
└── CX: 51665
T-family: 2625
Others  : 0
Depth: 40841

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 24.91 seconds
Total time used  : 5834 seconds
Total memory used: 728.4 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

