DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqn_258.qasm

qsyn> qccp -a
Clifford: 5764
└── CX: 4459
T-family: 4459
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 4.73 seconds
Total time used  : 4.73 seconds
Total memory used: 196.9 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 3524 seconds
Total time used  : 3529 seconds
Total memory used: 498.2 M Bytes

qsyn> qcp -list
  0    sqn_258             
  1    sqn_258             QC2ZX ➔ FR ➔ ZX2QC
★ 2    sqn_258             QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 40914 gates)
Clifford: 39465
└── CX: 35315
T-family: 2097
Others  : 0
Depth: 29663

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 9.89 seconds
Total time used  : 3538 seconds
Total memory used: 514.4 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

