DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqrt8_260.qasm

qsyn> qccp -a
Clifford: 1700
└── CX: 1314
T-family: 1309
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.47 seconds
Total time used  : 0.47 seconds
Total memory used: 33.19 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 689.4 seconds
Total time used  : 689.8 seconds
Total memory used: 131.7 M Bytes

qsyn> qcp -list
  0    sqrt8_260           
  1    sqrt8_260           QC2ZX ➔ FR ➔ ZX2QC
★ 2    sqrt8_260           QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 13067 gates)
Clifford: 12804
└── CX: 11489
T-family: 581
Others  : 0
Depth: 9025

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.05 seconds
Total time used  : 690.9 seconds
Total memory used: 145.8 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

