DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/square_root_7.qasm

qsyn> qccp -a
Clifford: 4711
└── CX: 3089
T-family: 2919
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.25 seconds
Total time used  : 0.25 seconds
Total memory used: 17.69 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 2070 seconds
Total time used  : 2070 seconds
Total memory used: 173.1 M Bytes

qsyn> qcp -list
  0    square_root_7       
  1    square_root_7       QC2ZX ➔ FR ➔ ZX2QC
★ 2    square_root_7       QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 23698 gates)
Clifford: 23407
└── CX: 20799
T-family: 1109
Others  : 0
Depth: 15369

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.03 seconds
Total time used  : 2072 seconds
Total memory used: 178.3 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> zxp -list
  0    square_root_7       QC2ZX ➔ FR
  1    square_root_7       QC2ZX ➔ FR ➔ ZX2QC
★ 2    square_root_7       QC2ZX ➔ FR ➔ ZX2QC ➔ QC2ZX ➔ FR

qsyn> exts -p false

qsyn> zxch 0

qsyn> zx2qc
Finish extracting!

qsyn> qcp -list
  0    square_root_7       
  1    square_root_7       QC2ZX ➔ FR ➔ ZX2QC
  2    square_root_7       QC2ZX ➔ FR ➔ ZX2QC (Physical)
★ 3    square_root_7       QC2ZX ➔ FR ➔ ZX2QC

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  15879
Total Time:     45745
#SWAP:          6231


qsyn> qccp
QCir 4( 16 qubits, 24322 gates)
Clifford: 24031
└── CX: 21423
T-family: 1109
Others  : 0
Depth: 15879

qsyn> qq -f

