DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_149.qasm

qsyn> qccp -a
Clifford: 103986
└── CX: 80878
T-family: 80878
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 31.11 seconds
Total time used  : 31.11 seconds
Total memory used: 850.3 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 4.223e+04 seconds
Total time used  : 4.227e+04 seconds
Total memory used: 2955 M Bytes

qsyn> qcp -list
  0    urf1_149            
  1    urf1_149            QC2ZX ➔ FR ➔ ZX2QC
★ 2    urf1_149            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 696609 gates)
Clifford: 688315
└── CX: 588887
T-family: 40380
Others  : 0
Depth: 492529

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2787 seconds
Total time used  : 4.505e+04 seconds
Total memory used: 3117 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> zxp -list
  0    urf1_149            QC2ZX ➔ FR
  1    urf1_149            QC2ZX ➔ FR ➔ ZX2QC
★ 2    urf1_149            QC2ZX ➔ FR ➔ ZX2QC ➔ QC2ZX ➔ FR

qsyn> exts -p false

qsyn> zxch 0

qsyn> zx2qc
Finish extracting!

qsyn> qcp -list
  0    urf1_149            
  1    urf1_149            QC2ZX ➔ FR ➔ ZX2QC
  2    urf1_149            QC2ZX ➔ FR ➔ ZX2QC (Physical)
★ 3    urf1_149            QC2ZX ➔ FR ➔ ZX2QC

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  513404
Total Time:     1332030
#SWAP:          173244


qsyn> qccp
QCir 4( 16 qubits, 719876 gates)
Clifford: 711582
└── CX: 612154
T-family: 40380
Others  : 0
