DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_278.qasm

qsyn> qccp -a
Clifford: 33234
└── CX: 26692
T-family: 21532
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 10.32 seconds
Total time used  : 10.32 seconds
Total memory used: 376.8 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 2.615e+04 seconds
Total time used  : 2.616e+04 seconds
Total memory used: 1936 M Bytes

qsyn> qcp -list
  0    urf1_278            
  1    urf1_278            QC2ZX ➔ FR ➔ ZX2QC
★ 2    urf1_278            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 270111 gates)
Clifford: 265719
└── CX: 236212
T-family: 12772
Others  : 0
Depth: 191886

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 319.7 seconds
Total time used  : 2.648e+04 seconds
Total memory used: 2001 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

