DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_149.qasm

qsyn> qccp -a
Clifford: 103986
└── CX: 80878
T-family: 80878
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 30.51 seconds
Total time used  : 30.51 seconds
Total memory used: 850 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 3.936e+04 seconds
Total time used  : 3.939e+04 seconds
Total memory used: 2955 M Bytes

qsyn> qcp -list
  0    urf1_149            
  1    urf1_149            QC2ZX ➔ FR ➔ ZX2QC
★ 2    urf1_149            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 696609 gates)
Clifford: 688315
└── CX: 588887
T-family: 40380
Others  : 0
Depth: 492529

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2675 seconds
Total time used  : 4.207e+04 seconds
Total memory used: 3118 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

