DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf2_277.qasm

qsyn> qccp -a
Clifford: 12405
└── CX: 10066
T-family: 7707
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.41 seconds
Total time used  : 1.41 seconds
Total memory used: 73.41 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 6571 seconds
Total time used  : 6573 seconds
Total memory used: 494.3 M Bytes

qsyn> qcp -list
  0    urf2_277            
  1    urf2_277            QC2ZX ➔ FR ➔ ZX2QC
★ 2    urf2_277            QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 102167 gates)
Clifford: 101304
└── CX: 88666
T-family: 5063
Others  : 0
Depth: 73713

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 39.18 seconds
Total time used  : 6612 seconds
Total memory used: 518.6 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

