DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> dtgr ../../benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr ../../benchmark/benchmark_SABRE/large/z4_268.qasm

qsyn> qccp -a
Clifford: 1736
└── CX: 1343
T-family: 1337
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.19 seconds
Total time used  : 0.19 seconds
Total memory used: 12.68 M Bytes

qsyn> zx2qc -both
Finish extracting!
Checking...      passed

qsyn> usage
Period time used : 713.8 seconds
Total time used  : 713.9 seconds
Total memory used: 76.93 M Bytes

qsyn> qcp -list
  0    z4_268              
  1    z4_268              QC2ZX ➔ FR ➔ ZX2QC
★ 2    z4_268              QC2ZX ➔ FR ➔ ZX2QC (Physical)

qsyn> qccp
QCir 2( 16 qubits, 11164 gates)
Clifford: 10683
└── CX: 9439
T-family: 631
Others  : 0
Depth: 7923

qsyn> // Check to logical and perform identity checking
qsyn> qcch 1

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.9 seconds
Total time used  : 714.8 seconds
Total memory used: 80.22 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

