DV Lab, NTUEE, Qsyn 0.5.1
qsyn> zxn
Created and checked out to ZXGraph 0

qsyn> zxgedit -addi 0

qsyn> zxgedit -addo 0

qsyn> zxgedit -addi 1

qsyn> zxgedit -addo 1

qsyn> zxgedit -addv 0 Z 0

qsyn> zxgedit -addv 0 Z pi

qsyn> zxgedit -addi 2

qsyn> zxgedit -addo 2

qsyn> zxgedit -addi 3

qsyn> zxgedit -addo 3

qsyn> 
qsyn> zxgedit -adde 0 4 SIMPLE

qsyn> zxgedit -adde 4 1 SIMPLE

qsyn> zxgedit -adde 2 5 SIMPLE

qsyn> zxgedit -adde 5 3 SIMPLE

qsyn> zxgedit -adde 6 7 SIMPLE

qsyn> zxgedit -adde 8 9 SIMPLE

qsyn> 
qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   4 (Z, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (1, -) 
ID:   5 (Z, π)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (2, -) (3, -) 
ID:   6 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (7, -) 
ID:   7 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   8 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (9, -) 
ID:   9 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (8, -) 
Total #Vertices: 10


qsyn> zxgp -e
( 0, 4 )	Type:	-
( 1, 4 )	Type:	-
( 2, 5 )	Type:	-
( 3, 5 )	Type:	-
( 6, 7 )	Type:	-
( 8, 9 )	Type:	-
Total #Edges: 6

qsyn> 
qsyn> ver 8
Note: verbose level is set to 8

qsyn> zx2ts
Traverse and build the tensor... 
Topological order from first input: 8 9 6 7 2 5 3 0 4 1 
Size of topological order: 10
> Mapping vertex 8 (●): New Subgraph
  - Current frontiers: 
    8--9 (-) axis id: 1
> Mapping vertex 9 (●): Boundary Node
  - Current frontiers: 
    8--9 (-) axis id: 1
> Mapping vertex 6 (●): New Subgraph
  - Current frontiers: 
    6--7 (-) axis id: 1
> Mapping vertex 7 (●): Boundary Node
  - Current frontiers: 
    6--7 (-) axis id: 1
> Mapping vertex 2 (●): New Subgraph
  - Current frontiers: 
    2--5 (-) axis id: 1
> Mapping vertex 5 (Z): Tensordot
  - Current frontiers: 
    3--5 (-) axis id: 1
> Mapping vertex 3 (●): Boundary Node
  - Current frontiers: 
    3--5 (-) axis id: 1
> Mapping vertex 0 (●): New Subgraph
  - Current frontiers: 
    0--4 (-) axis id: 1
> Mapping vertex 4 (Z): Tensordot
  - Current frontiers: 
    1--4 (-) axis id: 1
> Mapping vertex 1 (●): Boundary Node
  - Current frontiers: 
    1--4 (-) axis id: 1
Input  axis ids: 6 4 2 0
Output axis ids: 7 5 3 1
Created and checked out to Tensor 0

qsyn> zxgr benchmark/zx/cnot.zx
Add vertex (●) 0
Add vertex (●) 1
Add vertex (Z) 2
Add vertex (X) 3
Add vertex (●) 4
Add vertex (●) 5
Add edge (0, 2)
Add edge (1, 3)
Add edge (2, 3)
Add edge (2, 4)
Add edge (3, 5)
Created and checked out to ZXGraph 1

qsyn> zxgr benchmark/zx/cnot.zx
Add vertex (●) 0
Add vertex (●) 1
Add vertex (Z) 2
Add vertex (X) 3
Add vertex (●) 4
Add vertex (●) 5
Add edge (0, 2)
Add edge (1, 3)
Add edge (2, 3)
Add edge (2, 4)
Add edge (3, 5)
Created and checked out to ZXGraph 2

qsyn> zxch 0
Checked out to ZXGraph 0

qsyn> zxtensor 1
Add vertex (●) 0
Add vertex (●) 1
Add vertex (Z) 2
Add vertex (X) 3
Add vertex (●) 4
Add vertex (●) 5
Add edge (0, 2)
Add edge (1, 3)
Add edge (2, 3)
Add edge (2, 4)
Add edge (3, 5)

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   4 (Z, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (1, -) 
ID:   5 (Z, π)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (2, -) (3, -) 
ID:   6 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (7, -) 
ID:   7 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   8 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (9, -) 
ID:   9 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (8, -) 
ID:  10 (●, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (12, -) 
ID:  11 (●, 0)           (Qubit, Col): (5, 0)	  #Neighbors:   1     (13, -) 
ID:  12 (Z, 0)           (Qubit, Col): (4, 1)	  #Neighbors:   3     (10, -) (13, -) (14, -) 
ID:  13 (X, 0)           (Qubit, Col): (5, 1)	  #Neighbors:   3     (11, -) (12, -) (15, -) 
ID:  14 (●, 0)           (Qubit, Col): (4, 2)	  #Neighbors:   1     (12, -) 
ID:  15 (●, 0)           (Qubit, Col): (5, 2)	  #Neighbors:   1     (13, -) 
Total #Vertices: 16


qsyn> zxgp -e
( 0, 4 )	Type:	-
( 1, 4 )	Type:	-
( 2, 5 )	Type:	-
( 3, 5 )	Type:	-
( 6, 7 )	Type:	-
( 8, 9 )	Type:	-
( 10, 12 )	Type:	-
( 11, 13 )	Type:	-
( 12, 13 )	Type:	-
( 12, 14 )	Type:	-
( 13, 15 )	Type:	-
Total #Edges: 11

qsyn> 
qsyn> ver 8
Note: verbose level is set to 8

qsyn> zx2ts
Traverse and build the tensor... 
Topological order from first input: 10 12 13 11 15 14 8 9 6 7 2 5 3 0 4 1 
Size of topological order: 16
> Mapping vertex 10 (●): New Subgraph
  - Current frontiers: 
    10--12 (-) axis id: 1
> Mapping vertex 12 (Z): Tensordot
  - Current frontiers: 
    12--13 (-) axis id: 1
    12--14 (-) axis id: 2
> Mapping vertex 13 (X): Tensordot
  - Current frontiers: 
    12--14 (-) axis id: 1
    11--13 (-) axis id: 2
    13--15 (-) axis id: 3
> Mapping vertex 11 (●): Boundary Node
  - Current frontiers: 
    12--14 (-) axis id: 1
    11--13 (-) axis id: 2
    13--15 (-) axis id: 3
> Mapping vertex 15 (●): Boundary Node
  - Current frontiers: 
    12--14 (-) axis id: 1
    11--13 (-) axis id: 2
    13--15 (-) axis id: 3
> Mapping vertex 14 (●): Boundary Node
  - Current frontiers: 
    12--14 (-) axis id: 1
    11--13 (-) axis id: 2
    13--15 (-) axis id: 3
> Mapping vertex 8 (●): New Subgraph
  - Current frontiers: 
    8--9 (-) axis id: 1
> Mapping vertex 9 (●): Boundary Node
  - Current frontiers: 
    8--9 (-) axis id: 1
> Mapping vertex 6 (●): New Subgraph
  - Current frontiers: 
    6--7 (-) axis id: 1
> Mapping vertex 7 (●): Boundary Node
  - Current frontiers: 
    6--7 (-) axis id: 1
> Mapping vertex 2 (●): New Subgraph
  - Current frontiers: 
    2--5 (-) axis id: 1
> Mapping vertex 5 (Z): Tensordot
  - Current frontiers: 
    3--5 (-) axis id: 1
> Mapping vertex 3 (●): Boundary Node
  - Current frontiers: 
    3--5 (-) axis id: 1
> Mapping vertex 0 (●): New Subgraph
  - Current frontiers: 
    0--4 (-) axis id: 1
> Mapping vertex 4 (Z): Tensordot
  - Current frontiers: 
    1--4 (-) axis id: 1
> Mapping vertex 1 (●): Boundary Node
  - Current frontiers: 
    1--4 (-) axis id: 1
Input  axis ids: 10 8 6 4 0 2
Output axis ids: 11 9 7 5 1 3
Created and checked out to Tensor 1

qsyn> zxn
Created and checked out to ZXGraph 3

qsyn> zxgedit -addi 0
Add vertex (●) 0

qsyn> zxgedit -addo 0
Add vertex (●) 1

qsyn> zxgedit -addi 1
Add vertex (●) 2

qsyn> zxgedit -addo 1
Add vertex (●) 3

qsyn> zxgedit -addi 2
Add vertex (●) 4

qsyn> zxgedit -addo 2
Add vertex (●) 5

qsyn> zxgedit -addi 3
Add vertex (●) 6

qsyn> zxgedit -addo 3
Add vertex (●) 7

qsyn> zxgedit -addi 4
Add vertex (●) 8

qsyn> zxgedit -addo 4
Add vertex (●) 9

qsyn> 
qsyn> zxgedit -addv 0 Z 0
Add vertex (Z) 10

qsyn> zxgedit -addv 0 Z 0
Add vertex (Z) 11

qsyn> zxgedit -addv 0 Z 0
Add vertex (Z) 12

qsyn> zxgedit -addv 0 Z 0
Add vertex (Z) 13

qsyn> 
qsyn> zxgedit -addi 5
Add vertex (●) 14

qsyn> zxgedit -addo 5
Add vertex (●) 15

qsyn> zxgedit -addi 6
Add vertex (●) 16

qsyn> zxgedit -addo 6
Add vertex (●) 17

qsyn> 
qsyn> zxgedit -adde 0 1 SIMPLE
Add edge (0, 1)

qsyn> zxgedit -adde 2 10 SIMPLE
Add edge (2, 10)

qsyn> zxgedit -adde 3 11 SIMPLE
Add edge (3, 11)

qsyn> zxgedit -adde 4 12 SIMPLE
Add edge (4, 12)

qsyn> zxgedit -adde 5 12 SIMPLE
Add edge (5, 12)

qsyn> zxgedit -adde 6 12 SIMPLE
Add edge (6, 12)

qsyn> zxgedit -adde 7 13 SIMPLE
Add edge (7, 13)

qsyn> zxgedit -adde 8 13 SIMPLE
Add edge (8, 13)

qsyn> zxgedit -adde 9 13 SIMPLE
Add edge (9, 13)

qsyn> zxgedit -adde 14 16 SIMPLE
Add edge (14, 16)

qsyn> zxgedit -adde 15 17 SIMPLE
Add edge (15, 17)

qsyn> 
qsyn> 
qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (1, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (0, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (11, -) 
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (12, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (12, -) 
ID:   6 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (12, -) 
ID:   7 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (13, -) 
ID:   8 (●, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (13, -) 
ID:   9 (●, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (13, -) 
ID:  10 (Z, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:  11 (Z, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (3, -) 
ID:  12 (Z, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (4, -) (5, -) (6, -) 
ID:  13 (Z, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (7, -) (8, -) (9, -) 
ID:  14 (●, 0)           (Qubit, Col): (5, 0)	  #Neighbors:   1     (16, -) 
ID:  15 (●, 0)           (Qubit, Col): (5, 0)	  #Neighbors:   1     (17, -) 
ID:  16 (●, 0)           (Qubit, Col): (6, 0)	  #Neighbors:   1     (14, -) 
ID:  17 (●, 0)           (Qubit, Col): (6, 0)	  #Neighbors:   1     (15, -) 
Total #Vertices: 18


qsyn> zxgp -e
( 0, 1 )	Type:	-
( 2, 10 )	Type:	-
( 3, 11 )	Type:	-
( 4, 12 )	Type:	-
( 5, 12 )	Type:	-
( 6, 12 )	Type:	-
( 7, 13 )	Type:	-
( 8, 13 )	Type:	-
( 9, 13 )	Type:	-
( 14, 16 )	Type:	-
( 15, 17 )	Type:	-
Total #Edges: 11

qsyn> 
qsyn> ver 8
Note: verbose level is set to 8

qsyn> zx2ts
Traverse and build the tensor... 
Topological order from first input: 15 17 3 11 14 16 8 13 7 9 4 12 5 6 2 10 0 1 
Size of topological order: 18
> Mapping vertex 15 (●): New Subgraph
  - Current frontiers: 
    15--17 (-) axis id: 1
> Mapping vertex 17 (●): Boundary Node
  - Current frontiers: 
    15--17 (-) axis id: 1
> Mapping vertex 3 (●): New Subgraph
  - Current frontiers: 
    3--11 (-) axis id: 1
> Mapping vertex 11 (Z): Tensordot
  - Current frontiers: 
> Mapping vertex 14 (●): New Subgraph
  - Current frontiers: 
    14--16 (-) axis id: 1
> Mapping vertex 16 (●): Boundary Node
  - Current frontiers: 
    14--16 (-) axis id: 1
> Mapping vertex 8 (●): New Subgraph
  - Current frontiers: 
    8--13 (-) axis id: 1
> Mapping vertex 13 (Z): Tensordot
  - Current frontiers: 
    7--13 (-) axis id: 1
    9--13 (-) axis id: 2
> Mapping vertex 7 (●): Boundary Node
  - Current frontiers: 
    7--13 (-) axis id: 1
    9--13 (-) axis id: 2
> Mapping vertex 9 (●): Boundary Node
  - Current frontiers: 
    7--13 (-) axis id: 1
    9--13 (-) axis id: 2
> Mapping vertex 4 (●): New Subgraph
  - Current frontiers: 
    4--12 (-) axis id: 1
> Mapping vertex 12 (Z): Tensordot
  - Current frontiers: 
    5--12 (-) axis id: 1
    6--12 (-) axis id: 2
> Mapping vertex 5 (●): Boundary Node
  - Current frontiers: 
    5--12 (-) axis id: 1
    6--12 (-) axis id: 2
> Mapping vertex 6 (●): Boundary Node
  - Current frontiers: 
    5--12 (-) axis id: 1
    6--12 (-) axis id: 2
> Mapping vertex 2 (●): New Subgraph
  - Current frontiers: 
    2--10 (-) axis id: 1
> Mapping vertex 10 (Z): Tensordot
  - Current frontiers: 
> Mapping vertex 0 (●): New Subgraph
  - Current frontiers: 
    0--1 (-) axis id: 1
> Mapping vertex 1 (●): Boundary Node
  - Current frontiers: 
    0--1 (-) axis id: 1
Input  axis ids: 12 11 8 10 5 3 4
Output axis ids: 13 2 9 6 7 0 1
Created and checked out to Tensor 2

qsyn> 
qsyn> qq -f

