qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generate Graph 0
Checkout to Graph 0

qsyn> zxgedit -addi 0 0
Add input 0

qsyn> zxgedit -addo 1 0
Add output 1

qsyn> zxgedit -addi 2 1
Add input 2

qsyn> zxgedit -addo 3 1
Add output 3

qsyn> zxgedit -addv 4 0 Z 0
Add vertice 4

qsyn> zxgedit -addv 5 0 Z 3.14159
Add vertice 5

qsyn> zxgedit -addi 6 2
Add input 6

qsyn> zxgedit -addo 7 2
Add output 7

qsyn> zxgedit -addi 8 3
Add input 8

qsyn> zxgedit -addo 9 3
Add output 9

qsyn> 
qsyn> zxgedit -adde 0 4 SIMPLE
Add edge ( 0, 4 )

qsyn> zxgedit -adde 4 1 SIMPLE
Add edge ( 4, 1 )

qsyn> zxgedit -adde 2 5 SIMPLE
Add edge ( 2, 5 )

qsyn> zxgedit -adde 5 3 SIMPLE
Add edge ( 5, 3 )

qsyn> zxgedit -adde 6 7 SIMPLE
Add edge ( 6, 7 )

qsyn> zxgedit -adde 8 9 SIMPLE
Add edge ( 8, 9 )

qsyn> 
qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(5, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(5, -) 
ID:	4	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (1, -) 
ID:	5	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(2, -) (3, -) 
ID:	6	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(7, -) 
ID:	7	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(6, -) 
ID:	8	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(9, -) 
ID:	9	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(8, -) 
Total #Vertices: 10

qsyn> zxgp -e
( 0, 4 )	Type:	-
( 4, 1 )	Type:	-
( 2, 5 )	Type:	-
( 5, 3 )	Type:	-
( 6, 7 )	Type:	-
( 8, 9 )	Type:	-
Total #Edges: 6

qsyn> 
qsyn> ver 7
Note: verbose level is set to 7

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Topological order from first input: 
8 9 6 7 2 5 3 0 4 1 
Size of topological order: 10
> Mapping vertex 8 (●): New Subgraph
  - Current frontiers: 
    8--9 (-) pin id: 1
> Mapping vertex 9 (●): Boundary Node
  - Current frontiers: 
    8--9 (-) pin id: 1
> Mapping vertex 6 (●): New Subgraph
  - Current frontiers: 
    6--7 (-) pin id: 1
> Mapping vertex 7 (●): Boundary Node
  - Current frontiers: 
    6--7 (-) pin id: 1
> Mapping vertex 2 (●): New Subgraph
  - Current frontiers: 
    2--5 (-) pin id: 1
> Mapping vertex 5 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    3--5 (-) pin id: 1
> Mapping vertex 3 (●): Boundary Node
  - Current frontiers: 
    3--5 (-) pin id: 1
> Mapping vertex 0 (●): New Subgraph
  - Current frontiers: 
    0--4 (-) pin id: 1
> Mapping vertex 4 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    1--4 (-) pin id: 1
> Mapping vertex 1 (●): Boundary Node
  - Current frontiers: 
    1--4 (-) pin id: 1
6 4 2 0
7 5 3 1

The resulting tensor is: 
{{ 1.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  1.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  1.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   1.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i, -1.+1.224647e-16i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i, -1.+1.224647e-16i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
  -1.+1.224647e-16i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i, -1.+1.224647e-16i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  1.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   1.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  1.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  1.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
  -1.+1.224647e-16i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i, -1.+1.224647e-16i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i, -1.+1.224647e-16i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
  -1.+1.224647e-16i}}

qsyn> 
qsyn> q -f

