DV Lab, NTUEE, Qsyn 0.4.2
qsyn> zxn
Create and checkout to Graph 0

qsyn> zxgedit -addi 0

qsyn> zxgedit -addo 0

qsyn> zxgedit -addi 1

qsyn> zxgedit -addo 1

qsyn> zxgedit -addv 0 Z 0

qsyn> zxgedit -addv 0 Z pi

qsyn> zxgedit -addi 2

qsyn> zxgedit -addo 2

qsyn> zxgedit -addi 3

qsyn> zxgedit -addo 3

qsyn> 
qsyn> zxgedit -adde 0 4 SIMPLE

qsyn> zxgedit -adde 4 1 SIMPLE

qsyn> zxgedit -adde 2 5 SIMPLE

qsyn> zxgedit -adde 5 3 SIMPLE

qsyn> zxgedit -adde 6 7 SIMPLE

qsyn> zxgedit -adde 8 9 SIMPLE

qsyn> 
qsyn> zxgp -v

ID:   0 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   2 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   4 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (1, -) 
ID:   5 ([1m[32mZ[0m[0m, œÄ)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (2, -) (3, -) 
ID:   6 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (7, -) 
ID:   7 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   8 (‚óè, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (9, -) 
ID:   9 (‚óè, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (8, -) 
Total #Vertices: 10


qsyn> zxgp -e
( 0, 4 )	Type:	-
( 1, 4 )	Type:	-
( 2, 5 )	Type:	-
( 3, 5 )	Type:	-
( 6, 7 )	Type:	-
( 8, 9 )	Type:	-
Total #Edges: 6

qsyn> 
qsyn> ver 8
Note: verbose level is set to 8

qsyn> zx2ts
Traverse and build the tensor... 
Topological order from first input: 8 9 6 7 2 5 3 0 4 1 
Size of topological order: 10
> Mapping vertex 8 (‚óè): New Subgraph
  - Current frontiers: 
    8--9 (-) axis id: 1
> Mapping vertex 9 (‚óè): Boundary Node
  - Current frontiers: 
    8--9 (-) axis id: 1
> Mapping vertex 6 (‚óè): New Subgraph
  - Current frontiers: 
    6--7 (-) axis id: 1
> Mapping vertex 7 (‚óè): Boundary Node
  - Current frontiers: 
    6--7 (-) axis id: 1
> Mapping vertex 2 (‚óè): New Subgraph
  - Current frontiers: 
    2--5 (-) axis id: 1
> Mapping vertex 5 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    3--5 (-) axis id: 1
> Mapping vertex 3 (‚óè): Boundary Node
  - Current frontiers: 
    3--5 (-) axis id: 1
> Mapping vertex 0 (‚óè): New Subgraph
  - Current frontiers: 
    0--4 (-) axis id: 1
> Mapping vertex 4 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    1--4 (-) axis id: 1
> Mapping vertex 1 (‚óè): Boundary Node
  - Current frontiers: 
    1--4 (-) axis id: 1
Successfully added Tensor 0
Input  axis ids: 6 4 2 0
Output axis ids: 7 5 3 1
Stored the resulting tensor as tensor id 0

qsyn> zxn
Create and checkout to Graph 1

qsyn> zxgtest
Generate a 2-qubit CNOT graph for testing
Add vertex (‚óè) 0
Add vertex (‚óè) 1
Add vertex ([1m[32mZ[0m[0m) 2
Add vertex ([1m[31mX[0m[0m) 3
Add vertex (‚óè) 4
Add vertex (‚óè) 5
Add edge (0, 2)
Add edge (1, 3)
Add edge (2, 3)
Add edge (2, 4)
Add edge (3, 5)

qsyn> zxn
Create and checkout to Graph 2

qsyn> zxgtest
Generate a 2-qubit CNOT graph for testing
Add vertex (‚óè) 0
Add vertex (‚óè) 1
Add vertex ([1m[32mZ[0m[0m) 2
Add vertex ([1m[31mX[0m[0m) 3
Add vertex (‚óè) 4
Add vertex (‚óè) 5
Add edge (0, 2)
Add edge (1, 3)
Add edge (2, 3)
Add edge (2, 4)
Add edge (3, 5)

qsyn> zxch 0
Checkout to Graph 0

qsyn> zxtensor 1
Add vertex (‚óè) 0
Add vertex (‚óè) 1
Add vertex ([1m[32mZ[0m[0m) 2
Add vertex ([1m[31mX[0m[0m) 3
Add vertex (‚óè) 4
Add vertex (‚óè) 5
Add edge (0, 2)
Add edge (1, 3)
Add edge (2, 3)
Add edge (2, 4)
Add edge (3, 5)

qsyn> zxgp -v

ID:   0 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   2 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   4 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (1, -) 
ID:   5 ([1m[32mZ[0m[0m, œÄ)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (2, -) (3, -) 
ID:   6 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (7, -) 
ID:   7 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   8 (‚óè, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (9, -) 
ID:   9 (‚óè, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (8, -) 
ID:  10 (‚óè, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (12, -) 
ID:  11 (‚óè, 0)           (Qubit, Col): (5, 0)	  #Neighbors:   1     (13, -) 
ID:  12 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 1)	  #Neighbors:   3     (10, -) (13, -) (14, -) 
ID:  13 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (5, 1)	  #Neighbors:   3     (11, -) (12, -) (15, -) 
ID:  14 (‚óè, 0)           (Qubit, Col): (4, 2)	  #Neighbors:   1     (12, -) 
ID:  15 (‚óè, 0)           (Qubit, Col): (5, 2)	  #Neighbors:   1     (13, -) 
Total #Vertices: 16


qsyn> zxgp -e
( 0, 4 )	Type:	-
( 1, 4 )	Type:	-
( 2, 5 )	Type:	-
( 3, 5 )	Type:	-
( 6, 7 )	Type:	-
( 8, 9 )	Type:	-
( 10, 12 )	Type:	-
( 11, 13 )	Type:	-
( 12, 13 )	Type:	-
( 12, 14 )	Type:	-
( 13, 15 )	Type:	-
Total #Edges: 11

qsyn> 
qsyn> ver 8
Note: verbose level is set to 8

qsyn> zx2ts
Traverse and build the tensor... 
Topological order from first input: 10 12 14 13 15 11 8 9 6 7 2 5 3 0 4 1 
Size of topological order: 16
> Mapping vertex 10 (‚óè): New Subgraph
  - Current frontiers: 
    10--12 (-) axis id: 1
> Mapping vertex 12 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    12--13 (-) axis id: 1
    12--14 (-) axis id: 2
> Mapping vertex 14 (‚óè): Boundary Node
  - Current frontiers: 
    12--13 (-) axis id: 1
    12--14 (-) axis id: 2
> Mapping vertex 13 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    12--14 (-) axis id: 1
    11--13 (-) axis id: 2
    13--15 (-) axis id: 3
> Mapping vertex 15 (‚óè): Boundary Node
  - Current frontiers: 
    12--14 (-) axis id: 1
    11--13 (-) axis id: 2
    13--15 (-) axis id: 3
> Mapping vertex 11 (‚óè): Boundary Node
  - Current frontiers: 
    12--14 (-) axis id: 1
    11--13 (-) axis id: 2
    13--15 (-) axis id: 3
> Mapping vertex 8 (‚óè): New Subgraph
  - Current frontiers: 
    8--9 (-) axis id: 1
> Mapping vertex 9 (‚óè): Boundary Node
  - Current frontiers: 
    8--9 (-) axis id: 1
> Mapping vertex 6 (‚óè): New Subgraph
  - Current frontiers: 
    6--7 (-) axis id: 1
> Mapping vertex 7 (‚óè): Boundary Node
  - Current frontiers: 
    6--7 (-) axis id: 1
> Mapping vertex 2 (‚óè): New Subgraph
  - Current frontiers: 
    2--5 (-) axis id: 1
> Mapping vertex 5 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    3--5 (-) axis id: 1
> Mapping vertex 3 (‚óè): Boundary Node
  - Current frontiers: 
    3--5 (-) axis id: 1
> Mapping vertex 0 (‚óè): New Subgraph
  - Current frontiers: 
    0--4 (-) axis id: 1
> Mapping vertex 4 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    1--4 (-) axis id: 1
> Mapping vertex 1 (‚óè): Boundary Node
  - Current frontiers: 
    1--4 (-) axis id: 1
Successfully added Tensor 1
Input  axis ids: 10 8 6 4 0 2
Output axis ids: 11 9 7 5 1 3
Stored the resulting tensor as tensor id 1

qsyn> zxn
Create and checkout to Graph 3

qsyn> zxgedit -addi 0
Add vertex (‚óè) 0

qsyn> zxgedit -addo 0
Add vertex (‚óè) 1

qsyn> zxgedit -addi 1
Add vertex (‚óè) 2

qsyn> zxgedit -addo 1
Add vertex (‚óè) 3

qsyn> zxgedit -addi 2
Add vertex (‚óè) 4

qsyn> zxgedit -addo 2
Add vertex (‚óè) 5

qsyn> zxgedit -addi 3
Add vertex (‚óè) 6

qsyn> zxgedit -addo 3
Add vertex (‚óè) 7

qsyn> zxgedit -addi 4
Add vertex (‚óè) 8

qsyn> zxgedit -addo 4
Add vertex (‚óè) 9

qsyn> 
qsyn> zxgedit -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m) 10

qsyn> zxgedit -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m) 11

qsyn> zxgedit -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m) 12

qsyn> zxgedit -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m) 13

qsyn> 
qsyn> zxgedit -addi 5
Add vertex (‚óè) 14

qsyn> zxgedit -addo 5
Add vertex (‚óè) 15

qsyn> zxgedit -addi 6
Add vertex (‚óè) 16

qsyn> zxgedit -addo 6
Add vertex (‚óè) 17

qsyn> 
qsyn> zxgedit -adde 0 1 SIMPLE
Add edge (0, 1)

qsyn> zxgedit -adde 2 10 SIMPLE
Add edge (2, 10)

qsyn> zxgedit -adde 3 11 SIMPLE
Add edge (3, 11)

qsyn> zxgedit -adde 4 12 SIMPLE
Add edge (4, 12)

qsyn> zxgedit -adde 5 12 SIMPLE
Add edge (5, 12)

qsyn> zxgedit -adde 6 12 SIMPLE
Add edge (6, 12)

qsyn> zxgedit -adde 7 13 SIMPLE
Add edge (7, 13)

qsyn> zxgedit -adde 8 13 SIMPLE
Add edge (8, 13)

qsyn> zxgedit -adde 9 13 SIMPLE
Add edge (9, 13)

qsyn> zxgedit -adde 14 16 SIMPLE
Add edge (14, 16)

qsyn> zxgedit -adde 15 17 SIMPLE
Add edge (15, 17)

qsyn> 
qsyn> 
qsyn> zxgp -v

ID:   0 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (1, -) 
ID:   1 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (0, -) 
ID:   2 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (11, -) 
ID:   4 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (12, -) 
ID:   5 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (12, -) 
ID:   6 (‚óè, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (12, -) 
ID:   7 (‚óè, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (13, -) 
ID:   8 (‚óè, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (13, -) 
ID:   9 (‚óè, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (13, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:  11 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (3, -) 
ID:  12 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (4, -) (5, -) (6, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (7, -) (8, -) (9, -) 
ID:  14 (‚óè, 0)           (Qubit, Col): (5, 0)	  #Neighbors:   1     (16, -) 
ID:  15 (‚óè, 0)           (Qubit, Col): (5, 0)	  #Neighbors:   1     (17, -) 
ID:  16 (‚óè, 0)           (Qubit, Col): (6, 0)	  #Neighbors:   1     (14, -) 
ID:  17 (‚óè, 0)           (Qubit, Col): (6, 0)	  #Neighbors:   1     (15, -) 
Total #Vertices: 18


qsyn> zxgp -e
( 0, 1 )	Type:	-
( 2, 10 )	Type:	-
( 3, 11 )	Type:	-
( 4, 12 )	Type:	-
( 5, 12 )	Type:	-
( 6, 12 )	Type:	-
( 7, 13 )	Type:	-
( 8, 13 )	Type:	-
( 9, 13 )	Type:	-
( 14, 16 )	Type:	-
( 15, 17 )	Type:	-
Total #Edges: 11

qsyn> 
qsyn> ver 8
Note: verbose level is set to 8

qsyn> zx2ts
Traverse and build the tensor... 
Topological order from first input: 15 17 3 11 14 16 8 13 9 7 4 12 6 5 2 10 0 1 
Size of topological order: 18
> Mapping vertex 15 (‚óè): New Subgraph
  - Current frontiers: 
    15--17 (-) axis id: 1
> Mapping vertex 17 (‚óè): Boundary Node
  - Current frontiers: 
    15--17 (-) axis id: 1
> Mapping vertex 3 (‚óè): New Subgraph
  - Current frontiers: 
    3--11 (-) axis id: 1
> Mapping vertex 11 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
> Mapping vertex 14 (‚óè): New Subgraph
  - Current frontiers: 
    14--16 (-) axis id: 1
> Mapping vertex 16 (‚óè): Boundary Node
  - Current frontiers: 
    14--16 (-) axis id: 1
> Mapping vertex 8 (‚óè): New Subgraph
  - Current frontiers: 
    8--13 (-) axis id: 1
> Mapping vertex 13 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    7--13 (-) axis id: 1
    9--13 (-) axis id: 2
> Mapping vertex 9 (‚óè): Boundary Node
  - Current frontiers: 
    7--13 (-) axis id: 1
    9--13 (-) axis id: 2
> Mapping vertex 7 (‚óè): Boundary Node
  - Current frontiers: 
    7--13 (-) axis id: 1
    9--13 (-) axis id: 2
> Mapping vertex 4 (‚óè): New Subgraph
  - Current frontiers: 
    4--12 (-) axis id: 1
> Mapping vertex 12 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    5--12 (-) axis id: 1
    6--12 (-) axis id: 2
> Mapping vertex 6 (‚óè): Boundary Node
  - Current frontiers: 
    5--12 (-) axis id: 1
    6--12 (-) axis id: 2
> Mapping vertex 5 (‚óè): Boundary Node
  - Current frontiers: 
    5--12 (-) axis id: 1
    6--12 (-) axis id: 2
> Mapping vertex 2 (‚óè): New Subgraph
  - Current frontiers: 
    2--10 (-) axis id: 1
> Mapping vertex 10 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
> Mapping vertex 0 (‚óè): New Subgraph
  - Current frontiers: 
    0--1 (-) axis id: 1
> Mapping vertex 1 (‚óè): Boundary Node
  - Current frontiers: 
    0--1 (-) axis id: 1
Successfully added Tensor 2
Input  axis ids: 12 11 8 10 5 3 4
Output axis ids: 13 2 9 6 7 0 1
Stored the resulting tensor as tensor id 2

qsyn> 
qsyn> qq -f

