qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generate Graph 0
Checkout to Graph 0

qsyn> zxgedit -addi 0 0
Add input 0

qsyn> zxgedit -addo 1 0
Add output 1

qsyn> zxgedit -addi 2 1
Add input 2

qsyn> zxgedit -addo 3 1
Add output 3

qsyn> zxgedit -addv 4 0 Z 0
Add vertice 4

qsyn> zxgedit -addv 5 0 Z 3.14159
Add vertice 5

qsyn> 
qsyn> zxgedit -adde 0 4 SIMPLE
Add edge ( 0, 4 )

qsyn> zxgedit -adde 4 1 SIMPLE
Add edge ( 4, 1 )

qsyn> zxgedit -adde 2 5 SIMPLE
Add edge ( 2, 5 )

qsyn> zxgedit -adde 5 3 SIMPLE
Add edge ( 5, 3 )

qsyn> 
qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(5, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(5, -) 
ID:	4	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (1, -) 
ID:	5	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(2, -) (3, -) 
Total #Vertices: 6

qsyn> zxgp -e
( 0, 4 )	Type:	-
( 4, 1 )	Type:	-
( 2, 5 )	Type:	-
( 5, 3 )	Type:	-
Total #Edges: 4

qsyn> 
qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
> Mapping vertex 2 (â—): New Subgraph
> Mapping vertex 5 ([1;32mZ[0m): Tensordot
> Mapping vertex 3 (â—): Boundary Node
> Mapping vertex 0 (â—): New Subgraph
> Mapping vertex 4 ([1;32mZ[0m): Tensordot
> Mapping vertex 1 (â—): Boundary Node

The resulting tensor is: 
{{ 1.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i, -1.+1.224647e-16i,  0.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  1.+0.000000e+00i, 
   0.+0.000000e+00i},
 { 0.+0.000000e+00i,  0.+0.000000e+00i,  0.+0.000000e+00i, 
  -1.+1.224647e-16i}}

qsyn> 
qsyn> q -f

