DV Lab, NTUEE, Qsyn 0.3.0
qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgtest

qsyn> zxn
Successfully generated Graph 1
Checkout to Graph 1

qsyn> zxgtest

qsyn> zxch 0
Checkout to Graph 0

qsyn> zxtensor 1

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	6	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	7	VertexType:	â—	Qubit:	3	Phase:	0	#Neighbors:	1	(9, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(6, -) (9, -) (10, -) 
ID:	9	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(7, -) (8, -) (11, -) 
ID:	10	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	11	VertexType:	â—	Qubit:	3	Phase:	0	#Neighbors:	1	(9, -) 
Total #Vertices: 12


qsyn> zxgp -e
( 0, 2 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
( 3, 5 )	Type:	-
( 6, 8 )	Type:	-
( 7, 9 )	Type:	-
( 8, 9 )	Type:	-
( 8, 10 )	Type:	-
( 9, 11 )	Type:	-
Total #Edges: 10

qsyn> 
qsyn> ver 8
Note: verbose level is set to 8

qsyn> zx2ts
Traverse and build the tensor... 
Topological order from first input: 6 8 10 9 11 7 0 2 4 3 5 1 
Size of topological order: 12
> Mapping vertex 6 (â—): New Subgraph
  - Current frontiers: 
    6--8 (-) axis id: 1
> Mapping vertex 8 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    8--9 (-) axis id: 1
    8--10 (-) axis id: 2
> Mapping vertex 10 (â—): Boundary Node
  - Current frontiers: 
    8--9 (-) axis id: 1
    8--10 (-) axis id: 2
> Mapping vertex 9 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    8--10 (-) axis id: 1
    7--9 (-) axis id: 2
    9--11 (-) axis id: 3
> Mapping vertex 11 (â—): Boundary Node
  - Current frontiers: 
    8--10 (-) axis id: 1
    7--9 (-) axis id: 2
    9--11 (-) axis id: 3
> Mapping vertex 7 (â—): Boundary Node
  - Current frontiers: 
    8--10 (-) axis id: 1
    7--9 (-) axis id: 2
    9--11 (-) axis id: 3
> Mapping vertex 0 (â—): New Subgraph
  - Current frontiers: 
    0--2 (-) axis id: 1
> Mapping vertex 2 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    2--3 (-) axis id: 1
    2--4 (-) axis id: 2
> Mapping vertex 4 (â—): Boundary Node
  - Current frontiers: 
    2--3 (-) axis id: 1
    2--4 (-) axis id: 2
> Mapping vertex 3 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    2--4 (-) axis id: 1
    1--3 (-) axis id: 2
    3--5 (-) axis id: 3
> Mapping vertex 5 (â—): Boundary Node
  - Current frontiers: 
    2--4 (-) axis id: 1
    1--3 (-) axis id: 2
    3--5 (-) axis id: 3
> Mapping vertex 1 (â—): Boundary Node
  - Current frontiers: 
    2--4 (-) axis id: 1
    1--3 (-) axis id: 2
    3--5 (-) axis id: 3
Successfully added Tensor 0
Input  axis ids: 4 6 0 2
Output axis ids: 5 7 1 3
Stored the resulting tensor as tensor id 0

qsyn> q -f

