qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generate Graph 0
Checkout to Graph 0

qsyn> zxgedit -addi 0 0
Add input 0

qsyn> zxgedit -addo 1 0
Add output 1

qsyn> zxgedit -addi 2 1
Add input 2

qsyn> zxgedit -addo 3 1
Add output 3

qsyn> zxgedit -addi 4 2
Add input 4

qsyn> zxgedit -addo 5 2
Add output 5

qsyn> zxgedit -addi 6 3
Add input 6

qsyn> zxgedit -addo 7 3
Add output 7

qsyn> zxgedit -addi 8 4
Add input 8

qsyn> zxgedit -addo 9 4
Add output 9

qsyn> 
qsyn> zxgedit -addv 10 0 Z 0
Add vertice 10

qsyn> zxgedit -addv 11 0 Z 0
Add vertice 11

qsyn> zxgedit -addv 12 0 Z 0
Add vertice 12

qsyn> zxgedit -addv 13 0 Z 0
Add vertice 13

qsyn> 
qsyn> zxgedit -adde 0 1 SIMPLE
Add edge ( 0, 1 )

qsyn> zxgedit -adde 2 10 SIMPLE
Add edge ( 2, 10 )

qsyn> zxgedit -adde 3 11 SIMPLE
Add edge ( 3, 11 )

qsyn> zxgedit -adde 4 12 SIMPLE
Add edge ( 4, 12 )

qsyn> zxgedit -adde 5 12 SIMPLE
Add edge ( 5, 12 )

qsyn> zxgedit -adde 6 12 SIMPLE
Add edge ( 6, 12 )

qsyn> zxgedit -adde 7 13 SIMPLE
Add edge ( 7, 13 )

qsyn> zxgedit -adde 8 13 SIMPLE
Add edge ( 8, 13 )

qsyn> zxgedit -adde 9 13 SIMPLE
Add edge ( 9, 13 )

qsyn> 
qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(0, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(10, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	4	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(12, -) 
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(12, -) 
ID:	6	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(12, -) 
ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(13, -) 
ID:	8	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(13, -) 
ID:	9	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(13, -) 
ID:	10	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	11	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	12	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(4, -) (5, -) (6, -) 
ID:	13	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(7, -) (8, -) (9, -) 
Total #Vertices: 14

qsyn> zxgp -e
( 0, 1 )	Type:	-
( 2, 10 )	Type:	-
( 3, 11 )	Type:	-
( 4, 12 )	Type:	-
( 5, 12 )	Type:	-
( 6, 12 )	Type:	-
( 7, 13 )	Type:	-
( 8, 13 )	Type:	-
( 9, 13 )	Type:	-
Total #Edges: 9

qsyn> 
qsyn> ver 7
Note: verbose level is set to 7

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Topological order from first input: 
3 11 8 13 7 9 4 12 5 6 2 10 0 1 
Size of topological order: 14
> Mapping vertex 3 (●): New Subgraph
  - Current frontiers: 
    3--11 (-) pin id: 1
> Mapping vertex 11 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
> Mapping vertex 8 (●): New Subgraph
  - Current frontiers: 
    8--13 (-) pin id: 1
> Mapping vertex 13 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    7--13 (-) pin id: 2
    9--13 (-) pin id: 1
> Mapping vertex 7 (●): Boundary Node
  - Current frontiers: 
    7--13 (-) pin id: 2
    9--13 (-) pin id: 1
> Mapping vertex 9 (●): Boundary Node
  - Current frontiers: 
    7--13 (-) pin id: 2
    9--13 (-) pin id: 1
> Mapping vertex 4 (●): New Subgraph
  - Current frontiers: 
    4--12 (-) pin id: 1
> Mapping vertex 12 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    5--12 (-) pin id: 2
    6--12 (-) pin id: 1
> Mapping vertex 5 (●): Boundary Node
  - Current frontiers: 
    5--12 (-) pin id: 2
    6--12 (-) pin id: 1
> Mapping vertex 6 (●): Boundary Node
  - Current frontiers: 
    5--12 (-) pin id: 2
    6--12 (-) pin id: 1
> Mapping vertex 2 (●): New Subgraph
  - Current frontiers: 
    2--10 (-) pin id: 1
> Mapping vertex 10 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
> Mapping vertex 0 (●): New Subgraph
  - Current frontiers: 
    0--1 (-) pin id: 1
> Mapping vertex 1 (●): Boundary Node
  - Current frontiers: 
    0--1 (-) pin id: 1
8 7 4 5 1
9 0 6 3 2

The resulting tensor is: 
{{ 1.      +0.i,  0.      +0.i,  0.      +0.i, ...,  0.      +0.i,  0.      +0.i, 
   0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i, ...,  0.      +0.i,  0.      +0.i, 
   0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i, ...,  0.      +0.i,  0.      +0.i, 
   0.      +0.i},
 ..., 
 { 0.      +0.i,  0.      +0.i,  0.      +0.i, ...,  0.      +0.i,  0.      +0.i, 
   0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i, ...,  0.      +0.i,  0.      +0.i, 
   0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i, ...,  0.      +0.i,  0.      +0.i, 
   1.      +0.i}}

qsyn> 
qsyn> q -f

