qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generate Graph 0
Checkout to Graph 0

qsyn> zxgedit -addi 0 0
Add input 0

qsyn> zxgedit -addo 1 0
Add output 1

qsyn> zxgedit -addv 2 0 Z
Add vertice 2

qsyn> zxgedit -adde 0 2 SIMPLE
Add edge ( 0, 2 )

qsyn> zxgedit -adde 2 1 HADAMARD
Add edge ( 2, 1 )

qsyn> ver 7
Note: verbose level is set to 7

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Topological order from first input: 
0 2 1 
Size of topological order: 3
> Mapping vertex 0 (â—): New Subgraph
  - Current frontiers: 
    0--2 (-) axis id: 1
> Mapping vertex 2 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    1--2 ([1;34mH[0m) axis id: 1
> Mapping vertex 1 (â—): Boundary Node
  - Current frontiers: 
    1--2 ([1;34mH[0m) axis id: 1

The resulting tensor is: 
{{ 0.707107+0.i,  0.707107+0.i},
 { 0.707107+0.i, -0.707107+0.i}}

qsyn> ver 3
Note: verbose level is set to 3

qsyn> zxgedit -rme 2 1

qsyn> zxgedit -adde 2 1 SIMPLE
Add edge ( 2, 1 )

qsyn> ver 7
Note: verbose level is set to 7

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Topological order from first input: 
0 2 1 
Size of topological order: 3
> Mapping vertex 0 (â—): New Subgraph
  - Current frontiers: 
    0--2 (-) axis id: 1
> Mapping vertex 2 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    1--2 (-) axis id: 1
> Mapping vertex 1 (â—): Boundary Node
  - Current frontiers: 
    1--2 (-) axis id: 1

The resulting tensor is: 
{{ 1.+0.i,  0.+0.i},
 { 0.+0.i,  1.+0.i}}

qsyn> ver 3
Note: verbose level is set to 3

qsyn> zxgedit -rme 0 2

qsyn> zxgedit -adde 2 0 HADAMARD
Add edge ( 2, 0 )

qsyn> ver 7
Note: verbose level is set to 7

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Topological order from first input: 
0 2 1 
Size of topological order: 3
> Mapping vertex 0 (â—): New Subgraph
  - Current frontiers: 
    0--2 ([1;34mH[0m) axis id: 1
> Mapping vertex 2 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    1--2 (-) axis id: 1
> Mapping vertex 1 (â—): Boundary Node
  - Current frontiers: 
    1--2 (-) axis id: 1

The resulting tensor is: 
{{ 0.707107+0.i,  0.707107+0.i},
 { 0.707107+0.i, -0.707107+0.i}}

qsyn> ver 3
Note: verbose level is set to 3

qsyn> zxgedit -rme 1 2

qsyn> zxgedit -adde 2 1 HADAMARD
Add edge ( 2, 1 )

qsyn> ver 7
Note: verbose level is set to 7

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Topological order from first input: 
0 2 1 
Size of topological order: 3
> Mapping vertex 0 (â—): New Subgraph
  - Current frontiers: 
    0--2 ([1;34mH[0m) axis id: 1
> Mapping vertex 2 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    1--2 ([1;34mH[0m) axis id: 1
> Mapping vertex 1 (â—): Boundary Node
  - Current frontiers: 
    1--2 ([1;34mH[0m) axis id: 1

The resulting tensor is: 
{{ 1.      +0.i,  0.      +0.i},
 { 0.      +0.i,  1.      +0.i}}

qsyn> q -f

