qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgtest
Generate a 2-qubit CNOT graph for testing

qsyn> zxgedit -rme 0 2

qsyn> 
qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	0	
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6

qsyn> zxgp -e
( 3, 5 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
Total #Edges: 4

qsyn> 
qsyn> // should fail because vertex 0 is a boundary with no neighbors...

qsyn> zxgtsm
[Error] The ZX Graph is not valid!!!

qsyn> 
qsyn> q -f

