DV Lab, NTUEE, Qsyn 0.3.0
qsyn> zxn
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgtest

qsyn> 
qsyn> zxgedit -adde 0 5 SIMPLE

qsyn> 
qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (5, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	2	(0, -) (3, -) 
Total #Vertices: 6


qsyn> zxgp -e
( 0, 2 )	Type:	-
( 0, 5 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
( 3, 5 )	Type:	-
Total #Edges: 6

qsyn> 
qsyn> // should fail because vertex 0 is a boundary with more than 1 neighbors...

qsyn> zx2ts
Error: The ZX-Graph is not valid!!

qsyn> 
qsyn> qq -f

