qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generate Graph 0
Checkout to Graph 0

qsyn> zxgtest
Generate a 2-qubit CNOT graph for testing
Add input 0
Add input 1
Add vertice 2
Add vertice 3
Add output 4
Add output 5
Add edge ( 3, 5 )
Add edge ( 0, 2 )
Add edge ( 1, 3 )
Add edge ( 2, 3 )
Add edge ( 2, 4 )

qsyn> 
qsyn> zxgedit -adde 0 5 SIMPLE
Add edge ( 0, 5 )

qsyn> 
qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (5, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1;31mX[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	2	(0, -) (3, -) 
Total #Vertices: 6

qsyn> zxgp -e
( 3, 5 )	Type:	-
( 0, 2 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
( 0, 5 )	Type:	-
Total #Edges: 6

qsyn> 
qsyn> // should fail because vertex 0 is a boundary with more than 1 neighbors...

qsyn> zxgtsm
[Error] The ZX Graph is not valid!!!

qsyn> 
qsyn> q -f

