DV Lab, NTUEE, Qsyn 0.4.2
qsyn> zxn
Create and checkout to Graph 0

qsyn> zxgtest

qsyn> 
qsyn> zxgedit -adde 0 5 SIMPLE

qsyn> 
qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (2, -) (5, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   2     (0, -) (3, -) 
Total #Vertices: 6


qsyn> zxgp -e
( 0, 2 )	Type:	-
( 0, 5 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
( 3, 5 )	Type:	-
Total #Edges: 6

qsyn> 
qsyn> // should fail because vertex 0 is a boundary with more than 1 neighbors...
qsyn> zx2ts
Error: The ZX-graph is not valid!!

qsyn> 
qsyn> zxn
Create and checkout to Graph 1

qsyn> zxgtest

qsyn> zxgedit -rme 0 2 -ALL

qsyn> 
qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   0     
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   2     (3, -) (4, -) 
ID:   3 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxgp -e
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
( 3, 5 )	Type:	-
Total #Edges: 4

qsyn> 
qsyn> // should fail because vertex 0 is a boundary with no neighbors...
qsyn> zx2ts
Error: The ZX-graph is not valid!!

qsyn> 
qsyn> qq -f

