qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generate Graph 0
Checkout to Graph 0

qsyn> zxgtest
Generate a 2-qubit CNOT graph for testing
Add input 0
Add input 1
Add vertice 2
Add vertice 3
Add output 4
Add output 5
Add edge ( 3, 5 )
Add edge ( 0, 2 )
Add edge ( 1, 3 )
Add edge ( 2, 3 )
Add edge ( 2, 4 )

qsyn> 
qsyn> zxgedit -rme 0 2

qsyn> 
qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	0	
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(3, -) (4, -) 
ID:	3	VertexType:	[1;31mX[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6

qsyn> zxgp -e
( 3, 5 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
Total #Edges: 4

qsyn> 
qsyn> zxgtsm
[Error] The ZX Graph is not valid!!!

qsyn> 
qsyn> q -f

