DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 8
Note: verbose level is set to 8

qsyn> qccr benchmark/qc2ts/circuit/control_z.qasm

qsyn> qctsm
----------- ADD BOUNDARIES -----------
Successfully added Tensor 0
Add Qubit 0 output port: 1
Add Qubit 1 output port: 3
---- TRAVERSE AND BUILD THE TENSOR ----
Gate 1 (rz)
************ Pin Permutation ************
Qubit: 1 input : 2 -> 2 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 1 -> 1
*****************************************
--------------------------------------------
Gate 2 (sx)
************ Pin Permutation ************
Qubit: 1 input : 2 -> 2 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 1 -> 1
*****************************************
--------------------------------------------
Gate 3 (rz)
************ Pin Permutation ************
Qubit: 1 input : 2 -> 2 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 1 -> 1
*****************************************
--------------------------------------------
Gate 0 (x)
************ Pin Permutation ************
Qubit: 1 input : 2 -> 1 |  output: 3 -> 2
Qubit: 0 input : 0 -> 0 |  output: 1 -> 3
*****************************************
--------------------------------------------
Gate 4 (cx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 2 -> 3
Qubit: 0 input : 0 -> 0 |  output: 3 -> 2
*****************************************
--------------------------------------------
Gate 6 (rz)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 2 -> 2
*****************************************
--------------------------------------------
Gate 7 (sx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 2 -> 2
*****************************************
--------------------------------------------
Gate 8 (rz)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 2 -> 2
*****************************************
--------------------------------------------
Gate 5 (x)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 2
Qubit: 0 input : 0 -> 0 |  output: 2 -> 3
*****************************************
--------------------------------------------
---------------------------------------
Stored the resulting tensor as tensor id 0

qsyn> qccr benchmark/qc2ts/circuit/control_h.qasm -R
Note: original quantum circuit is replaced...

qsyn> qctsm
----------- ADD BOUNDARIES -----------
Successfully added Tensor 1
Add Qubit 0 output port: 1
Add Qubit 1 output port: 3
---- TRAVERSE AND BUILD THE TENSOR ----
Gate 3 (rz)
************ Pin Permutation ************
Qubit: 1 input : 2 -> 2 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 1 -> 1
*****************************************
--------------------------------------------
Gate 4 (sx)
************ Pin Permutation ************
Qubit: 1 input : 2 -> 2 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 1 -> 1
*****************************************
--------------------------------------------
Gate 5 (rz)
************ Pin Permutation ************
Qubit: 1 input : 2 -> 2 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 1 -> 1
*****************************************
--------------------------------------------
Gate 0 (sx)
************ Pin Permutation ************
Qubit: 1 input : 2 -> 1 |  output: 3 -> 2
Qubit: 0 input : 0 -> 0 |  output: 1 -> 3
*****************************************
--------------------------------------------
Gate 1 (rz)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 2 -> 2
Qubit: 0 input : 0 -> 0 |  output: 3 -> 3
*****************************************
--------------------------------------------
Gate 2 (sx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 2 -> 2
Qubit: 0 input : 0 -> 0 |  output: 3 -> 3
*****************************************
--------------------------------------------
Gate 6 (cx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 2 -> 3
Qubit: 0 input : 0 -> 0 |  output: 3 -> 2
*****************************************
--------------------------------------------
Gate 10 (rz)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 2 -> 2
*****************************************
--------------------------------------------
Gate 11 (sx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 2 -> 2
*****************************************
--------------------------------------------
Gate 12 (rz)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 2 -> 2
*****************************************
--------------------------------------------
Gate 7 (sx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 2
Qubit: 0 input : 0 -> 0 |  output: 2 -> 3
*****************************************
--------------------------------------------
Gate 8 (rz)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 2 -> 2
Qubit: 0 input : 0 -> 0 |  output: 3 -> 3
*****************************************
--------------------------------------------
Gate 9 (sx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 2 -> 2
Qubit: 0 input : 0 -> 0 |  output: 3 -> 3
*****************************************
--------------------------------------------
---------------------------------------
Stored the resulting tensor as tensor id 1

qsyn> qccr benchmark/qc2ts/circuit/toffoli_dec.qasm -R
Note: original quantum circuit is replaced...

qsyn> qctsm
----------- ADD BOUNDARIES -----------
Successfully added Tensor 2
Add Qubit 0 output port: 1
Add Qubit 1 output port: 3
Add Qubit 2 output port: 5
---- TRAVERSE AND BUILD THE TENSOR ----
Gate 0 (h)
************ Pin Permutation ************
Qubit: 2 input : 4 -> 4 |  output: 5 -> 5
Qubit: 1 input : 2 -> 2 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 1 -> 1
*****************************************
--------------------------------------------
Gate 1 (cx)
************ Pin Permutation ************
Qubit: 2 input : 4 -> 3 |  output: 5 -> 5
Qubit: 1 input : 2 -> 2 |  output: 3 -> 4
Qubit: 0 input : 0 -> 0 |  output: 1 -> 1
*****************************************
--------------------------------------------
Gate 2 (td)
************ Pin Permutation ************
Qubit: 2 input : 3 -> 3 |  output: 5 -> 5
Qubit: 1 input : 2 -> 2 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 1 -> 1
*****************************************
--------------------------------------------
Gate 3 (cx)
************ Pin Permutation ************
Qubit: 2 input : 3 -> 2 |  output: 5 -> 5
Qubit: 1 input : 2 -> 1 |  output: 4 -> 3
Qubit: 0 input : 0 -> 0 |  output: 1 -> 4
*****************************************
--------------------------------------------
Gate 4 (t)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 5 -> 5
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 4 -> 4
*****************************************
--------------------------------------------
Gate 5 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 5 -> 5
Qubit: 1 input : 1 -> 1 |  output: 3 -> 4
Qubit: 0 input : 0 -> 0 |  output: 4 -> 3
*****************************************
--------------------------------------------
Gate 7 (td)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 5 -> 5
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 3 -> 3
*****************************************
--------------------------------------------
Gate 6 (t)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 5 -> 4
Qubit: 1 input : 1 -> 1 |  output: 4 -> 5
Qubit: 0 input : 0 -> 0 |  output: 3 -> 3
*****************************************
--------------------------------------------
Gate 8 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 5
Qubit: 1 input : 1 -> 1 |  output: 5 -> 3
Qubit: 0 input : 0 -> 0 |  output: 3 -> 4
*****************************************
--------------------------------------------
Gate 13 (t)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 5 -> 5
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 4 -> 4
*****************************************
--------------------------------------------
Gate 14 (h)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 5 -> 5
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 4 -> 4
*****************************************
--------------------------------------------
Gate 9 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 5 -> 3
Qubit: 1 input : 1 -> 1 |  output: 3 -> 5
Qubit: 0 input : 0 -> 0 |  output: 4 -> 4
*****************************************
--------------------------------------------
Gate 11 (td)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 5 -> 5
Qubit: 0 input : 0 -> 0 |  output: 4 -> 4
*****************************************
--------------------------------------------
Gate 10 (t)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 5 -> 4
Qubit: 0 input : 0 -> 0 |  output: 4 -> 5
*****************************************
--------------------------------------------
Gate 12 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 5
Qubit: 0 input : 0 -> 0 |  output: 5 -> 4
*****************************************
--------------------------------------------
---------------------------------------
Stored the resulting tensor as tensor id 2

qsyn> qccr benchmark/qc2ts/circuit/toffoli_qiskit.qasm -R
Note: original quantum circuit is replaced...

qsyn> qctsm
----------- ADD BOUNDARIES -----------
Successfully added Tensor 3
Add Qubit 0 output port: 1
Add Qubit 1 output port: 3
Add Qubit 2 output port: 5
---- TRAVERSE AND BUILD THE TENSOR ----
Gate 0 (rz)
************ Pin Permutation ************
Qubit: 2 input : 4 -> 3 |  output: 5 -> 4
Qubit: 1 input : 2 -> 1 |  output: 3 -> 2
Qubit: 0 input : 0 -> 0 |  output: 1 -> 5
*****************************************
--------------------------------------------
Gate 1 (cx)
************ Pin Permutation ************
Qubit: 2 input : 3 -> 2 |  output: 4 -> 3
Qubit: 1 input : 1 -> 1 |  output: 2 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 2 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 3 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 4
Qubit: 1 input : 1 -> 1 |  output: 4 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 4 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 5 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 3
Qubit: 1 input : 1 -> 1 |  output: 3 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 6 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 8 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 4
Qubit: 1 input : 1 -> 1 |  output: 4 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 9 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 10 (sx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 11 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 12 (sx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 7 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 3
Qubit: 1 input : 1 -> 1 |  output: 3 -> 5
Qubit: 0 input : 0 -> 0 |  output: 5 -> 4
*****************************************
--------------------------------------------
Gate 13 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 4
Qubit: 1 input : 1 -> 1 |  output: 5 -> 5
Qubit: 0 input : 0 -> 0 |  output: 4 -> 3
*****************************************
--------------------------------------------
Gate 14 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 5 -> 5
Qubit: 0 input : 0 -> 0 |  output: 3 -> 3
*****************************************
--------------------------------------------
Gate 15 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 5 -> 5
Qubit: 0 input : 0 -> 0 |  output: 3 -> 3
*****************************************
--------------------------------------------
Gate 16 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 3
Qubit: 1 input : 1 -> 1 |  output: 5 -> 4
Qubit: 0 input : 0 -> 0 |  output: 3 -> 5
*****************************************
--------------------------------------------
Gate 17 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 18 (sx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 19 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 20 (sx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 21 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 22 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 5
Qubit: 1 input : 1 -> 1 |  output: 4 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 4
*****************************************
--------------------------------------------
Gate 23 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 5 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 4 -> 5
*****************************************
--------------------------------------------
Gate 24 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 25 (sx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 26 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 27 (sx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 28 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 4
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 29 (cx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 4 -> 3
Qubit: 1 input : 1 -> 1 |  output: 3 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 30 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 31 (sx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 32 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 33 (sx)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
Gate 34 (rz)
************ Pin Permutation ************
Qubit: 2 input : 2 -> 2 |  output: 3 -> 3
Qubit: 1 input : 1 -> 1 |  output: 4 -> 4
Qubit: 0 input : 0 -> 0 |  output: 5 -> 5
*****************************************
--------------------------------------------
---------------------------------------
Stored the resulting tensor as tensor id 3

qsyn> q -f

