qsyn> ver 8
Note: verbose level is set to 8

qsyn> qcba 2

qsyn> qcga -cx 0 1

qsyn> qcga -cx 0 1

qsyn> qccp -q
Q 0  -cx( 0)--cx( 1)-
Q 1  -cx( 0)--cx( 1)-

qsyn> qctsm
----------- ADD BOUNDARIES -----------
Successfully added Tensor 0
Add Qubit 0 output port: 1
Add Qubit 1 output port: 3
---- TRAVERSE AND BUILD THE TENSOR ----
Gate 0 (cx)
************ Pin Permutation ************
Qubit: 1 input : 2 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 1 -> 2
*****************************************
--------------------------------------------
Gate 1 (cx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 2 -> 2
*****************************************
--------------------------------------------
Stored the resulting tensor as tensor id 0

The resulting tensor is: 
{{ 1.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  1.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  1.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  1.      +0.i}}

qsyn> qcga -cx 0 1

qsyn> qcga -cx 1 0

qsyn> qcga -cx 0 1

qsyn> qccp -q
Q 0  -cx( 0)--cx( 1)--cx( 2)--cx( 3)--cx( 4)-
Q 1  -cx( 0)--cx( 1)--cx( 2)--cx( 3)--cx( 4)-

qsyn> qctsm
----------- ADD BOUNDARIES -----------
Successfully added Tensor 1
Add Qubit 0 output port: 1
Add Qubit 1 output port: 3
---- TRAVERSE AND BUILD THE TENSOR ----
Gate 0 (cx)
************ Pin Permutation ************
Qubit: 1 input : 2 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 1 -> 2
*****************************************
--------------------------------------------
Gate 1 (cx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 2 -> 2
*****************************************
--------------------------------------------
Gate 2 (cx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 3
Qubit: 0 input : 0 -> 0 |  output: 2 -> 2
*****************************************
--------------------------------------------
Gate 3 (cx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 3 -> 2
Qubit: 0 input : 0 -> 0 |  output: 2 -> 3
*****************************************
--------------------------------------------
Gate 4 (cx)
************ Pin Permutation ************
Qubit: 1 input : 1 -> 1 |  output: 2 -> 3
Qubit: 0 input : 0 -> 0 |  output: 3 -> 2
*****************************************
--------------------------------------------
Stored the resulting tensor as tensor id 1

The resulting tensor is: 
{{ 1.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  1.      +0.i,  0.      +0.i},
 { 0.      +0.i,  1.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  1.      +0.i}}

qsyn> q -f

