DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/9symml_195.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 19649
└── CX: 15232
T-family: 15232
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 40.02 seconds
Total time used  : 40.02 seconds
Total memory used: 969.2 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 7.74 seconds
Total time used  : 47.76 seconds
Total memory used: 969.2 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 28711
└── CX: 16927
T-family: 6450
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 153.8 seconds
Total time used  : 201.5 seconds
Total memory used: 969.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

