DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm85a_209.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 6430
└── CX: 4986
T-family: 4984
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 7.73 seconds
Total time used  : 7.73 seconds
Total memory used: 201.4 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 3 seconds
Total time used  : 10.73 seconds
Total memory used: 201.4 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 15133
└── CX: 11481
T-family: 1950
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 12.78 seconds
Total time used  : 23.51 seconds
Total memory used: 201.4 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

