DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dist_223.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 21428
└── CX: 16624
T-family: 16618
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 61.95 seconds
Total time used  : 61.95 seconds
Total memory used: 1102 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 8.62 seconds
Total time used  : 70.57 seconds
Total memory used: 1102 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 33180
└── CX: 19993
T-family: 6868
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 107.6 seconds
Total time used  : 178.2 seconds
Total memory used: 1102 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

