DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/hwb8_113.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 39042
└── CX: 30372
T-family: 30338
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 30.71 seconds
Total time used  : 30.71 seconds
Total memory used: 709.2 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 13.26 seconds
Total time used  : 43.97 seconds
Total memory used: 709.2 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 57538
└── CX: 28504
T-family: 14934
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 390.2 seconds
Total time used  : 434.2 seconds
Total memory used: 709.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

