DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/inc_237.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 5985
└── CX: 4636
T-family: 4634
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 7.18 seconds
Total time used  : 7.18 seconds
Total memory used: 278.1 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.58 seconds
Total time used  : 9.76 seconds
Total memory used: 278.1 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 8315
└── CX: 4715
T-family: 1942
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.75 seconds
Total time used  : 18.51 seconds
Total memory used: 278.1 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

