DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/life_238.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 12645
└── CX: 9800
T-family: 9800
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 15.3 seconds
Total time used  : 15.3 seconds
Total memory used: 374.4 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 4.98 seconds
Total time used  : 20.28 seconds
Total memory used: 374.4 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 18207
└── CX: 10596
T-family: 4152
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 56.91 seconds
Total time used  : 77.19 seconds
Total memory used: 374.4 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

