DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/pm1_249.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 1006
└── CX: 771
T-family: 770
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.23 seconds
Total time used  : 0.23 seconds
Total memory used: 17.05 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.33 seconds
Total time used  : 0.56 seconds
Total memory used: 17.05 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 1484
└── CX: 725
T-family: 370
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.24 seconds
Total time used  : 0.8 seconds
Total memory used: 17.05 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

