DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd53_251.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 731
└── CX: 564
T-family: 560
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.04 seconds
Total time used  : 0.04 seconds
Total memory used: 3.203 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.19 seconds
Total time used  : 0.23 seconds
Total memory used: 3.203 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 1095
└── CX: 485
T-family: 280
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.14 seconds
Total time used  : 0.37 seconds
Total memory used: 4.578 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

