DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd84_253.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 7701
└── CX: 5960
T-family: 5957
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.6 seconds
Total time used  : 8.6 seconds
Total memory used: 276.3 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.89 seconds
Total time used  : 11.49 seconds
Total memory used: 276.3 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 13339
└── CX: 8242
T-family: 2625
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 23.67 seconds
Total time used  : 35.16 seconds
Total memory used: 278 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

