DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/root_255.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 9669
└── CX: 7493
T-family: 7490
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 16.87 seconds
Total time used  : 16.87 seconds
Total memory used: 537 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 3.67 seconds
Total time used  : 20.54 seconds
Total memory used: 537 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 16993
└── CX: 10947
T-family: 3114
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 23.97 seconds
Total time used  : 44.51 seconds
Total memory used: 537 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

