DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/square_root_7.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 4711
└── CX: 3089
T-family: 2919
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.25 seconds
Total time used  : 0.25 seconds
Total memory used: 17.1 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.85 seconds
Total time used  : 1.1 seconds
Total memory used: 17.1 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 6305
└── CX: 3697
T-family: 1109
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.85 seconds
Total time used  : 2.95 seconds
Total memory used: 19.02 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

