DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_149.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 103986
└── CX: 80878
T-family: 80878
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 30.35 seconds
Total time used  : 30.35 seconds
Total memory used: 855.6 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 32.23 seconds
Total time used  : 62.58 seconds
Total memory used: 855.6 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 199921
└── CX: 100493
T-family: 40380
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2634 seconds
Total time used  : 2696 seconds
Total memory used: 860.6 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

