DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> verbose 0
Note: verbose level is set to 0

qsyn> qccr benchmark/benchmark_SABRE/large/z4_268.qasm

qsyn> qc2zx

qsyn> zxgsimp -fr

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.07 seconds
Total time used  : 0.07 seconds
Total memory used: 9.176 M Bytes

qsyn> optimize -statistics
  ParseForward number 0 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 0
    X gate canceled: 0
    H-S exchange   : 274
    Cnot canceled  : 8
    CZ canceled    : 8
    Crz transform  : 0
    Do swap        : 41

  Note: 130CZs had be transformed into CXs.
  Note: 91CXs be transformed into CZs.

  ParseForward number 1 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 141
    X gate canceled: 4
    H-S exchange   : 169
    Cnot canceled  : 7
    CZ canceled    : 109
    Crz transform  : 0
    Do swap        : 37

  Note: 54CZs had be transformed into CXs.
  Note: 326CXs be transformed into CZs.

  ParseForward number 2 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 80
    X gate canceled: 7
    H-S exchange   : 25
    Cnot canceled  : 6
    CZ canceled    : 2
    Crz transform  : 0
    Do swap        : 43

  Note: 359CZs had be transformed into CXs.
  Note: 30CXs be transformed into CZs.

  ParseForward number 3 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 90
    X gate canceled: 1
    H-S exchange   : 0
    Cnot canceled  : 5
    CZ canceled    : 86
    Crz transform  : 58
    Do swap        : 23

  Note: 7CZs had be transformed into CXs.
  Note: 287CXs be transformed into CZs.

  ParseForward number 4 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 174
    X gate canceled: 6
    H-S exchange   : 0
    Cnot canceled  : 7
    CZ canceled    : 1
    Crz transform  : 3
    Do swap        : 45

  Note: 266CZs had be transformed into CXs.
  Note: 3CXs be transformed into CZs.

  ParseForward number 5 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 75
    X gate canceled: 1
    H-S exchange   : 0
    Cnot canceled  : 5
    CZ canceled    : 96
    Crz transform  : 0
    Do swap        : 17

  Note: 3CZs had be transformed into CXs.
  Note: 259CXs be transformed into CZs.

  ParseForward number 6 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 40
    X gate canceled: 4
    H-S exchange   : 0
    Cnot canceled  : 4
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 41

  Note: 267CZs had be transformed into CXs.
  Note: 4CXs be transformed into CZs.

  ParseForward number 7 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 62
    X gate canceled: 1
    H-S exchange   : 0
    Cnot canceled  : 6
    CZ canceled    : 98
    Crz transform  : 0
    Do swap        : 18

  Note: 4CZs had be transformed into CXs.
  Note: 266CXs be transformed into CZs.

  ParseForward number 8 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 40
    X gate canceled: 4
    H-S exchange   : 0
    Cnot canceled  : 6
    CZ canceled    : 1
    Crz transform  : 0
    Do swap        : 43

  Note: 266CZs had be transformed into CXs.
  Note: 3CXs be transformed into CZs.

  ParseForward number 9 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 60
    X gate canceled: 1
    H-S exchange   : 0
    Cnot canceled  : 5
    CZ canceled    : 101
    Crz transform  : 0
    Do swap        : 17

  Note: 3CZs had be transformed into CXs.
  Note: 267CXs be transformed into CZs.

  ParseForward number 10 done.
  Operated rules number in this forward is: 
    Fuse the Zphase: 40
    X gate canceled: 4
    H-S exchange   : 0
    Cnot canceled  : 5
    CZ canceled    : 1
    Crz transform  : 0
    Do swap        : 41

  Note: 267CZs had be transformed into CXs.
  Note: 3CXs be transformed into CZs.


qsyn> usage
Period time used : 0.04 seconds
Total time used  : 0.11 seconds
Total memory used: 14.82 M Bytes

qsyn> qccp
QCir 1( 16 qubits, 2025 gates)
Clifford    : 1492
└── 2-qubit : 1151
T-family    : 631
Others      : 0
Depth       : 2726

qsyn> qq -f

