DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/9symml_195.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 19649
└── CX: 15232
T-family: 15232
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 40.68 seconds
Total time used  : 40.68 seconds
Total memory used: 968.3 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 7.62 seconds
Total time used  : 48.3 seconds
Total memory used: 968.3 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 28937
└── CX: 17153
T-family: 6450
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 166.4 seconds
Total time used  : 214.8 seconds
Total memory used: 968.3 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

