DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm82a_208.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 370
└── CX: 283
T-family: 280
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.02 seconds
Total time used  : 0.02 seconds
Total memory used: 1.68 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.09 seconds
Total time used  : 0.11 seconds
Total memory used: 2.16 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 694
└── CX: 368
T-family: 122
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.06 seconds
Total time used  : 0.17 seconds
Total memory used: 3.219 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

