DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cycle10_2_110.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 3404
└── CX: 2648
T-family: 2646
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 3.18 seconds
Total time used  : 3.18 seconds
Total memory used: 96.21 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.25 seconds
Total time used  : 4.43 seconds
Total memory used: 96.21 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 5063
└── CX: 2725
T-family: 1160
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.36 seconds
Total time used  : 6.79 seconds
Total memory used: 96.21 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

