DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/ham15_107.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 4948
└── CX: 3858
T-family: 3815
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.01 seconds
Total time used  : 1.01 seconds
Total memory used: 48.33 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.09 seconds
Total time used  : 3.1 seconds
Total memory used: 48.33 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 8206
└── CX: 4594
T-family: 1805
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 6.58 seconds
Total time used  : 9.68 seconds
Total memory used: 48.99 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

