DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd84_253.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 7701
└── CX: 5960
T-family: 5957
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.71 seconds
Total time used  : 8.71 seconds
Total memory used: 276.5 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.97 seconds
Total time used  : 11.68 seconds
Total memory used: 276.5 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 13751
└── CX: 8654
T-family: 2625
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 34.76 seconds
Total time used  : 46.44 seconds
Total memory used: 383 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

