DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqrt8_260.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 1700
└── CX: 1314
T-family: 1309
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.48 seconds
Total time used  : 0.48 seconds
Total memory used: 32.48 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.6 seconds
Total time used  : 1.08 seconds
Total memory used: 32.48 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 3281
└── CX: 1966
T-family: 581
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.69 seconds
Total time used  : 1.77 seconds
Total memory used: 32.48 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

