DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/square_root_7.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 4711
└── CX: 3089
T-family: 2919
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.29 seconds
Total time used  : 0.29 seconds
Total memory used: 17.16 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.91 seconds
Total time used  : 1.2 seconds
Total memory used: 17.16 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 6451
└── CX: 3843
T-family: 1109
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.8 seconds
Total time used  : 3 seconds
Total memory used: 19.4 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

