DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_278.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 33234
└── CX: 26692
T-family: 21532
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 10.35 seconds
Total time used  : 10.35 seconds
Total memory used: 379.1 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 9.49 seconds
Total time used  : 19.84 seconds
Total memory used: 379.1 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 71404
└── CX: 41897
T-family: 12772
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 300.6 seconds
Total time used  : 320.5 seconds
Total memory used: 379.5 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

