DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm85a_209.qasm

qsyn> qccp -a
Clifford: 6430
└── CX: 4986
T-family: 4984
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 7.7 seconds
Total time used  : 7.7 seconds
Total memory used: 203.5 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 5.12 seconds
Total time used  : 12.82 seconds
Total memory used: 203.5 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 9029
└── CX: 5377
T-family: 1950
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 13.21 seconds
Total time used  : 26.03 seconds
Total memory used: 203.5 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

