DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/hwb8_113.qasm

qsyn> qccp -a
Clifford: 39042
└── CX: 30372
T-family: 30338
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 30.87 seconds
Total time used  : 30.87 seconds
Total memory used: 707.1 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 14.52 seconds
Total time used  : 45.39 seconds
Total memory used: 707.1 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 56569
└── CX: 27535
T-family: 14934
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 410.4 seconds
Total time used  : 455.8 seconds
Total memory used: 707.1 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

