DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/life_238.qasm

qsyn> qccp -a
Clifford: 12645
└── CX: 9800
T-family: 9800
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 15.43 seconds
Total time used  : 15.43 seconds
Total memory used: 372.9 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 6.26 seconds
Total time used  : 21.69 seconds
Total memory used: 372.9 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 17035
└── CX: 9424
T-family: 4152
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 55.57 seconds
Total time used  : 77.26 seconds
Total memory used: 372.9 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

