DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/mlp4_245.qasm

qsyn> qccp -a
Clifford: 10620
└── CX: 8232
T-family: 8232
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 33.61 seconds
Total time used  : 33.61 seconds
Total memory used: 835.5 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 10.34 seconds
Total time used  : 43.95 seconds
Total memory used: 835.5 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 14825
└── CX: 8712
T-family: 3324
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 34.37 seconds
Total time used  : 78.32 seconds
Total memory used: 835.5 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

