DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd84_253.qasm

qsyn> qccp -a
Clifford: 7701
└── CX: 5960
T-family: 5957
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.73 seconds
Total time used  : 8.73 seconds
Total memory used: 275.4 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 3.8 seconds
Total time used  : 12.53 seconds
Total memory used: 275.4 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 11547
└── CX: 6450
T-family: 2625
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 49.55 seconds
Total time used  : 62.08 seconds
Total memory used: 400.3 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

