DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/root_255.qasm

qsyn> qccp -a
Clifford: 9669
└── CX: 7493
T-family: 7490
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 17.2 seconds
Total time used  : 17.2 seconds
Total memory used: 536.7 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 5.05 seconds
Total time used  : 22.25 seconds
Total memory used: 536.7 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 13996
└── CX: 7950
T-family: 3114
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 25.52 seconds
Total time used  : 47.77 seconds
Total memory used: 536.7 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

