DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqrt8_260.qasm

qsyn> qccp -a
Clifford: 1700
└── CX: 1314
T-family: 1309
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.67 seconds
Total time used  : 0.67 seconds
Total memory used: 32.42 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.82 seconds
Total time used  : 1.49 seconds
Total memory used: 32.42 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 2721
└── CX: 1406
T-family: 581
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.66 seconds
Total time used  : 2.15 seconds
Total memory used: 32.42 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

