DV Lab, NTUEE, Qsyn 0.4.2
qsyn> zxn
Create and checkout to Graph 0

qsyn> zxgr benchmark/zx/lcomp_1.zx
Create and checkout to Graph 1

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   2 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (8, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€/2)         (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (6, [1m[34mH[0m[0m) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (1, -) (6, [1m[34mH[0m[0m) 
ID:   6 ([1m[32mZ[0m[0m, Ï€/2)         (Qubit, Col): (0, 0)	  #Neighbors:   4     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (2, -) (6, [1m[34mH[0m[0m) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (3, -) (6, [1m[34mH[0m[0m) 
Total #Vertices: 9


qsyn> zxgp -e
( 0, 4 )	Type:	-
( 1, 5 )	Type:	-
( 2, 7 )	Type:	-
( 3, 8 )	Type:	-
( 4, 6 )	Type:	[1m[34mH[0m[0m
( 5, 6 )	Type:	[1m[34mH[0m[0m
( 6, 7 )	Type:	[1m[34mH[0m[0m
( 6, 8 )	Type:	[1m[34mH[0m[0m
Total #Edges: 8

qsyn> zxgsimp -lcomp

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   2 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (8, -) 
ID:   4 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (0, -) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) 
ID:   5 ([1m[32mZ[0m[0m, 3Ï€/2)        (Qubit, Col): (0, 0)	  #Neighbors:   4     (1, -) (4, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, 3Ï€/2)        (Qubit, Col): (0, 0)	  #Neighbors:   4     (2, -) (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) 
ID:   8 ([1m[32mZ[0m[0m, 3Ï€/2)        (Qubit, Col): (0, 0)	  #Neighbors:   4     (3, -) (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
Total #Vertices: 8


qsyn> zxgp -e
( 0, 4 )	Type:	-
( 1, 5 )	Type:	-
( 2, 7 )	Type:	-
( 3, 8 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 7 )	Type:	[1m[34mH[0m[0m
( 4, 8 )	Type:	[1m[34mH[0m[0m
( 5, 7 )	Type:	[1m[34mH[0m[0m
( 5, 8 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	[1m[34mH[0m[0m
Total #Edges: 10

qsyn> qq -f

