qsyn> logger level debug
[info]     Setting logger level to "debug"

qsyn> zxgread benchmark/zx/tof3.zx
[info]     Successfully created and checked out to ZXGraph 0

qsyn> zxcopy 1
[info]     Successfully copied ZXGraph 0 to ZXGraph 1
[info]     Checked out to ZXGraph 1

qsyn> zxgs -dreduce
[info]     Hadamard Rule                 1 iterations, total    2 matches
[debug]       1) 2 matches
[info]     Full Reduce:
[info]     Spider Fusion Rule            3 iterations, total    6 matches
[debug]       1) 3 matches
[debug]       2) 2 matches
[debug]       3) 1 matches
[info]     Pivot Gadget Rule             2 iterations, total    4 matches
[debug]       1) 3 matches
[debug]       2) 1 matches
[info]     Identity Removal Rule         1 iterations, total    2 matches
[debug]       1) 2 matches
[info]     Dynamic Reduce: (T-optimal: 7)
[info]     Spider Fusion Rule            3 iterations, total    6 matches
[debug]       1) 3 matches
[debug]       2) 2 matches
[debug]       3) 1 matches
[info]     Pivot Gadget Rule             2 iterations, total    4 matches
[debug]       1) 3 matches
[debug]       2) 1 matches

qsyn> zxgp -s
Graph (3 inputs, 3 outputs, 19 vertices, 21 edges)
#T-gate:                      7
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           7

qsyn> zxgadjoint 

qsyn> zxcompose 0

qsyn> zxgs -freduce
[info]     Hadamard Rule                 1 iterations, total    2 matches
[debug]       1) 2 matches
[info]     Spider Fusion Rule            4 iterations, total   14 matches
[debug]       1) 6 matches
[debug]       2) 4 matches
[debug]       3) 2 matches
[debug]       4) 2 matches
[info]     Identity Removal Rule         1 iterations, total    2 matches
[debug]       1) 2 matches
[info]     Pivot Rule                    1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Identity Removal Rule         1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Spider Fusion Rule            1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Pivot Rule                    1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Identity Removal Rule         1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Spider Fusion Rule            1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Pivot Rule                    1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Identity Removal Rule         1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Spider Fusion Rule            1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Pivot Rule                    1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Identity Removal Rule         2 iterations, total    2 matches
[debug]       1) 1 matches
[debug]       2) 1 matches
[info]     Pivot Gadget Rule             1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Identity Removal Rule         1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Spider Fusion Rule            1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Phase Gadget Rule             1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Pivot Rule                    1 iterations, total    1 matches
[debug]       1) 1 matches
[info]     Identity Removal Rule         1 iterations, total    2 matches
[debug]       1) 2 matches

qsyn> zxgtest -id
The graph is an identity!

qsyn> qq -f

