DV Lab, NTUEE, Qsyn 0.5.1
qsyn> verb 3
Note: verbose level is set to 3

qsyn> zxgread benchmark/zx/tof3.zx

qsyn> zxcopy 1

qsyn> zxgs -dreduce

Full Reduce:
All rules applied in order:
Spider Fusion Rule            3 iterations.
  1) 3 matches
  2) 2 matches
  3) 1 matches
Pivot Gadget Rule             2 iterations.
  1) 3 matches
  2) 1 matches
Identity Removal Rule         1 iterations.
  1) 2 matches

Dynamic Reduce: (T-optimal: 7)
All rules applied in order:
Spider Fusion Rule            3 iterations.
  1) 3 matches
  2) 2 matches
  3) 1 matches
Pivot Gadget Rule             2 iterations.
  1) 3 matches
  2) 1 matches
Identity Removal Rule         1 iterations.
  1) 2 matches

qsyn> zxgadjoint 

qsyn> zxcompose 0

qsyn> zxgs -freduce

All rules applied in order:
Hadamard Rule                 1 iterations.
  1) 2 matches
Spider Fusion Rule            4 iterations.
  1) 6 matches
  2) 3 matches
  3) 2 matches
  4) 2 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Identity Removal Rule         2 iterations.
  1) 1 matches
  2) 1 matches
Pivot Gadget Rule             1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Phase Gadget Rule             1 iterations.
  1) 1 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 2 matches

qsyn> zxgt -id
The graph is an identity!

qsyn> qq -f

