DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> QCNew
Create and checkout to QCir 0

qsyn> QCBAdd 3

qsyn> qcga -CX 0 1
Into append
Line 306
Line 308
size: 3
0
1
2
q: 0
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf0870
Line 318
Line 321
Line 306
Line 308
size: 3
0
1
2
q: 1
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf08b0
Line 318
Line 321

qsyn> qcga -CX 1 0
Into append
Line 306
Line 308
size: 3
0
1
2
q: 1
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf08b0
Line 312
Line 321
Line 306
Line 308
size: 3
0
1
2
q: 0
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf0870
Line 312
Line 321

qsyn> qcga -CX 0 1
Into append
Line 306
Line 308
size: 3
0
1
2
q: 0
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf0870
Line 312
Line 321
Line 306
Line 308
size: 3
0
1
2
q: 1
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf08b0
Line 312
Line 321

qsyn> qcga -CX 1 0
Into append
Line 306
Line 308
size: 3
0
1
2
q: 1
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf08b0
Line 312
Line 321
Line 306
Line 308
size: 3
0
1
2
q: 0
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf0870
Line 312
Line 321

qsyn> qcga -CX 0 2
Into append
Line 306
Line 308
size: 3
0
1
2
q: 0
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf0870
Line 312
Line 321
Line 306
Line 308
size: 3
0
1
2
q: 2
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf0890
Line 318
Line 321

qsyn> qcga -CX 2 0
Into append
Line 306
Line 308
size: 3
0
1
2
q: 2
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf0890
Line 312
Line 321
Line 306
Line 308
size: 3
0
1
2
q: 0
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf0870
Line 312
Line 321

qsyn> qcga -CX 1 2
Into append
Line 306
Line 308
size: 3
0
1
2
q: 1
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf08b0
Line 312
Line 321
Line 306
Line 308
size: 3
0
1
2
q: 2
Line 310
0x7ffd6a90e730
Line 310-2
0x55872bbf0890
Line 312
Line 321

qsyn> qccprint -l
Listed by gate ID
ID:   0 ( cx)      Time:    1     Qubit:   0   1 
ID:   1 ( cx)      Time:    2     Qubit:   1   0 
ID:   2 ( cx)      Time:    3     Qubit:   0   1 
ID:   3 ( cx)      Time:    4     Qubit:   1   0 
ID:   4 ( cx)      Time:    5     Qubit:   0   2 
ID:   5 ( cx)      Time:    6     Qubit:   2   0 
ID:   6 ( cx)      Time:    7     Qubit:   1   2 

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> optimize
Before Parse Forward
Start parseForward
Listed by gate ID
ID:   0 ( cx)      Time:    1     Qubit:   0   1 
ID:   1 ( cx)      Time:    2     Qubit:   1   0 
ID:   2 ( cx)      Time:    3     Qubit:   0   1 
ID:   3 ( cx)      Time:    4     Qubit:   1   0 
ID:   4 ( cx)      Time:    5     Qubit:   0   2 
ID:   5 ( cx)      Time:    6     Qubit:   2   0 
ID:   6 ( cx)      Time:    7     Qubit:   1   2 
######### start parse gate ##########
ID:   0 ( cx)      Time:    1     Qubit:   0   1 
_______________APPLY ADDCX_______________
Control: 0 Target: 1
Into second loop
Into fourth loop(!found match)
Done addcx:
Parse gate done
_gates[0]
ID:   0 ( cx)      Time:    0     Qubit:   0   1 
_gates[1]
ID:   0 ( cx)      Time:    0     Qubit:   0   1 
_gates[2]
_available[0]
ID:   0 ( cx)      Time:    0     Qubit:   0   1 
_available[1]
ID:   0 ( cx)      Time:    0     Qubit:   0   1 
_available[2]
_availty[0]: 1  _availty[1]: 2  _availty[2]: 1  _zs 0

######### start parse gate ##########
ID:   1 ( cx)      Time:    2     Qubit:   1   0 
_______________APPLY ADDCX_______________
Control: 1 Target: 0
Into first loop
doswap
0
End doswap
Parse gate done
_gates[0]
ID:   1 ( cx)      Time:    0     Qubit:   1   0 
_gates[1]
ID:   1 ( cx)      Time:    0     Qubit:   1   0 
_gates[2]
_available[0]
ID:   1 ( cx)      Time:    0     Qubit:   1   0 
_available[1]
ID:   1 ( cx)      Time:    0     Qubit:   1   0 
_available[2]
_availty[0]: 2  _availty[1]: 1  _availty[2]: 1  _zs 0

######### start parse gate ##########
ID:   2 ( cx)      Time:    3     Qubit:   0   1 
_______________APPLY ADDCX_______________
Control: 1 Target: 0
into for loop 
Into third loop(found match)
Done addcx:
Parse gate done
_gates[0]
_gates[1]
_gates[2]
_available[0]
_available[1]
_available[2]
_availty[0]: 2  _availty[1]: 1  _availty[2]: 1  _zs 0

######### start parse gate ##########
ID:   3 ( cx)      Time:    4     Qubit:   1   0 
_______________APPLY ADDCX_______________
Control: 0 Target: 1
Into first loop
Into second loop
Into fourth loop(!found match)
Done addcx:
Parse gate done
_gates[0]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
_gates[1]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
_gates[2]
_available[0]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
_available[1]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
_available[2]
_availty[0]: 1  _availty[1]: 2  _availty[2]: 1  _zs 0

######### start parse gate ##########
ID:   4 ( cx)      Time:    5     Qubit:   0   2 
_______________APPLY ADDCX_______________
Control: 1 Target: 2
Into first loop
Into second loop
Into fourth loop(!found match)
Done addcx:
Parse gate done
_gates[0]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
_gates[1]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
ID:   3 ( cx)      Time:    0     Qubit:   1   2 
_gates[2]
ID:   3 ( cx)      Time:    0     Qubit:   1   2 
_available[0]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
_available[1]
ID:   3 ( cx)      Time:    0     Qubit:   1   2 
_available[2]
ID:   3 ( cx)      Time:    0     Qubit:   1   2 
_availty[0]: 1  _availty[1]: 1  _availty[2]: 2  _zs 0

######### start parse gate ##########
ID:   5 ( cx)      Time:    6     Qubit:   2   0 
_______________APPLY ADDCX_______________
Control: 2 Target: 1
Into first loop
doswap
0
End doswap
Parse gate done
_gates[0]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
_gates[1]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
_gates[2]
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
_available[0]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
_available[1]
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
_available[2]
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
_availty[0]: 1  _availty[1]: 2  _availty[2]: 1  _zs 0

######### start parse gate ##########
ID:   6 ( cx)      Time:    7     Qubit:   1   2 
_______________APPLY ADDCX_______________
Control: 0 Target: 1
into for loop 
Into third loop(found match)
Into fourth loop(!found match)
Done addcx:
Parse gate done
_gates[0]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
ID:   5 ( cx)      Time:    0     Qubit:   0   1 
_gates[1]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
ID:   5 ( cx)      Time:    0     Qubit:   0   1 
_gates[2]
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
_available[0]
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
ID:   5 ( cx)      Time:    0     Qubit:   0   1 
_available[1]
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
ID:   5 ( cx)      Time:    0     Qubit:   0   1 
_available[2]
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
_availty[0]: 1  _availty[1]: 2  _availty[2]: 1  _zs 0

start topo sort
In to while: 0
q: 2 size: 1
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
case III
q: 1 size: 3
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
case III
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
Line 691: 0x55872bbf1d40
Into append
Line 306
Line 308
size: 3
0
1
2
q: 2
Line 310
0x7ffd6a90e390
Line 310-2
0x55872bbf1d40
Line 318
Line 321
Line 306
Line 308
size: 3
0
1
2
q: 1
Line 310
0x7ffd6a90e390
Line 310-2
0x55872bbf2220
Line 318
Line 321
ID:   5 ( cx)      Time:    0     Qubit:   0   1 
q: 0 size: 2
ID:   2 ( cx)      Time:    0     Qubit:   0   1 
case II
Line A: 0x55872bbf1d40
Line B: 0x55872bbf1d40
Line C: 0x55872bbf1d40
Line 691: 0x55872bbf1d40
Into append
Line 306
Line 308
size: 3
0
1
2
q: 0
Line 310
0x7ffd6a90e390
Line 310-2
0x55872bbf0980
Line 318
Line 321
Line 306
Line 308
size: 3
0
1
2
q: 1
Line 310
0x7ffd6a90e390
Line 310-2
0x55872bbf2220
Line 312
Line 321
Line D
ID:   5 ( cx)      Time:    0     Qubit:   0   1 
case II
Line A: 0x55872bbf1d40
Line B: 0x55872bbf1d40
Line C: 0x55872bbf1d40
Line 691: 0x55872bbf1d40
Into append
Line 306
Line 308
size: 3
0
1
2
q: 0
Line 310
0x7ffd6a90e390
Line 310-2
0x55872bbf0980
Line 312
Line 321
Line 306
Line 308
size: 3
0
1
2
q: 1
Line 310
0x7ffd6a90e390
Line 310-2
0x55872bbf2220
Line 312
Line 321
Line D
In to while: 0
q: 2 size: 0
q: 1 size: 1
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
case III
q: 0 size: 0
In to while: 0
q: 2 size: 0
q: 1 size: 1
ID:   4 ( cx)      Time:    0     Qubit:   2   1 
case II
Line A: 0x55872bbf1d40
Line B: 0x55872bbf1d40
Line C: Error: The qubit do not exist.
0
Line 691: Error: The qubit do not exist.
0
Into append
Line 306
Line 308
size: 3
0
1
94039042896368
q: 2
Error: The qubit do not exist.
Line 310
0x7ffd6a90e390
Line 310-2
0
