DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> verbose 0
Note: verbose level is set to 0

qsyn> qccread benchmark/benchmark_SABRE/large/dc2_222.qasm

qsyn> qc2zx

qsyn> zxgsimp -fr

qsyn> zx2qc
Finish extracting!

qsyn> optimize
QCir 1( 16 qubits, 8530 gates)
Parse gate: 8530 times
###########  Number 1 iter #############
Parse gate: 6274 times
Parse gate: 6186 times
###########  Number 2 iter #############
Parse gate: 6151 times
Parse gate: 6630 times

qsyn> qc2zx  

qsyn> zxgadj

qsyn> zxcomp 0 

qsyn> zxgs -fr  

qsyn> zxgp -a       
#T-gate:                      0
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           0

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

