DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> qccread ./benchmark/benchmark_SABRE/small/miller_11.qasm
Create and checkout to QCir 0

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgsimp -fr

All rules applied in order:
Hadamard Rule                 1 iterations.
  1) 6 matches
Spider Fusion Rule            3 iterations.
  1) 14 matches
  2) 3 matches
  3) 3 matches
Spider Fusion Rule            1 iterations.
  1) 4 matches
Pivot Rule                    1 iterations.
  1) 2 matches
Pivot Gadget Rule             3 iterations.
  1) 8 matches
  2) 4 matches
  3) 2 matches
Identity Removal Rule         1 iterations.
  1) 3 matches
Spider Fusion Rule            2 iterations.
  1) 1 matches
  2) 1 matches

qsyn> zx2qc
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1
Finish extracting!
Create and checkout to QCir 1

qsyn> qccw ref/optimize/FR_miller_11.qasm

qsyn> optimize
###########  Number 1 iter #############
###########  Number 2 iter #############
Final result
Listed by gate ID
ID:   0 ( cx)      Time:    1     Qubit:   2   1 
ID:   1 (  h)      Time:    2     Qubit:   2 
ID:   2 (  p)      Time:    3     Qubit:   2 
ZPhase is  3π/4
ID:   3 ( cx)      Time:    4     Qubit:   2   1 
ID:   4 (sdg)      Time:    5     Qubit:   1 
ID:   5 ( cx)      Time:    5     Qubit:   2   0 
ID:   6 (  p)      Time:    6     Qubit:   0 
ZPhase is  7π/4
ID:   7 ( cx)      Time:    7     Qubit:   0   1 
ID:   8 (  s)      Time:    8     Qubit:   0 
ID:   9 ( cx)      Time:    9     Qubit:   2   0 
ID:  10 (  p)      Time:   10     Qubit:   0 
ZPhase is  π/4
ID:  11 (  s)      Time:    8     Qubit:   1 
ID:  12 ( cx)      Time:   10     Qubit:   1   2 
ID:  13 (  p)      Time:   11     Qubit:   1 
ZPhase is  π/4
ID:  14 ( cx)      Time:   12     Qubit:   0   1 
ID:  15 (  p)      Time:   11     Qubit:   2 
ZPhase is  3π/4
ID:  16 (  p)      Time:   13     Qubit:   1 
ZPhase is  3π/4
ID:  17 ( cx)      Time:   13     Qubit:   0   2 
ID:  18 (  h)      Time:   14     Qubit:   0 
ID:  19 (  p)      Time:   15     Qubit:   0 
ZPhase is  7π/4
ID:  20 ( cx)      Time:   16     Qubit:   1   0 
ID:  21 (  p)      Time:   17     Qubit:   0 
ZPhase is  π/4
ID:  22 (  p)      Time:   14     Qubit:   2 
ZPhase is  3π/4
ID:  23 (  h)      Time:   15     Qubit:   2 
ID:  24 (  p)      Time:   16     Qubit:   2 
ZPhase is  π/4
ID:  25 ( cx)      Time:   17     Qubit:   1   2 
ID:  26 (  p)      Time:   18     Qubit:   2 
ZPhase is  7π/4
ID:  27 ( cx)      Time:   19     Qubit:   0   2 
ID:  28 (  h)      Time:   20     Qubit:   0 
ID:  29 (  p)      Time:   21     Qubit:   0 
ZPhase is  π/4
ID:  30 ( cx)      Time:   22     Qubit:   1   0 
ID:  31 (  p)      Time:   23     Qubit:   0 
ZPhase is  7π/4
ID:  32 (  p)      Time:   20     Qubit:   2 
ZPhase is  π/4
ID:  33 ( cx)      Time:   23     Qubit:   1   2 
ID:  34 (  p)      Time:   24     Qubit:   2 
ZPhase is  7π/4
ID:  35 (  h)      Time:   25     Qubit:   2 
ID:  36 (  p)      Time:   26     Qubit:   2 
ZPhase is  7π/4
ID:  37 ( cx)      Time:   27     Qubit:   2   0 
ID:  38 (  p)      Time:   28     Qubit:   0 
ZPhase is  7π/4
ID:  39 ( cx)      Time:   29     Qubit:   1   0 
ID:  40 (  p)      Time:   30     Qubit:   0 
ZPhase is  π/4
ID:  41 ( cx)      Time:   30     Qubit:   1   2 
ID:  42 (  p)      Time:   31     Qubit:   2 
ZPhase is  π/4
ID:  43 (  h)      Time:   32     Qubit:   2 
ID:  44 ( cx)      Time:   33     Qubit:   2   1 

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

