DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> qccread ./benchmark/benchmark_SABRE/small/4mod5-v0_20.qasm
Create and checkout to QCir 0

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgsimp -fr

All rules applied in order:
Hadamard Rule                 1 iterations.
  1) 2 matches
Spider Fusion Rule            3 iterations.
  1) 4 matches
  2) 3 matches
  3) 1 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Pivot Gadget Rule             2 iterations.
  1) 3 matches
  2) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches

qsyn> zx2qc
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1
Finish extracting!
Create and checkout to QCir 1

qsyn> optimize
###########  Number 1 iter #############
###########  Number 2 iter #############
Final result
Listed by gate ID
ID:   0 ( cx)      Time:    1     Qubit:   3   1 
ID:   1 ( cx)      Time:    1     Qubit:   0   2 
ID:   2 (  p)      Time:    2     Qubit:   2 
ZPhase is  7π/4
ID:   3 ( cx)      Time:    3     Qubit:   2   1 
ID:   4 ( cz)      Time:    4     Qubit:   1   4 
ID:   5 (  p)      Time:    5     Qubit:   1 
ZPhase is  7π/4
ID:   6 ( cx)      Time:    6     Qubit:   2   1 
ID:   7 (  p)      Time:    7     Qubit:   1 
ZPhase is  7π/4
ID:   8 (  h)      Time:    5     Qubit:   4 
ID:   9 (  p)      Time:    6     Qubit:   4 
ZPhase is  π/4
ID:  10 ( cx)      Time:    7     Qubit:   4   2 
ID:  11 (  p)      Time:    8     Qubit:   2 
ZPhase is  π/4
ID:  12 ( cx)      Time:    9     Qubit:   1   2 
ID:  13 ( cx)      Time:   10     Qubit:   4   1 
ID:  14 (  p)      Time:   11     Qubit:   1 
ZPhase is  π/4
ID:  15 ( cx)      Time:   11     Qubit:   2   4 
ID:  16 (  p)      Time:   12     Qubit:   2 
ZPhase is  π/4
ID:  17 ( cx)      Time:   13     Qubit:   2   1 
ID:  18 (  h)      Time:   14     Qubit:   2 
ID:  19 (  x)      Time:    2     Qubit:   0 
ID:  20 (  x)      Time:   12     Qubit:   4 
ID:  21 (  x)      Time:   14     Qubit:   1 
ID:  22 ( cx)      Time:   15     Qubit:   1   4 
ID:  23 ( cx)      Time:   16     Qubit:   4   1 
ID:  24 ( cx)      Time:   17     Qubit:   1   4 
ID:  25 ( cx)      Time:   18     Qubit:   2   4 
ID:  26 ( cx)      Time:   19     Qubit:   4   2 
ID:  27 ( cx)      Time:   20     Qubit:   2   4 

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

