DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm82a_208.qasm

qsyn> qccp 
QCir 0( 16 qubits, 650 gates)
Clifford    : 370
└── 2-qubit : 283
T-family    : 280
Others      : 0
Depth       : 571

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0 seconds
Total time used  : 0 seconds
Total memory used: 2.707 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0 seconds
Total time used  : 0 seconds
Total memory used: 2.707 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 575 gates)
Clifford    : 581
└── 2-qubit : 226
T-family    : 122
Others      : 0
Depth       : 605

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 384 gates)
Clifford    : 284
└── 2-qubit : 217
T-family    : 122
Others      : 0
Depth       : 477

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.02 seconds
Total time used  : 0.02 seconds
Total memory used: 6.387 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

