DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dc2_222.qasm

qsyn> qccp 
QCir 0( 16 qubits, 9462 gates)
Clifford    : 5332
└── 2-qubit : 4131
T-family    : 4130
Others      : 0
Depth       : 8759

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.06 seconds
Total time used  : 1.06 seconds
Total memory used: 108.7 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.33 seconds
Total time used  : 1.39 seconds
Total memory used: 109.2 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 8215 gates)
Clifford    : 7725
└── 2-qubit : 3530
T-family    : 1758
Others      : 0
Depth       : 10658

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 5655 gates)
Clifford    : 4155
└── 2-qubit : 3174
T-family    : 1758
Others      : 0
Depth       : 7944

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 3.43 seconds
Total time used  : 4.82 seconds
Total memory used: 185.7 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

