DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dist_223.qasm

qsyn> qccp 
QCir 0( 16 qubits, 38046 gates)
Clifford    : 21428
└── 2-qubit : 16624
T-family    : 16618
Others      : 0
Depth       : 32968

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 14.34 seconds
Total time used  : 14.34 seconds
Total memory used: 1179 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.03 seconds
Total time used  : 15.37 seconds
Total memory used: 1179 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 32841 gates)
Clifford    : 32803
└── 2-qubit : 14789
T-family    : 6868
Others      : 0
Depth       : 41312

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 22868 gates)
Clifford    : 16750
└── 2-qubit : 12973
T-family    : 6868
Others      : 0
Depth       : 30245

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 61.43 seconds
Total time used  : 76.8 seconds
Total memory used: 1179 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

