DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/hwb8_113.qasm

qsyn> qccp 
QCir 0( 16 qubits, 69380 gates)
Clifford    : 39042
└── 2-qubit : 30372
T-family    : 30338
Others      : 0
Depth       : 64758

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 6.74 seconds
Total time used  : 6.74 seconds
Total memory used: 481.7 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.75 seconds
Total time used  : 7.49 seconds
Total memory used: 481.7 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 65360 gates)
Clifford    : 64128
└── 2-qubit : 25947
T-family    : 14934
Others      : 0
Depth       : 78657

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 44063 gates)
Clifford    : 30559
└── 2-qubit : 23057
T-family    : 14934
Others      : 0
Depth       : 57364

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 289 seconds
Total time used  : 296.4 seconds
Total memory used: 1732 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

