DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf2_277.qasm

qsyn> qccp 
QCir 0( 16 qubits, 20112 gates)
Clifford    : 12405
└── 2-qubit : 10066
T-family    : 7707
Others      : 0
Depth       : 19698

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.39 seconds
Total time used  : 0.39 seconds
Total memory used: 52.11 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.16 seconds
Total time used  : 0.55 seconds
Total memory used: 52.11 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 24146 gates)
Clifford    : 28927
└── 2-qubit : 10639
T-family    : 5063
Others      : 0
Depth       : 25384

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 16427 gates)
Clifford    : 12338
└── 2-qubit : 9292
T-family    : 5063
Others      : 0
Depth       : 18612

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 16 seconds
Total time used  : 16.55 seconds
Total memory used: 226.7 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

