DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/benchmark_SABRE/small/3_17_13.qasm
Create and checkout to QCir 0

qsyn> qccp -q
Q 0  ---------cx( 1)-- h( 3)-- t( 6)----------cx( 8)--cx( 9)-- t(14)----------cx(15)--cx(16)-- h(18)-- t(20)--cx(23)----------cx(25)--cx(27)--td(28)----------cx(32)--cx(33)-
Q 1  -----------------cx( 2)-- t( 4)--cx( 7)----------cx( 9)--cx(11)--td(12)----------cx(16)--cx(17)-- t(21)--cx(23)--cx(24)--td(26)--cx(27)--td(29)--cx(31)----------cx(33)--cx(35)-
Q 2  - x( 0)--cx( 1)--cx( 2)-- t( 5)--cx( 7)--cx( 8)--td(10)--cx(11)--td(13)--cx(15)----------cx(17)-- h(19)-- t(22)--cx(24)--cx(25)-- t(30)----------cx(31)--cx(32)-- h(34)--cx(35)-

qsyn> qcgp 1 -t
Q0 Start ───●─── G3
          ┌─┴─┐ 
Q2 G0    ─┤ X ├─ G2
          └───┘ 
Execute at t= 1

qsyn> qccp -q
Q 0  ---------cx( 1)-- h( 3)-- t( 6)----------cx( 8)--cx( 9)-- t(14)----------cx(15)--cx(16)-- h(18)-- t(20)--cx(23)----------cx(25)--cx(27)--td(28)----------cx(32)--cx(33)-
Q 1  -----------------cx( 2)-- t( 4)--cx( 7)----------cx( 9)--cx(11)--td(12)----------cx(16)--cx(17)-- t(21)--cx(23)--cx(24)--td(26)--cx(27)--td(29)--cx(31)----------cx(33)--cx(35)-
Q 2  - x( 0)--cx( 1)--cx( 2)-- t( 5)--cx( 7)--cx( 8)--td(10)--cx(11)--td(13)--cx(15)----------cx(17)-- h(19)-- t(22)--cx(24)--cx(25)-- t(30)----------cx(31)--cx(32)-- h(34)--cx(35)-

qsyn> qcgp 3 -t
       ┌───┐ 
Q0 G1 ─┤ H ├─ G6
       └───┘ 
Execute at t= 2

qsyn> qcgd 1

qsyn> qcgp 3 -t
          ┌───┐ 
Q0 Start ─┤ H ├─ G6
          └───┘ 
Execute at t= 0

qsyn> qccp -q
Q 0  - h( 3)-- t( 6)------------------cx( 8)--cx( 9)-- t(14)----------cx(15)--cx(16)-- h(18)-- t(20)--cx(23)----------cx(25)--cx(27)--td(28)----------cx(32)--cx(33)-
Q 1  ---------cx( 2)-- t( 4)--cx( 7)----------cx( 9)--cx(11)--td(12)----------cx(16)--cx(17)-- t(21)--cx(23)--cx(24)--td(26)--cx(27)--td(29)--cx(31)----------cx(33)--cx(35)-
Q 2  - x( 0)--cx( 2)-- t( 5)--cx( 7)--cx( 8)--td(10)--cx(11)--td(13)--cx(15)----------cx(17)-- h(19)-- t(22)--cx(24)--cx(25)-- t(30)----------cx(31)--cx(32)-- h(34)--cx(35)-

qsyn> qcgp 33 -t
Q1 G31 ───●─── G35
        ┌─┴─┐ 
Q0 G32 ─┤ X ├─ End
        └───┘ 
Execute at t= 19

qsyn> qcgd 8

qsyn> qcgd 10

qsyn> qcba 3

qsyn> qccp -q
Q 0  - h( 3)-- t( 6)------------------cx( 9)-- t(14)----------cx(15)--cx(16)-- h(18)-- t(20)--cx(23)----------cx(25)--cx(27)--td(28)----------cx(32)--cx(33)-
Q 1  ---------cx( 2)-- t( 4)--cx( 7)--cx( 9)--cx(11)--td(12)----------cx(16)--cx(17)-- t(21)--cx(23)--cx(24)--td(26)--cx(27)--td(29)--cx(31)----------cx(33)--cx(35)-
Q 2  - x( 0)--cx( 2)-- t( 5)--cx( 7)----------cx(11)--td(13)--cx(15)----------cx(17)-- h(19)-- t(22)--cx(24)--cx(25)-- t(30)----------cx(31)--cx(32)-- h(34)--cx(35)-
Q 3  
Q 4  
Q 5  

qsyn> qcga -cx 0 4

qsyn> qcga -h 5

qsyn> qcbd 3

qsyn> qcba 2

qsyn> qcgp 36 -t
Q0 G33   ───●─── End
          ┌─┴─┐ 
Q4 Start ─┤ X ├─ End
          └───┘ 
Execute at t= 19

qsyn> qccp -q
Q 0  - h( 3)-- t( 6)------------------cx( 9)-- t(14)----------cx(15)--cx(16)-- h(18)-- t(20)--cx(23)----------cx(25)--cx(27)--td(28)----------cx(32)--cx(33)--cx(36)-
Q 1  ---------cx( 2)-- t( 4)--cx( 7)--cx( 9)--cx(11)--td(12)----------cx(16)--cx(17)-- t(21)--cx(23)--cx(24)--td(26)--cx(27)--td(29)--cx(31)----------cx(33)--cx(35)-
Q 2  - x( 0)--cx( 2)-- t( 5)--cx( 7)----------cx(11)--td(13)--cx(15)----------cx(17)-- h(19)-- t(22)--cx(24)--cx(25)-- t(30)----------cx(31)--cx(32)-- h(34)--cx(35)-
Q 4  ---------------------------------------------------------------------------------------------------------------------------------------------------------cx(36)-
Q 5  - h(37)-
Q 6  
Q 7  

qsyn> qcga -tdg 6

qsyn> qcbd 6
Error: id 6 is not an empty qubit!!
Error: Illegal option!! (6)

qsyn> qcbd 7

qsyn> qccp -q
Q 0  - h( 3)-- t( 6)------------------cx( 9)-- t(14)----------cx(15)--cx(16)-- h(18)-- t(20)--cx(23)----------cx(25)--cx(27)--td(28)----------cx(32)--cx(33)--cx(36)-
Q 1  ---------cx( 2)-- t( 4)--cx( 7)--cx( 9)--cx(11)--td(12)----------cx(16)--cx(17)-- t(21)--cx(23)--cx(24)--td(26)--cx(27)--td(29)--cx(31)----------cx(33)--cx(35)-
Q 2  - x( 0)--cx( 2)-- t( 5)--cx( 7)----------cx(11)--td(13)--cx(15)----------cx(17)-- h(19)-- t(22)--cx(24)--cx(25)-- t(30)----------cx(31)--cx(32)-- h(34)--cx(35)-
Q 4  ---------------------------------------------------------------------------------------------------------------------------------------------------------cx(36)-
Q 5  - h(37)-
Q 6  -td(38)-

qsyn> qq -f

