qsyn> qcir read benchmark/qasm/tof2.qasm

qsyn> qc2zx

qsyn> zx assign 1 I X pi

qsyn> zx assign 1 O X pi

qsyn> zx2ts

qsyn> zx print -v

ID:    0 (●, 0)       (Qubit, Col): (0, 0)         #Neighbors:   1    (8, -)
ID:    1 (●, 0)       (Qubit, Col): (0, 16)        #Neighbors:   1    (8, -)
ID:    4 (●, 0)       (Qubit, Col): (2, 0)         #Neighbors:   1    (6, H)
ID:    5 (●, 0)       (Qubit, Col): (2, 16)        #Neighbors:   1    (6, H)
ID:    6 (Z, π/4)     (Qubit, Col): (2, 15)        #Neighbors:   5    (4, H) (5, H) (10, H) (12, H) (14, H)
ID:    7 (Z, π/4)     (Qubit, Col): (1, 15)        #Neighbors:   5    (10, H) (12, H) (16, H) (17, -) (18, -)
ID:    8 (Z, π/4)     (Qubit, Col): (0, 15)        #Neighbors:   5    (0, -) (1, -) (10, H) (14, H) (16, H)
ID:    9 (Z, π/4)     (Qubit, Col): (-2, 11)       #Neighbors:   1    (10, H)
ID:   10 (Z, 0)       (Qubit, Col): (-1, 11)       #Neighbors:   4    (6, H) (7, H) (8, H) (9, H)
ID:   11 (Z, -π/4)    (Qubit, Col): (-2, 12)       #Neighbors:   1    (12, H)
ID:   12 (Z, 0)       (Qubit, Col): (-1, 12)       #Neighbors:   3    (6, H) (7, H) (11, H)
ID:   13 (Z, -π/4)    (Qubit, Col): (-2, 13)       #Neighbors:   1    (14, H)
ID:   14 (Z, 0)       (Qubit, Col): (-1, 13)       #Neighbors:   3    (6, H) (8, H) (13, H)
ID:   15 (Z, -π/4)    (Qubit, Col): (-2, 14)       #Neighbors:   1    (16, H)
ID:   16 (Z, 0)       (Qubit, Col): (-1, 14)       #Neighbors:   3    (7, H) (8, H) (15, H)
ID:   17 (X, π)       (Qubit, Col): (1, 0)         #Neighbors:   1    (7, -)
ID:   18 (X, π)       (Qubit, Col): (1, 0)         #Neighbors:   1    (7, -)
Total #Vertices: 17


qsyn> zx rule --spider-fusion

qsyn> zx print -v

ID:    0 (●, 0)       (Qubit, Col): (0, 0)         #Neighbors:   1    (8, -)
ID:    1 (●, 0)       (Qubit, Col): (0, 16)        #Neighbors:   1    (8, -)
ID:    4 (●, 0)       (Qubit, Col): (2, 0)         #Neighbors:   1    (6, H)
ID:    5 (●, 0)       (Qubit, Col): (2, 16)        #Neighbors:   1    (6, H)
ID:    6 (Z, π/4)     (Qubit, Col): (2, 15)        #Neighbors:   5    (4, H) (5, H) (10, H) (12, H) (14, H)
ID:    7 (Z, π/4)     (Qubit, Col): (1, 15)        #Neighbors:   5    (10, H) (12, H) (16, H) (17, -) (18, -)
ID:    8 (Z, π/4)     (Qubit, Col): (0, 15)        #Neighbors:   5    (0, -) (1, -) (10, H) (14, H) (16, H)
ID:    9 (Z, π/4)     (Qubit, Col): (-2, 11)       #Neighbors:   1    (10, H)
ID:   10 (Z, 0)       (Qubit, Col): (-1, 11)       #Neighbors:   4    (6, H) (7, H) (8, H) (9, H)
ID:   11 (Z, -π/4)    (Qubit, Col): (-2, 12)       #Neighbors:   1    (12, H)
ID:   12 (Z, 0)       (Qubit, Col): (-1, 12)       #Neighbors:   3    (6, H) (7, H) (11, H)
ID:   13 (Z, -π/4)    (Qubit, Col): (-2, 13)       #Neighbors:   1    (14, H)
ID:   14 (Z, 0)       (Qubit, Col): (-1, 13)       #Neighbors:   3    (6, H) (8, H) (13, H)
ID:   15 (Z, -π/4)    (Qubit, Col): (-2, 14)       #Neighbors:   1    (16, H)
ID:   16 (Z, 0)       (Qubit, Col): (-1, 14)       #Neighbors:   3    (7, H) (8, H) (15, H)
ID:   17 (X, π)       (Qubit, Col): (1, 0)         #Neighbors:   1    (7, -)
ID:   18 (X, π)       (Qubit, Col): (1, 0)         #Neighbors:   1    (7, -)
Total #Vertices: 17


qsyn> zx rule --identity-removal

qsyn> zx print -v

ID:    0 (●, 0)       (Qubit, Col): (0, 0)         #Neighbors:   1    (8, -)
ID:    1 (●, 0)       (Qubit, Col): (0, 16)        #Neighbors:   1    (8, -)
ID:    4 (●, 0)       (Qubit, Col): (2, 0)         #Neighbors:   1    (6, H)
ID:    5 (●, 0)       (Qubit, Col): (2, 16)        #Neighbors:   1    (6, H)
ID:    6 (Z, π/4)     (Qubit, Col): (2, 15)        #Neighbors:   5    (4, H) (5, H) (10, H) (12, H) (14, H)
ID:    7 (Z, π/4)     (Qubit, Col): (1, 15)        #Neighbors:   5    (10, H) (12, H) (16, H) (17, -) (18, -)
ID:    8 (Z, π/4)     (Qubit, Col): (0, 15)        #Neighbors:   5    (0, -) (1, -) (10, H) (14, H) (16, H)
ID:    9 (Z, π/4)     (Qubit, Col): (-2, 11)       #Neighbors:   1    (10, H)
ID:   10 (Z, 0)       (Qubit, Col): (-1, 11)       #Neighbors:   4    (6, H) (7, H) (8, H) (9, H)
ID:   11 (Z, -π/4)    (Qubit, Col): (-2, 12)       #Neighbors:   1    (12, H)
ID:   12 (Z, 0)       (Qubit, Col): (-1, 12)       #Neighbors:   3    (6, H) (7, H) (11, H)
ID:   13 (Z, -π/4)    (Qubit, Col): (-2, 13)       #Neighbors:   1    (14, H)
ID:   14 (Z, 0)       (Qubit, Col): (-1, 13)       #Neighbors:   3    (6, H) (8, H) (13, H)
ID:   15 (Z, -π/4)    (Qubit, Col): (-2, 14)       #Neighbors:   1    (16, H)
ID:   16 (Z, 0)       (Qubit, Col): (-1, 14)       #Neighbors:   3    (7, H) (8, H) (15, H)
ID:   17 (X, π)       (Qubit, Col): (1, 0)         #Neighbors:   1    (7, -)
ID:   18 (X, π)       (Qubit, Col): (1, 0)         #Neighbors:   1    (7, -)
Total #Vertices: 17


qsyn> zx rule --to-z-graph

qsyn> logger debug
[info]     Setting logger level to "debug"

qsyn> zx rule --pivot-gadget
[info]     Pivot Gadget Rule             1 iterations, total    1 matches
[debug]       1) 1 matches

qsyn> logger warn

qsyn> zx print -v

ID:    0 (●, 0)       (Qubit, Col): (0, 0)         #Neighbors:   1    (8, -)
ID:    1 (●, 0)       (Qubit, Col): (0, 16)        #Neighbors:   1    (8, -)
ID:    4 (●, 0)       (Qubit, Col): (2, 0)         #Neighbors:   1    (6, H)
ID:    5 (●, 0)       (Qubit, Col): (2, 16)        #Neighbors:   1    (6, H)
ID:    6 (Z, π/4)     (Qubit, Col): (2, 15)        #Neighbors:   5    (4, H) (5, H) (10, H) (12, H) (14, H)
ID:    8 (Z, π/4)     (Qubit, Col): (0, 15)        #Neighbors:   5    (0, -) (1, -) (10, H) (14, H) (16, H)
ID:    9 (Z, π/4)     (Qubit, Col): (-2, 11)       #Neighbors:   1    (10, H)
ID:   10 (Z, π)       (Qubit, Col): (-1, 11)       #Neighbors:   3    (6, H) (8, H) (9, H)
ID:   11 (Z, -π/4)    (Qubit, Col): (-2, 12)       #Neighbors:   1    (12, H)
ID:   12 (Z, π)       (Qubit, Col): (-1, 12)       #Neighbors:   2    (6, H) (11, H)
ID:   13 (Z, -π/4)    (Qubit, Col): (-2, 13)       #Neighbors:   1    (14, H)
ID:   14 (Z, 0)       (Qubit, Col): (-1, 13)       #Neighbors:   3    (6, H) (8, H) (13, H)
ID:   15 (Z, -π/4)    (Qubit, Col): (-2, 14)       #Neighbors:   1    (16, H)
ID:   16 (Z, π)       (Qubit, Col): (-1, 14)       #Neighbors:   2    (8, H) (15, H)
ID:   19 (Z, π/4)     (Qubit, Col): (-2, 15)       #Neighbors:   1    (20, H)
ID:   20 (Z, π)       (Qubit, Col): (-1, 15)       #Neighbors:   1    (19, H)
Total #Vertices: 16


qsyn> zx rule --identity-removal

qsyn> zx print -v

ID:    0 (●, 0)       (Qubit, Col): (0, 0)         #Neighbors:   1    (8, -)
ID:    1 (●, 0)       (Qubit, Col): (0, 16)        #Neighbors:   1    (8, -)
ID:    4 (●, 0)       (Qubit, Col): (2, 0)         #Neighbors:   1    (6, H)
ID:    5 (●, 0)       (Qubit, Col): (2, 16)        #Neighbors:   1    (6, H)
ID:    6 (Z, π/4)     (Qubit, Col): (2, 15)        #Neighbors:   5    (4, H) (5, H) (10, H) (12, H) (14, H)
ID:    8 (Z, π/4)     (Qubit, Col): (0, 15)        #Neighbors:   5    (0, -) (1, -) (10, H) (14, H) (16, H)
ID:    9 (Z, π/4)     (Qubit, Col): (-2, 11)       #Neighbors:   1    (10, H)
ID:   10 (Z, π)       (Qubit, Col): (-1, 11)       #Neighbors:   3    (6, H) (8, H) (9, H)
ID:   11 (Z, -π/4)    (Qubit, Col): (-2, 12)       #Neighbors:   1    (12, H)
ID:   12 (Z, π)       (Qubit, Col): (-1, 12)       #Neighbors:   2    (6, H) (11, H)
ID:   13 (Z, -π/4)    (Qubit, Col): (-2, 13)       #Neighbors:   1    (14, H)
ID:   14 (Z, 0)       (Qubit, Col): (-1, 13)       #Neighbors:   3    (6, H) (8, H) (13, H)
ID:   15 (Z, -π/4)    (Qubit, Col): (-2, 14)       #Neighbors:   1    (16, H)
ID:   16 (Z, π)       (Qubit, Col): (-1, 14)       #Neighbors:   2    (8, H) (15, H)
ID:   19 (Z, π/4)     (Qubit, Col): (-2, 15)       #Neighbors:   1    (20, H)
ID:   20 (Z, π)       (Qubit, Col): (-1, 15)       #Neighbors:   1    (19, H)
Total #Vertices: 16


qsyn> zx2ts

qsyn> tensor equiv 0 1
Equivalent
- Global Norm : 0.707107
- Global Phase: -π/4

qsyn> quit -f

