DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/pseudoSimp/tof2.qasm

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qczxm
Successfully generated Graph 0
Checkout to Graph 0
---- TRAVERSE AND BUILD THE GRAPH ----
--------------------------------------

qsyn> zxgas 1 I X pi

qsyn> zxgas 1 O X pi

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.414214e+00-1.012105e-15i, -5.222227e-33-8.528544e-17i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 {-5.222227e-33-8.528544e-17i,  1.414214e+00-1.012105e-15i, 
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   1.320285e-16-3.161367e-16i,  1.414214e+00-8.695236e-16i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i, 
   1.414214e+00-8.695236e-16i,  1.320285e-16-3.161367e-16i}}
#Dim:    2	Info: ZX 0

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(25, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(6, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(22, -) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	2	Phase:	Ï€	#Neighbors:	2	(4, -) (8, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(8, -) (13, -) (27, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(6, -) (7, -) (9, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7Ï€/4	#Neighbors:	2	(8, -) (11, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (11, -) (16, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(9, -) (10, -) (12, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(11, -) (14, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(7, -) (14, -) (18, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(12, -) (13, -) (15, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7Ï€/4	#Neighbors:	2	(14, -) (17, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(10, -) (17, -) (20, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(15, -) (16, -) (19, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€/4	#Neighbors:	2	(13, -) (21, -) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(17, -) (22, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(16, -) (21, -) (23, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(18, -) (20, -) (24, -) 
ID:	22	VertexType:	[1m[33mH[0m[0m	Qubit:	2	Phase:	Ï€	#Neighbors:	2	(5, -) (19, -) 
ID:	23	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	2	(20, -) (25, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(21, -) (26, -) 
ID:	25	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (23, -) (26, -) 
ID:	26	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(24, -) (25, -) (28, -) 
ID:	27	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	1	(7, -) 
ID:	28	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	1	(26, -) 
Total #Vertices: 27


qsyn> zxgs -spiderf
Hadamard Rule: 2 . 1 iterations
Spider Fusion Rule: 
4 iterations

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, [1m[34mH[0m[0m) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€/4	#Neighbors:	4	(8, -) (14, -) (21, -) (27, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(4, [1m[34mH[0m[0m) (7, -) (9, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7Ï€/4	#Neighbors:	2	(8, -) (11, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	6	(0, -) (1, -) (11, -) (17, -) (21, -) (28, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(9, -) (10, -) (12, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(11, -) (14, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(7, -) (12, -) (15, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7Ï€/4	#Neighbors:	2	(14, -) (17, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(10, -) (15, -) (19, -) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(5, [1m[34mH[0m[0m) (17, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(7, -) (10, -) (24, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(21, -) (28, -) 
ID:	27	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	1	(7, -) 
ID:	28	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	2	(10, -) (24, -) 
Total #Vertices: 18


qsyn> zxgs -idr
Identity Removal Rule: 
No matches

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, [1m[34mH[0m[0m) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€/4	#Neighbors:	4	(8, -) (14, -) (21, -) (27, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(4, [1m[34mH[0m[0m) (7, -) (9, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7Ï€/4	#Neighbors:	2	(8, -) (11, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	6	(0, -) (1, -) (11, -) (17, -) (21, -) (28, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(9, -) (10, -) (12, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(11, -) (14, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(7, -) (12, -) (15, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7Ï€/4	#Neighbors:	2	(14, -) (17, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(10, -) (15, -) (19, -) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(5, [1m[34mH[0m[0m) (17, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(7, -) (10, -) (24, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(21, -) (28, -) 
ID:	27	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	1	(7, -) 
ID:	28	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	2	(10, -) (24, -) 
Total #Vertices: 18


qsyn> zxgs -tog

qsyn> verb 9
Note: verbose level is set to 9

qsyn> zxgs -pivotg

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€/4	#Neighbors:	4	(8, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) (27, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(4, -) (7, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7Ï€/4	#Neighbors:	2	(8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	6	(0, -) (1, -) (11, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(7, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7Ï€/4	#Neighbors:	2	(14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(5, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(21, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	28	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) 
Total #Vertices: 18

Pivot Gadget Rule: 

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€/4	#Neighbors:	4	(8, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) (27, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(4, -) (7, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7Ï€/4	#Neighbors:	2	(8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	6	(0, -) (1, -) (11, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(7, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7Ï€/4	#Neighbors:	2	(14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(5, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(21, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	28	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) 
Total #Vertices: 18

> match...

-----------

Edge 0: 7 8
(1) type pass
(2) phase pass

-----------

Edge 1: 8 9
(1) type pass
(2) phase pass

-----------

Edge 2: 10 11
(1) type pass
(2) phase pass

-----------

Edge 3: 9 11
(1) type pass
(2) phase pass
(3) Not a bad match
Edge vs and vt are both interior: 11 9
Add vertex 29

-----------

Edge 6: 14 15
(1) type pass
(2) phase pass
(3) Not a bad match
Edge vs and vt are both interior: 14 15
Add vertex 30

-----------

Edge 9: 21 24
(1) type pass
(2) phase pass
(3) Not a bad match
Edge vs and vt are both interior: 21 24
Add vertex 31

-----------

Edge 13: 5 19
Add edge ( 29, 9 )
Add edge ( 30, 15 )
Add edge ( 31, 24 )
Found 3 match(es)
> rewrite...
vs: 11	vt: 9	v_gadget: 29
> rewrite...
vs: 14	vt: 15	v_gadget: 30
> rewrite...
vs: 21	vt: 24	v_gadget: 31
Add edge ( 12, 8 )
Add edge ( 10, 8 )
Add edge ( 11, 29 )
Add edge ( 7, 17 )
Add edge ( 12, 17 )
Add edge ( 14, 30 )
Remove (10, 28 )
Add edge ( 7, 28 )
Add edge ( 21, 31 )
Remove (29, 9 )
Remove (30, 15 )
Remove (31, 24 )
Remove ID: 9
Remove ID: 15
Remove ID: 24

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€/4	#Neighbors:	6	(8, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) (27, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	4	(4, -) (7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	6	(0, -) (1, -) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	4	(8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(7, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	4	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(5, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	28	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
Total #Vertices: 18

> match...

-----------

Edge 0: 7 8
(1) type pass
(2) phase pass

-----------

Edge 1: 10 11
(1) type pass
(2) phase pass

-----------

Edge 2: 11 12
(1) type pass
(2) phase pass

-----------

Edge 3: 12 14
(1) type pass
(2) phase pass

-----------

Edge 4: 17 19
(1) type pass
(2) phase pass

-----------

Edge 5: 0 10

-----------

Edge 6: 27 7
(1) type pass
(2) phase pass
(3) Not a bad match
Edge vs and vt are both interior: 27 7
Add vertex 32

-----------

Edge 8: 5 19

-----------

Edge 12: 10 1

-----------

Edge 16: 11 29
(1) type pass
(2) phase pass
Add edge ( 32, 7 )
Found 1 match(es)
> rewrite...
vs: 27	vt: 7	v_gadget: 32
Add edge ( 27, 32 )
Remove (32, 7 )
Remove ID: 7
Remove ID: 28

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€	#Neighbors:	3	(4, -) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	6	(0, -) (1, -) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	4	(8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(12, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	2	(5, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
Total #Vertices: 17

> match...

-----------

Edge 0: 10 11
(1) type pass
(2) phase pass

-----------

Edge 1: 11 12
(1) type pass
(2) phase pass

-----------

Edge 2: 12 14
(1) type pass
(2) phase pass

-----------

Edge 3: 17 19
(1) type pass
(2) phase pass

-----------

Edge 4: 0 10

-----------

Edge 5: 4 8

-----------

Edge 6: 5 19

-----------

Edge 7: 10 17
(1) type pass
(2) phase pass

-----------

Edge 8: 10 1

-----------

Edge 9: 10 21
(1) type pass
(2) phase pass

-----------

Edge 10: 12 8
(1) type pass
(2) phase pass

-----------

Edge 11: 10 8
(1) type pass
(2) phase pass

-----------

Edge 12: 11 29
(1) type pass
(2) phase pass

-----------

Edge 13: 12 17
(1) type pass
(2) phase pass
(3) Not a bad match
Edge vs and vt are both interior: 17 12
Add vertex 33

-----------

Edge 15: 21 31
(1) type pass
(2) phase pass

-----------

Edge 16: 27 32
(1) type pass
(2) phase pass
Add edge ( 33, 12 )
Found 1 match(es)
> rewrite...
vs: 17	vt: 12	v_gadget: 33
Remove (10, 8 )
Add edge ( 10, 14 )
Remove (10, 11 )
Add edge ( 19, 8 )
Add edge ( 19, 14 )
Add edge ( 19, 11 )
Add edge ( 17, 33 )
Remove (33, 12 )
Remove ID: 12

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	2	(4, -) (19, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	5	(0, -) (1, -) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(19, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (33, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	5	(5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(17, [1m[34mH[0m[0m) 
Total #Vertices: 17

> match...

-----------

Edge 0: 17 19
(1) type pass
(2) phase pass

-----------

Edge 1: 0 10

-----------

Edge 2: 4 8

-----------

Edge 3: 5 19

-----------

Edge 4: 10 17
(1) type pass
(2) phase pass

-----------

Edge 5: 10 1

-----------

Edge 6: 10 21
(1) type pass
(2) phase pass

-----------

Edge 7: 11 29
(1) type pass
(2) phase pass

-----------

Edge 8: 14 30
(1) type pass
(2) phase pass

-----------

Edge 9: 21 31
(1) type pass
(2) phase pass

-----------

Edge 10: 27 32
(1) type pass
(2) phase pass

-----------

Edge 11: 10 14
(1) type pass
(2) phase pass

-----------

Edge 12: 19 8
(1) type pass
(2) phase pass

-----------

Edge 13: 19 14
(1) type pass
(2) phase pass

-----------

Edge 14: 19 11
(1) type pass
(2) phase pass

-----------

Edge 15: 17 33
(1) type pass
(2) phase pass
3 iterations


ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	2	(4, -) (19, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	5	(0, -) (1, -) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(19, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (33, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	5	(5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(17, [1m[34mH[0m[0m) 
Total #Vertices: 17

Hopf Rule: 

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	2	(4, -) (19, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	5	(0, -) (1, -) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(19, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (33, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	5	(5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(17, [1m[34mH[0m[0m) 
Total #Vertices: 17

No matches


ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	2	(4, -) (19, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	5	(0, -) (1, -) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(19, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (33, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	5	(5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(17, [1m[34mH[0m[0m) 
Total #Vertices: 17


qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	2	(4, -) (19, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	5	(0, -) (1, -) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(19, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (33, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	5	(5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(17, [1m[34mH[0m[0m) 
Total #Vertices: 17


qsyn> zxgs -idr

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	2	(4, -) (19, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	5	(0, -) (1, -) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(19, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (33, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	5	(5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(17, [1m[34mH[0m[0m) 
Total #Vertices: 17

Identity Removal Rule: 

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	2	(4, -) (19, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	5	(0, -) (1, -) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(19, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (33, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	5	(5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(17, [1m[34mH[0m[0m) 
Total #Vertices: 17

Found 1 match(es)
Add edge ( 19, 4 )
Remove ID: 8

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	5	(0, -) (1, -) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(19, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (33, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	5	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(17, [1m[34mH[0m[0m) 
Total #Vertices: 16

1 iterations


ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	5	(0, -) (1, -) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(19, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (33, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	5	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(17, [1m[34mH[0m[0m) 
Total #Vertices: 16


qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	5	(0, -) (1, -) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(19, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	3	(10, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) (33, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	Ï€/4	#Neighbors:	5	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	2	(10, [1m[34mH[0m[0m) (31, [1m[34mH[0m[0m) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	Ï€	#Neighbors:	1	(32, [1m[34mH[0m[0m) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(11, [1m[34mH[0m[0m) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(14, [1m[34mH[0m[0m) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	7Ï€/4	#Neighbors:	1	(21, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(27, [1m[34mH[0m[0m) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€/4	#Neighbors:	1	(17, [1m[34mH[0m[0m) 
Total #Vertices: 16


qsyn> q -f

