qsyn> verb 3
Note: verbose level is set to 3

qsyn> zxm -on 
ZXMODE turn ON!

qsyn> zxgread benchmark/zx/tof3.zx
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(25, -) 
ID:	4	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(26, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(22, -) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (8, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (8, -) (13, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(6, -) (7, -) (9, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(8, -) (11, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (11, -) (16, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(9, -) (10, -) (12, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	2	(11, -) (14, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(7, -) (14, -) (18, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(12, -) (13, -) (15, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(14, -) (17, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(10, -) (17, -) (20, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(15, -) (16, -) (19, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	2	(13, -) (21, -) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	2	(17, -) (22, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(16, -) (21, -) (23, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(18, -) (20, -) (24, -) 
ID:	22	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(5, -) (19, -) 
ID:	23	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	2	(20, -) (25, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(21, -) (26, -) 
ID:	25	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(3, -) (23, -) (26, -) 
ID:	26	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(4, -) (24, -) (25, -) 
Total #Vertices: 27

qsyn> zxgs -spiderfusion
Hadamard Rule: 2 . 1 iterations
Spider Fusion: 
3 iterations

qsyn> zxgs -tograph

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	3	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(26, [1m[34mH[0m[0m) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	4	(1, -) (8, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(2, -) (7, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	6	(0, -) (3, -) (11, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	2	(11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(7, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	2	(5, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(21, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) 
ID:	26	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(4, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) 
Total #Vertices: 19

qsyn> zxgs -pivotgadget
Pivot Gadget Rule: 
1 iterations

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	3	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	4	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(26, [1m[34mH[0m[0m) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(19, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	4	(1, -) (8, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(2, -) (7, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	7	(0, -) (3, -) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	0	#Neighbors:	3	(9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	3	(8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(7, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(14, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€/4	#Neighbors:	2	(5, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	2	(21, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) 
ID:	26	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(4, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) 
Total #Vertices: 19

qsyn> q -f

