DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qcba 3
Note: QCir list is empty now. Create a new one.
Create and checkout to QCir 0

qsyn> qcga -cx 0 2

qsyn> qcga -rz -ph pi 0

qsyn> qcbd 1

qsyn> qccp -q
Q 0  ---------cx( 0)--rz( 1)-
Q 2  ---------cx( 0)-

qsyn> qcnew
Create and checkout to QCir 1

qsyn> qcba 4

qsyn> qcga -cx 1 2

qsyn> qcga -cx 0 3

qsyn> qcga -cx 0 2

qsyn> qccp -q
Q 0  ---------cx( 1)----------cx( 2)-
Q 1  ---------cx( 0)-
Q 2  ---------cx( 0)----------cx( 2)-
Q 3  ---------cx( 1)-

qsyn> qcch 0
Checkout to QCir 0

qsyn> qccp -q
Q 0  ---------cx( 0)--rz( 1)-
Q 2  ---------cx( 0)-

qsyn> qccompose 1

qsyn> qccp -q
Q 0  ---------cx( 0)--rz( 1)----------cx( 3)----------cx( 4)-
Q 1  -------------------------cx( 2)-
Q 2  ---------cx( 0)----------cx( 2)------------------cx( 4)-
Q 3  ---------------------------------cx( 3)-

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   1     (15, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (11, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   1     (11, -) 
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (9, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   1     (16, -) 
ID:   6 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (14, -) 
ID:   7 (●, 0)           (Qubit, Col): (3, 10)	  #Neighbors:   1     (14, -) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 4)	  #Neighbors:   3     (0, -) (9, -) (10, -) 
ID:   9 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 4)	  #Neighbors:   3     (4, -) (8, -) (12, -) 
ID:  10 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 4)	  #Neighbors:   2     (8, -) (13, -) 
ID:  11 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 6)	  #Neighbors:   3     (2, -) (3, -) (12, -) 
ID:  12 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 6)	  #Neighbors:   3     (9, -) (11, -) (16, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   3     (10, -) (14, -) (15, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 7)	  #Neighbors:   3     (6, -) (7, -) (13, -) 
ID:  15 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 9)	  #Neighbors:   3     (1, -) (13, -) (16, -) 
ID:  16 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 9)	  #Neighbors:   3     (5, -) (12, -) (15, -) 
Total #Vertices: 17


qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1.02536
- Global Phase: 161π/282

qsyn> qcr

qsyn> qccread benchmark/benchmark_SABRE/small/qft_4.qasm
Create and checkout to QCir 0

qsyn> qccread benchmark/benchmark_SABRE/small/qft_4.qasm
Create and checkout to QCir 1

qsyn> qccp -q
Q 0  ---------cx( 0)----------cx( 1)----------cx( 2)-
Q 1  ---------cx( 0)--------------------------cx( 3)----------cx( 4)-
Q 2  -------------------------cx( 1)----------cx( 3)--------------------------cx( 5)-
Q 3  -----------------------------------------cx( 2)----------cx( 4)----------cx( 5)-

qsyn> qccompose 1

qsyn> qccp -q
Q 0  ---------cx( 0)----------cx( 1)----------cx( 2)--------------------------cx( 6)----------cx( 7)----------cx( 9)-
Q 1  ---------cx( 0)--------------------------cx( 3)----------cx( 4)----------cx( 6)--------------------------cx( 8)----------cx(10)-
Q 2  -------------------------cx( 1)----------cx( 3)--------------------------cx( 5)----------cx( 7)----------cx( 8)--------------------------cx(11)-
Q 3  -----------------------------------------cx( 2)----------cx( 4)----------cx( 5)--------------------------cx( 9)----------cx(10)----------cx(11)-

qsyn> qccompose 0

qsyn> qccp -q
Q 0  ---------cx( 0)----------cx( 1)----------cx( 2)--------------------------cx( 6)----------cx( 7)----------cx( 9)--------------------------cx(12)----------cx(13)----------cx(15)-
Q 1  ---------cx( 0)--------------------------cx( 3)----------cx( 4)----------cx( 6)--------------------------cx( 8)----------cx(10)----------cx(12)--------------------------cx(14)----------cx(16)-
Q 2  -------------------------cx( 1)----------cx( 3)--------------------------cx( 5)----------cx( 7)----------cx( 8)--------------------------cx(11)----------cx(13)----------cx(14)--------------------------cx(17)-
Q 3  -----------------------------------------cx( 2)----------cx( 4)----------cx( 5)--------------------------cx( 9)----------cx(10)----------cx(11)--------------------------cx(15)----------cx(16)----------cx(17)-

qsyn> qq -f

