DV Lab, NTUEE, Qsyn 0.5.1
qsyn> qccr benchmark/benchmark_SABRE/small/rd32-v1_68.qasm

qsyn> qccp -q
Q 0  - t( 3)----------cx( 5)----------cx( 6)--td( 8)------------------cx( 9)--td(11)----------cx(13)--------------------------cx(15)----------cx(17)-
Q 1  - t( 2)----------cx( 5)--------------------------cx( 7)----------cx( 9)--td(10)--------------------------cx(14)----------cx(15)----------cx(17)-- t(20)----------cx(22)----------cx(23)--td(25)------------------cx(26)--td(28)----------cx(30)--------------------------cx(32)----------cx(35)-
Q 2  - t(19)----------------------------------------------------------------------------------------------------------------------------------------------------------cx(22)--------------------------cx(24)----------cx(26)--td(27)--------------------------cx(31)----------cx(32)----------cx(35)-
Q 3  - x( 0)-- h( 1)-- t( 4)----------cx( 6)----------cx( 7)-- t(12)--------------------------cx(13)----------cx(14)-- h(16)-- h(18)-- t(21)------------------------------------------cx(23)----------cx(24)-- t(29)--------------------------cx(30)----------cx(31)-- h(33)-- x(34)-

qsyn> qccop

qsyn> qccp -q
Q 0  - t( 3)----------cx( 5)----------cx( 6)--td( 8)------------------cx( 9)--td(11)----------cx(13)--------------------------cx(15)----------cx(17)-
Q 1  - t( 2)----------cx( 5)--------------------------cx( 7)----------cx( 9)--td(10)--------------------------cx(14)----------cx(15)----------cx(17)-- t(20)----------cx(22)----------cx(23)--td(25)------------------cx(26)--td(28)----------cx(30)--------------------------cx(32)----------cx(35)-
Q 2  - t(19)----------------------------------------------------------------------------------------------------------------------------------------------------------cx(22)--------------------------cx(24)----------cx(26)--td(27)--------------------------cx(31)----------cx(32)----------cx(35)-
Q 3  - x( 0)-- h( 1)-- t( 4)----------cx( 6)----------cx( 7)-- t(12)--------------------------cx(13)----------cx(14)-- h(16)-- h(18)-- t(21)------------------------------------------cx(23)----------cx(24)-- t(29)--------------------------cx(30)----------cx(31)-- h(33)-- x(34)-

qsyn> qccr benchmark/benchmark_SABRE/small/qft_4.qasm

qsyn> qc2zx

qsyn> qccp -q
Q 0  ---------cx( 0)----------cx( 1)----------cx( 2)-
Q 1  ---------cx( 0)--------------------------cx( 3)----------cx( 4)-
Q 2  -------------------------cx( 1)----------cx( 3)--------------------------cx( 5)-
Q 3  -----------------------------------------cx( 2)----------cx( 4)----------cx( 5)-

qsyn> qccop 0 -r

qsyn> qccp -q
Q 0  ---------cx( 0)----------cx( 1)----------cx( 2)-
Q 1  ---------cx( 0)--------------------------cx( 3)----------cx( 4)-
Q 2  -------------------------cx( 1)----------cx( 3)--------------------------cx( 5)-
Q 3  -----------------------------------------cx( 2)----------cx( 4)----------cx( 5)-

qsyn> qc2zx

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 13)	  #Neighbors:   1     (14, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 13)	  #Neighbors:   1     (16, -) 
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (11, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 13)	  #Neighbors:   1     (18, -) 
ID:   6 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (15, -) 
ID:   7 (●, 0)           (Qubit, Col): (3, 13)	  #Neighbors:   1     (19, -) 
ID:   8 (Z, 0)           (Qubit, Col): (0, 4)	  #Neighbors:   3     (0, -) (9, -) (10, -) 
ID:   9 (X, 0)           (Qubit, Col): (1, 4)	  #Neighbors:   3     (2, -) (8, -) (12, -) 
ID:  10 (Z, 0)           (Qubit, Col): (0, 6)	  #Neighbors:   3     (8, -) (11, -) (14, -) 
ID:  11 (X, 0)           (Qubit, Col): (2, 6)	  #Neighbors:   3     (4, -) (10, -) (13, -) 
ID:  12 (Z, 0)           (Qubit, Col): (1, 8)	  #Neighbors:   3     (9, -) (13, -) (16, -) 
ID:  13 (X, 0)           (Qubit, Col): (2, 8)	  #Neighbors:   3     (11, -) (12, -) (18, -) 
ID:  14 (Z, 0)           (Qubit, Col): (0, 8)	  #Neighbors:   3     (1, -) (10, -) (15, -) 
ID:  15 (X, 0)           (Qubit, Col): (3, 8)	  #Neighbors:   3     (6, -) (14, -) (17, -) 
ID:  16 (Z, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (3, -) (12, -) (17, -) 
ID:  17 (X, 0)           (Qubit, Col): (3, 10)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 (Z, 0)           (Qubit, Col): (2, 12)	  #Neighbors:   3     (5, -) (13, -) (19, -) 
ID:  19 (X, 0)           (Qubit, Col): (3, 12)	  #Neighbors:   3     (7, -) (17, -) (18, -) 
Total #Vertices: 20


qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgp -v

ID:   0 (Z, 0)           (Qubit, Col): (0, 13)	  #Neighbors:   2     (8, -) (20, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (14, -) 
ID:   2 (Z, 0)           (Qubit, Col): (1, 13)	  #Neighbors:   2     (9, -) (22, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (16, -) 
ID:   4 (Z, 0)           (Qubit, Col): (2, 13)	  #Neighbors:   2     (11, -) (24, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (18, -) 
ID:   6 (Z, 0)           (Qubit, Col): (3, 13)	  #Neighbors:   2     (15, -) (26, -) 
ID:   7 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (19, -) 
ID:   8 (Z, 0)           (Qubit, Col): (0, 9)	  #Neighbors:   3     (0, -) (9, -) (10, -) 
ID:   9 (X, 0)           (Qubit, Col): (1, 9)	  #Neighbors:   3     (2, -) (8, -) (12, -) 
ID:  10 (Z, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   3     (8, -) (11, -) (14, -) 
ID:  11 (X, 0)           (Qubit, Col): (2, 7)	  #Neighbors:   3     (4, -) (10, -) (13, -) 
ID:  12 (Z, 0)           (Qubit, Col): (1, 5)	  #Neighbors:   3     (9, -) (13, -) (16, -) 
ID:  13 (X, 0)           (Qubit, Col): (2, 5)	  #Neighbors:   3     (11, -) (12, -) (18, -) 
ID:  14 (Z, 0)           (Qubit, Col): (0, 5)	  #Neighbors:   3     (1, -) (10, -) (15, -) 
ID:  15 (X, 0)           (Qubit, Col): (3, 5)	  #Neighbors:   3     (6, -) (14, -) (17, -) 
ID:  16 (Z, 0)           (Qubit, Col): (1, 3)	  #Neighbors:   3     (3, -) (12, -) (17, -) 
ID:  17 (X, 0)           (Qubit, Col): (3, 3)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 (Z, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (5, -) (13, -) (19, -) 
ID:  19 (X, 0)           (Qubit, Col): (3, 1)	  #Neighbors:   3     (7, -) (17, -) (18, -) 
ID:  20 (Z, 0)           (Qubit, Col): (0, 14)	  #Neighbors:   2     (0, -) (28, -) 
ID:  21 (●, 0)           (Qubit, Col): (0, 27)	  #Neighbors:   1     (34, -) 
ID:  22 (Z, 0)           (Qubit, Col): (1, 14)	  #Neighbors:   2     (2, -) (29, -) 
ID:  23 (●, 0)           (Qubit, Col): (1, 27)	  #Neighbors:   1     (36, -) 
ID:  24 (Z, 0)           (Qubit, Col): (2, 14)	  #Neighbors:   2     (4, -) (31, -) 
ID:  25 (●, 0)           (Qubit, Col): (2, 27)	  #Neighbors:   1     (38, -) 
ID:  26 (Z, 0)           (Qubit, Col): (3, 14)	  #Neighbors:   2     (6, -) (35, -) 
ID:  27 (●, 0)           (Qubit, Col): (3, 27)	  #Neighbors:   1     (39, -) 
ID:  28 (Z, 0)           (Qubit, Col): (0, 18)	  #Neighbors:   3     (20, -) (29, -) (30, -) 
ID:  29 (X, 0)           (Qubit, Col): (1, 18)	  #Neighbors:   3     (22, -) (28, -) (32, -) 
ID:  30 (Z, 0)           (Qubit, Col): (0, 20)	  #Neighbors:   3     (28, -) (31, -) (34, -) 
ID:  31 (X, 0)           (Qubit, Col): (2, 20)	  #Neighbors:   3     (24, -) (30, -) (33, -) 
ID:  32 (Z, 0)           (Qubit, Col): (1, 22)	  #Neighbors:   3     (29, -) (33, -) (36, -) 
ID:  33 (X, 0)           (Qubit, Col): (2, 22)	  #Neighbors:   3     (31, -) (32, -) (38, -) 
ID:  34 (Z, 0)           (Qubit, Col): (0, 22)	  #Neighbors:   3     (21, -) (30, -) (35, -) 
ID:  35 (X, 0)           (Qubit, Col): (3, 22)	  #Neighbors:   3     (26, -) (34, -) (37, -) 
ID:  36 (Z, 0)           (Qubit, Col): (1, 24)	  #Neighbors:   3     (23, -) (32, -) (37, -) 
ID:  37 (X, 0)           (Qubit, Col): (3, 24)	  #Neighbors:   3     (35, -) (36, -) (39, -) 
ID:  38 (Z, 0)           (Qubit, Col): (2, 26)	  #Neighbors:   3     (25, -) (33, -) (39, -) 
ID:  39 (X, 0)           (Qubit, Col): (3, 26)	  #Neighbors:   3     (27, -) (37, -) (38, -) 
Total #Vertices: 40


qsyn> zxgs -fr

All rules applied in order:
Spider Fusion Rule            5 iterations.
  1) 8 matches
  2) 5 matches
  3) 2 matches
  4) 2 matches
  5) 1 matches
Identity Removal Rule         1 iterations.
  1) 3 matches
Spider Fusion Rule            1 iterations.
  1) 3 matches
Pivot Rule                    2 iterations.
  1) 1 matches
  2) 1 matches
Identity Removal Rule         2 iterations.
  1) 4 matches
  2) 2 matches

qsyn> zxgp -v

ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (21, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (23, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (25, -) 
ID:   7 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (27, -) 
ID:  21 (●, 0)           (Qubit, Col): (0, 27)	  #Neighbors:   1     (1, -) 
ID:  23 (●, 0)           (Qubit, Col): (1, 27)	  #Neighbors:   1     (3, -) 
ID:  25 (●, 0)           (Qubit, Col): (2, 27)	  #Neighbors:   1     (5, -) 
ID:  27 (●, 0)           (Qubit, Col): (3, 27)	  #Neighbors:   1     (7, -) 
Total #Vertices: 8


qsyn> qcr

qsyn> zxr

qsyn> qccp -q
[Error] QCir list is empty. Please create a QCir first!!

qsyn> qcga cx 0 1
[Error] QCir list is empty. Please create a QCir first!!

qsyn> qcba
Note: QCir list is empty now. Create a new one.

qsyn> qccp -q
Q 0  

qsyn> qcga h
Error: too few qubits are supplied for gate h!!

qsyn> qcga h 0

qsyn> qccp -q
Q 0  - h( 0)-

qsyn> qcga cx 0 1
[Error] Qubit ID 1 does not exist!!

qsyn> qcba 3

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  
Q 2  
Q 3  

qsyn> qcga cx 0 2

qsyn> qccp -q
Q 0  - h( 0)----------cx( 1)-
Q 1  
Q 2  -----------------cx( 1)-
Q 3  

qsyn> qcga cx 1 3

qsyn> qccp -q
Q 0  - h( 0)----------cx( 1)-
Q 1  ---------cx( 2)-
Q 2  -----------------cx( 1)-
Q 3  ---------cx( 2)-

qsyn> qcga t 2

qsyn> qcga cx 2 1

qsyn> qcga x 3

qsyn> qcga t 3

qsyn> qcga cx 3 2

qsyn> qcga cx 0 1

qsyn> qccp -q
Q 0  - h( 0)----------cx( 1)----------------------------------cx( 8)-
Q 1  ---------cx( 2)--------------------------cx( 4)----------cx( 8)-
Q 2  -----------------cx( 1)-- t( 3)----------cx( 4)----------cx( 7)-
Q 3  ---------cx( 2)-- x( 5)-- t( 6)--------------------------cx( 7)-

qsyn> qcga -pr rz -ph 0.00001 0

qsyn> qcga -pr rz -ph 1.2345 0

qsyn> qcgp 10
          ┌────┐ 
Q0 Start ─┤ RZ ├─ G9
          └────┘ 
Rotate Phase: 112π/285

qsyn> qcgp 9 -t
        ┌────┐ 
Q0 G10 ─┤ RZ ├─ G0
        └────┘ 
Rotate Phase: 0
Execute at t= 2

qsyn> qccp -q
Q 0  -rz(10)--rz( 9)-- h( 0)----------cx( 1)----------------------------------cx( 8)-
Q 1  ---------cx( 2)------------------------------------------cx( 4)----------cx( 8)-
Q 2  ---------------------------------cx( 1)-- t( 3)----------cx( 4)----------cx( 7)-
Q 3  ---------cx( 2)-- x( 5)-- t( 6)------------------------------------------cx( 7)-

qsyn> qcgd 2

qsyn> qcgd 4

qsyn> qcgd 8

qsyn> qcgd 7

qsyn> qcbd 1

qsyn> qccp -q
Q 0  -rz(10)--rz( 9)-- h( 0)----------cx( 1)-
Q 2  ---------------------------------cx( 1)-- t( 3)-
Q 3  - x( 5)-- t( 6)-

qsyn> qccop

qsyn> qcba

qsyn> qccp -q
Q 0  -rz(10)--rz( 9)-- h( 0)----------cx( 1)-
Q 2  ---------------------------------cx( 1)-- t( 3)-
Q 3  - x( 5)-- t( 6)-
Q 4  

qsyn> qcga -pr cx 0 4

qsyn> qcga cx 2 4

qsyn> qcga -pr rz -ph 1.2345 0

qsyn> qccp -q
Q 0  -rz(13)----------cx(11)--rz(10)--rz( 9)-- h( 0)----------cx( 1)-
Q 2  ---------------------------------------------------------cx( 1)-- t( 3)----------cx(12)-
Q 3  - x( 5)-- t( 6)-
Q 4  -----------------cx(11)----------------------------------------------------------cx(12)-

qsyn> qc2zx

qsyn> zxgp
Graph (4 inputs, 4 outputs, 21 vertices, 20 edges)

qsyn> qq -f

