DV Lab, NTUEE, Qsyn 0.4.2
qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxnew 10
Create and checkout to Graph 10

qsyn> zxge -addi 0
Add vertex (●) 0

qsyn> zxge -addo 0
Add vertex (●) 1

qsyn> zxge -addi 1
Add vertex (●) 2

qsyn> zxge -addo 1
Add vertex (●) 3

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m) 4

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 5

qsyn> zxge -addv 1 X
Add vertex ([1m[31mX[0m[0m) 6

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m) 7

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 8

qsyn> zxge -addv 1 Z
Add vertex ([1m[32mZ[0m[0m) 9

qsyn> zxge -adde 5 7 SIMPLE
Add edge (5, 7)

qsyn> zxge -adde 0 4 SIMPLE
Add edge (0, 4)

qsyn> zxge -adde 1 8 SIMPLE
Add edge (1, 8)

qsyn> zxge -adde 2 6 SIMPLE
Add edge (2, 6)

qsyn> zxge -adde 3 9 SIMPLE
Add edge (3, 9)

qsyn> zxge -adde 4 5 SIMPLE
Add edge (4, 5)

qsyn> zxge -adde 5 6 SIMPLE
Add edge (5, 6)

qsyn> zxge -adde 7 8 SIMPLE
Add edge (7, 8)

qsyn> zxge -adde 7 9 SIMPLE
Add edge (7, 9)

qsyn> zxgsimp -bia
Hadamard Rule                 
=> 0 iterations.

Bialgebra Rule                
=> 0 iterations.


qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (6, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   4 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (5, -) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (4, -) (6, -) (7, -) 
ID:   6 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (2, -) (5, -) 
ID:   7 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (5, -) (8, -) (9, -) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (1, -) (7, -) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (3, -) (7, -) 
Total #Vertices: 10


qsyn> zxgp -e
( 0, 4 )	Type:	-
( 1, 8 )	Type:	-
( 2, 6 )	Type:	-
( 3, 9 )	Type:	-
( 4, 5 )	Type:	-
( 5, 7 )	Type:	-
( 5, 6 )	Type:	-
( 7, 8 )	Type:	-
( 7, 9 )	Type:	-
Total #Edges: 9

qsyn> zxr

qsyn> zxnew 
Create and checkout to Graph 0

qsyn> zxge -addi 0
Add vertex (●) 0

qsyn> zxge -addo 0
Add vertex (●) 1

qsyn> zxge -addi 1
Add vertex (●) 2

qsyn> zxge -addo 1
Add vertex (●) 3

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m) 4

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 5

qsyn> zxge -addv 1 X
Add vertex ([1m[31mX[0m[0m) 6

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m) 7

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 8

qsyn> zxge -addv 1 Z
Add vertex ([1m[32mZ[0m[0m) 9

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m) 10

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 11

qsyn> zxge -addv 1 X
Add vertex ([1m[31mX[0m[0m) 12

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m) 13

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 14

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 15

qsyn> zxge -adde 0 4 SIMPLE
Add edge (0, 4)

qsyn> zxge -adde 1 14 SIMPLE
Add edge (1, 14)

qsyn> zxge -adde 2 6 SIMPLE
Add edge (2, 6)

qsyn> zxge -adde 3 15 SIMPLE
Add edge (3, 15)

qsyn> zxge -adde 4 5 SIMPLE
Add edge (4, 5)

qsyn> zxge -adde 5 7 SIMPLE
Add edge (5, 7)

qsyn> zxge -adde 5 6 SIMPLE
Add edge (5, 6)

qsyn> zxge -adde 7 8 SIMPLE
Add edge (7, 8)

qsyn> zxge -adde 7 9 SIMPLE
Add edge (7, 9)

qsyn> zxge -adde 8 10 SIMPLE
Add edge (8, 10)

qsyn> zxge -adde 10 9 SIMPLE
Add edge (9, 10)

qsyn> zxge -adde 10 11 SIMPLE
Add edge (10, 11)

qsyn> zxge -adde 11 12 SIMPLE
Add edge (11, 12)

qsyn> zxge -adde 11 13 SIMPLE
Add edge (11, 13)

qsyn> zxge -adde 14 13 SIMPLE
Add edge (13, 14)

qsyn> zxge -adde 12 15 SIMPLE
Add edge (12, 15)

qsyn> zxgsimp -bia
Hadamard Rule                 
=> 0 iterations.

Bialgebra Rule                
=> 0 iterations.


qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (14, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (6, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (15, -) 
ID:   4 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (5, -) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (4, -) (6, -) (7, -) 
ID:   6 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (2, -) (5, -) 
ID:   7 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (5, -) (8, -) (9, -) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (7, -) (10, -) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (7, -) (10, -) 
ID:  10 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (8, -) (9, -) (11, -) 
ID:  11 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (10, -) (12, -) (13, -) 
ID:  12 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (11, -) (15, -) 
ID:  13 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (11, -) (14, -) 
ID:  14 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (1, -) (13, -) 
ID:  15 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (3, -) (12, -) 
Total #Vertices: 16


qsyn> zxgprint -e
( 0, 4 )	Type:	-
( 1, 14 )	Type:	-
( 2, 6 )	Type:	-
( 3, 15 )	Type:	-
( 4, 5 )	Type:	-
( 5, 7 )	Type:	-
( 5, 6 )	Type:	-
( 7, 8 )	Type:	-
( 7, 9 )	Type:	-
( 8, 10 )	Type:	-
( 9, 10 )	Type:	-
( 10, 11 )	Type:	-
( 11, 12 )	Type:	-
( 11, 13 )	Type:	-
( 12, 15 )	Type:	-
( 13, 14 )	Type:	-
Total #Edges: 16

qsyn> zx2ts
Traverse and build the tensor... 
Topological order from first input: 0 4 5 7 9 10 8 11 12 15 3 13 14 1 6 2 
Size of topological order: 16
> Mapping vertex 0 (●): New Subgraph
  - Current frontiers: 
    0--4 (-) axis id: 1
> Mapping vertex 4 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    4--5 (-) axis id: 1
> Mapping vertex 5 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    5--7 (-) axis id: 1
    5--6 (-) axis id: 2
> Mapping vertex 7 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    5--6 (-) axis id: 1
    7--8 (-) axis id: 2
    7--9 (-) axis id: 3
> Mapping vertex 9 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    5--6 (-) axis id: 1
    7--8 (-) axis id: 2
    9--10 (-) axis id: 3
> Mapping vertex 10 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    5--6 (-) axis id: 1
    7--8 (-) axis id: 2
    8--10 (-) axis id: 3
    10--11 (-) axis id: 4
> Mapping vertex 8 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    5--6 (-) axis id: 1
    10--11 (-) axis id: 2
> Mapping vertex 11 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    5--6 (-) axis id: 1
    11--12 (-) axis id: 2
    11--13 (-) axis id: 3
> Mapping vertex 12 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    5--6 (-) axis id: 1
    11--13 (-) axis id: 2
    12--15 (-) axis id: 3
> Mapping vertex 15 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    5--6 (-) axis id: 1
    11--13 (-) axis id: 2
    3--15 (-) axis id: 3
> Mapping vertex 3 (●): Boundary Node
  - Current frontiers: 
    5--6 (-) axis id: 1
    11--13 (-) axis id: 2
    3--15 (-) axis id: 3
> Mapping vertex 13 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    5--6 (-) axis id: 1
    3--15 (-) axis id: 2
    13--14 (-) axis id: 3
> Mapping vertex 14 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    5--6 (-) axis id: 1
    3--15 (-) axis id: 2
    1--14 (-) axis id: 3
> Mapping vertex 1 (●): Boundary Node
  - Current frontiers: 
    5--6 (-) axis id: 1
    3--15 (-) axis id: 2
    1--14 (-) axis id: 3
> Mapping vertex 6 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    3--15 (-) axis id: 1
    1--14 (-) axis id: 2
    2--6 (-) axis id: 3
> Mapping vertex 2 (●): Boundary Node
  - Current frontiers: 
    3--15 (-) axis id: 1
    1--14 (-) axis id: 2
    2--6 (-) axis id: 3
Successfully added Tensor 0
Input  axis ids: 0 3
Output axis ids: 2 1
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 2.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  2.      +0.i}}
#Dim:    2	Info: ZX 0

qsyn> zxr

qsyn> zxnew 
Create and checkout to Graph 0

qsyn> zxge -addi 0
Add vertex (●) 0

qsyn> zxge -addo 0
Add vertex (●) 1

qsyn> zxge -addi 1
Add vertex (●) 2

qsyn> zxge -addo 1
Add vertex (●) 3

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m) 4

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 5

qsyn> zxge -addv 1 X
Add vertex ([1m[31mX[0m[0m) 6

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m) 7

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 8

qsyn> zxge -addv 1 Z
Add vertex ([1m[32mZ[0m[0m) 9

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m) 10

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 11

qsyn> zxge -addv 1 X
Add vertex ([1m[31mX[0m[0m) 12

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m) 13

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 14

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m) 15

qsyn> zxge -adde 0 4 SIMPLE
Add edge (0, 4)

qsyn> zxge -adde 1 14 HADAMARD
Add edge (1, 14)

qsyn> zxge -adde 2 6 SIMPLE
Add edge (2, 6)

qsyn> zxge -adde 3 15 SIMPLE
Add edge (3, 15)

qsyn> zxge -adde 4 5 SIMPLE
Add edge (4, 5)

qsyn> zxge -adde 5 7 SIMPLE
Add edge (5, 7)

qsyn> zxge -adde 5 6 HADAMARD
Add edge (5, 6)

qsyn> zxge -adde 7 8 SIMPLE
Add edge (7, 8)

qsyn> zxge -adde 7 9 SIMPLE
Add edge (7, 9)

qsyn> zxge -adde 8 10 HADAMARD
Add edge (8, 10)

qsyn> zxge -adde 10 9 SIMPLE
Add edge (9, 10)

qsyn> zxge -adde 10 11 SIMPLE
Add edge (10, 11)

qsyn> zxge -adde 11 12 HADAMARD
Add edge (11, 12)

qsyn> zxge -adde 11 13 HADAMARD
Add edge (11, 13)

qsyn> zxge -adde 14 13 SIMPLE
Add edge (13, 14)

qsyn> zxge -adde 12 15 SIMPLE
Add edge (12, 15)

qsyn> zxgsimp -bia
Hadamard Rule                 
=> 0 iterations.

Bialgebra Rule                
=> 0 iterations.


qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (14, [1m[34mH[0m[0m) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (6, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (15, -) 
ID:   4 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (5, -) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (4, -) (6, [1m[34mH[0m[0m) (7, -) 
ID:   6 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (2, -) (5, [1m[34mH[0m[0m) 
ID:   7 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (5, -) (8, -) (9, -) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (7, -) (10, [1m[34mH[0m[0m) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (7, -) (10, -) 
ID:  10 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (8, [1m[34mH[0m[0m) (9, -) (11, -) 
ID:  11 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (10, -) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 
ID:  12 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (11, [1m[34mH[0m[0m) (15, -) 
ID:  13 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (11, [1m[34mH[0m[0m) (14, -) 
ID:  14 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (1, [1m[34mH[0m[0m) (13, -) 
ID:  15 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (3, -) (12, -) 
Total #Vertices: 16


qsyn> zxgp -e
( 0, 4 )	Type:	-
( 1, 14 )	Type:	[1m[34mH[0m[0m
( 2, 6 )	Type:	-
( 3, 15 )	Type:	-
( 4, 5 )	Type:	-
( 5, 7 )	Type:	-
( 5, 6 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	-
( 7, 9 )	Type:	-
( 8, 10 )	Type:	[1m[34mH[0m[0m
( 9, 10 )	Type:	-
( 10, 11 )	Type:	-
( 11, 12 )	Type:	[1m[34mH[0m[0m
( 11, 13 )	Type:	[1m[34mH[0m[0m
( 12, 15 )	Type:	-
( 13, 14 )	Type:	-
Total #Edges: 16

qsyn> qq -f

