DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxnew 10
Successfully generated Graph 10
Checkout to Graph 10

qsyn> zxge -addi 0
Add vertex (â—)0

qsyn> zxge -addo 0
Add vertex (â—)1

qsyn> zxge -addi 1
Add vertex (â—)2

qsyn> zxge -addo 1
Add vertex (â—)3

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m)4

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m)5

qsyn> zxge -addv 1 X
Add vertex ([1m[31mX[0m[0m)6

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m)7

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m)8

qsyn> zxge -addv 1 Z
Add vertex ([1m[32mZ[0m[0m)9

qsyn> zxge -adde 5 7 SIMPLE
Add edge ( 5, 7 )

qsyn> zxge -adde 0 4 SIMPLE
Add edge ( 0, 4 )

qsyn> zxge -adde 1 8 SIMPLE
Add edge ( 1, 8 )

qsyn> zxge -adde 2 6 SIMPLE
Add edge ( 2, 6 )

qsyn> zxge -adde 3 9 SIMPLE
Add edge ( 3, 9 )

qsyn> zxge -adde 4 5 SIMPLE
Add edge ( 4, 5 )

qsyn> zxge -adde 5 6 SIMPLE
Add edge ( 5, 6 )

qsyn> zxge -adde 7 8 SIMPLE
Add edge ( 7, 8 )

qsyn> zxge -adde 7 9 SIMPLE
Add edge ( 7, 9 )

qsyn> zxgsimp -bia

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (6, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   4 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (5, -) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (4, -) (6, -) (7, -) 
ID:   6 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (2, -) (5, -) 
ID:   7 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (5, -) (8, -) (9, -) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (1, -) (7, -) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (3, -) (7, -) 
Total #Vertices: 10

Bialgebra Rule: 

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (6, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   4 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (5, -) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (4, -) (6, -) (7, -) 
ID:   6 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (2, -) (5, -) 
ID:   7 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (5, -) (8, -) (9, -) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (1, -) (7, -) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   2     (3, -) (7, -) 
Total #Vertices: 10

Found 1 match(es)
Add edge ( 4, 8 )
Add edge ( 4, 9 )
Add edge ( 6, 8 )
Add edge ( 6, 9 )
Remove ID: 5
Remove ID: 7

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (6, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   4 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (0, -) (8, -) (9, -) 
ID:   6 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   3     (2, -) (8, -) (9, -) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (1, -) (4, -) (6, -) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   3     (3, -) (4, -) (6, -) 
Total #Vertices: 8

1 iterations


ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (6, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   4 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (0, -) (8, -) (9, -) 
ID:   6 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   3     (2, -) (8, -) (9, -) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (1, -) (4, -) (6, -) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   3     (3, -) (4, -) (6, -) 
Total #Vertices: 8


qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (6, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   4 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (0, -) (8, -) (9, -) 
ID:   6 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   3     (2, -) (8, -) (9, -) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (1, -) (4, -) (6, -) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   3     (3, -) (4, -) (6, -) 
Total #Vertices: 8


qsyn> zxgp -e
( 0, 4 )	Type:	-
( 1, 8 )	Type:	-
( 2, 6 )	Type:	-
( 3, 9 )	Type:	-
( 4, 8 )	Type:	-
( 4, 9 )	Type:	-
( 6, 8 )	Type:	-
( 6, 9 )	Type:	-
Total #Edges: 8

qsyn> qq -f

