DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxmode -on
ZXMODE turn ON!

qsyn> zxnew 
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxge -addi 0
Add vertex (●)0

qsyn> zxge -addo 0
Add vertex (●)1

qsyn> zxge -addi 1
Add vertex (●)2

qsyn> zxge -addo 1
Add vertex (●)3

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m)4

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m)5

qsyn> zxge -addv 1 X
Add vertex ([1m[31mX[0m[0m)6

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m)7

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m)8

qsyn> zxge -addv 1 Z
Add vertex ([1m[32mZ[0m[0m)9

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m)10

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m)11

qsyn> zxge -addv 1 X
Add vertex ([1m[31mX[0m[0m)12

qsyn> zxge -addv 0 X
Add vertex ([1m[31mX[0m[0m)13

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m)14

qsyn> zxge -addv 0 Z
Add vertex ([1m[32mZ[0m[0m)15

qsyn> zxge -adde 0 4 SIMPLE
Add edge ( 0, 4 )

qsyn> zxge -adde 1 14 SIMPLE
Add edge ( 1, 14 )

qsyn> zxge -adde 2 6 SIMPLE
Add edge ( 2, 6 )

qsyn> zxge -adde 3 15 SIMPLE
Add edge ( 3, 15 )

qsyn> zxge -adde 4 5 SIMPLE
Add edge ( 4, 5 )

qsyn> zxge -adde 5 7 SIMPLE
Add edge ( 5, 7 )

qsyn> zxge -adde 5 6 SIMPLE
Add edge ( 5, 6 )

qsyn> zxge -adde 7 8 SIMPLE
Add edge ( 7, 8 )

qsyn> zxge -adde 7 9 SIMPLE
Add edge ( 7, 9 )

qsyn> zxge -adde 8 10 SIMPLE
Add edge ( 8, 10 )

qsyn> zxge -adde 10 9 SIMPLE
Add edge ( 10, 9 )

qsyn> zxge -adde 10 11 SIMPLE
Add edge ( 10, 11 )

qsyn> zxge -adde 11 12 SIMPLE
Add edge ( 11, 12 )

qsyn> zxge -adde 11 13 SIMPLE
Add edge ( 11, 13 )

qsyn> zxge -adde 14 13 SIMPLE
Add edge ( 14, 13 )

qsyn> zxge -adde 12 15 SIMPLE
Add edge ( 12, 15 )

qsyn> zxgsimp -bia

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	4	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (5, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(4, -) (6, -) (7, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(2, -) (5, -) 
ID:	7	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(5, -) (8, -) (9, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(7, -) (10, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(7, -) (10, -) 
ID:	10	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(8, -) (9, -) (11, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(10, -) (12, -) (13, -) 
ID:	12	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(11, -) (15, -) 
ID:	13	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(11, -) (14, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, -) (13, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(3, -) (12, -) 
Total #Vertices: 16

Bialgebra Rule: 

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	4	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (5, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(4, -) (6, -) (7, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(2, -) (5, -) 
ID:	7	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(5, -) (8, -) (9, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(7, -) (10, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(7, -) (10, -) 
ID:	10	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(8, -) (9, -) (11, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(10, -) (12, -) (13, -) 
ID:	12	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(11, -) (15, -) 
ID:	13	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(11, -) (14, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, -) (13, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(3, -) (12, -) 
Total #Vertices: 16

Found 2 match(es)
Add edge ( 4, 8 )
Add edge ( 4, 9 )
Add edge ( 6, 8 )
Add edge ( 6, 9 )
Add edge ( 8, 12 )
Add edge ( 8, 13 )
Add edge ( 9, 12 )
Add edge ( 9, 13 )
Remove ID: 5
Remove ID: 7
Remove ID: 10
Remove ID: 11

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	4	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (8, -) (9, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(2, -) (8, -) (9, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(4, -) (6, -) (12, -) (13, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	4	(4, -) (6, -) (12, -) (13, -) 
ID:	12	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(8, -) (9, -) (15, -) 
ID:	13	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(8, -) (9, -) (14, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, -) (13, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(3, -) (12, -) 
Total #Vertices: 12

Found 1 match(es)
Add edge ( 4, 15 )
Note: Hopf edge; cancelling out with existing edge...
Add edge ( 6, 15 )
Note: Hopf edge; cancelling out with existing edge...
Add edge ( 13, 15 )
Note: Hopf edge; cancelling out with existing edge...
Remove ID: 8
Remove ID: 12
Remove ID: 9

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	4	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (15, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(2, -) (15, -) 
ID:	13	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(14, -) (15, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, -) (13, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(3, -) (4, -) (6, -) (13, -) 
Total #Vertices: 9

2 iterations


ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	4	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (15, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(2, -) (15, -) 
ID:	13	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(14, -) (15, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, -) (13, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(3, -) (4, -) (6, -) (13, -) 
Total #Vertices: 9


qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	4	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (15, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(2, -) (15, -) 
ID:	13	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(14, -) (15, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, -) (13, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(3, -) (4, -) (6, -) (13, -) 
Total #Vertices: 9


qsyn> zxgprint -e
( 0, 4 )	Type:	-
( 1, 14 )	Type:	-
( 2, 6 )	Type:	-
( 3, 15 )	Type:	-
( 4, 15 )	Type:	-
( 6, 15 )	Type:	-
( 13, 14 )	Type:	-
( 13, 15 )	Type:	-
Total #Edges: 8

qsyn> zx2ts
Traverse and build the tensor... 
Topological order from first input: 0 4 15 13 14 1 6 2 3 
Size of topological order: 9
> Mapping vertex 0 (●): New Subgraph
  - Current frontiers: 
    0--4 (-) axis id: 1
> Mapping vertex 4 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    4--15 (-) axis id: 1
> Mapping vertex 15 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    3--15 (-) axis id: 1
    6--15 (-) axis id: 2
    13--15 (-) axis id: 3
> Mapping vertex 13 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    3--15 (-) axis id: 1
    6--15 (-) axis id: 2
    13--14 (-) axis id: 3
> Mapping vertex 14 ([1m[32mZ[0m[0m): Tensordot
  - Current frontiers: 
    3--15 (-) axis id: 1
    6--15 (-) axis id: 2
    1--14 (-) axis id: 3
> Mapping vertex 1 (●): Boundary Node
  - Current frontiers: 
    3--15 (-) axis id: 1
    6--15 (-) axis id: 2
    1--14 (-) axis id: 3
> Mapping vertex 6 ([1m[31mX[0m[0m): Tensordot
  - Current frontiers: 
    3--15 (-) axis id: 1
    1--14 (-) axis id: 2
    2--6 (-) axis id: 3
> Mapping vertex 2 (●): Boundary Node
  - Current frontiers: 
    3--15 (-) axis id: 1
    1--14 (-) axis id: 2
    2--6 (-) axis id: 3
> Mapping vertex 3 (●): Boundary Node
  - Current frontiers: 
    3--15 (-) axis id: 1
    1--14 (-) axis id: 2
    2--6 (-) axis id: 3
Successfully added Tensor 0
Input  axis ids: 0 3
Output axis ids: 2 1
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.414214+0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  1.414214+0.i}}
#Dim:    2	Info: ZX 0

qsyn> q -f

