qsyn> ver 2
Note: verbose level is set to 2

qsyn> qcba 2

qsyn> qcga -cx 0 1

qsyn> qcga -cx 1 0

qsyn> qcga -cx 0 1

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qczxm

qsyn> ver 7
Note: verbose level is set to 7

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Topological order from first input: 
0 4 7 8 9 6 5 2 3 1 
Size of topological order: 10
> Mapping vertex 0 (â—): New Subgraph
  - Current frontiers: 
    0--4 (-) axis id: 1
> Mapping vertex 4 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    4--5 (-) axis id: 2
    4--7 (-) axis id: 1
> Mapping vertex 7 ([1;31mX[0m): Tensordot
  - Current frontiers: 
    4--5 (-) axis id: 1
    6--7 (-) axis id: 3
    7--8 (-) axis id: 2
> Mapping vertex 8 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    1--8 (-) axis id: 3
    4--5 (-) axis id: 1
    6--7 (-) axis id: 2
    8--9 (-) axis id: 4
> Mapping vertex 9 ([1;31mX[0m): Tensordot
  - Current frontiers: 
    1--8 (-) axis id: 3
    3--9 (-) axis id: 4
    4--5 (-) axis id: 1
    6--7 (-) axis id: 2
    6--9 (-) axis id: 5
> Mapping vertex 6 ([1;32mZ[0m): Tensordot
  - Current frontiers: 
    1--8 (-) axis id: 2
    3--9 (-) axis id: 3
    4--5 (-) axis id: 1
    5--6 (-) axis id: 4
> Mapping vertex 5 ([1;31mX[0m): Tensordot
  - Current frontiers: 
    1--8 (-) axis id: 1
    2--5 (-) axis id: 3
    3--9 (-) axis id: 2
> Mapping vertex 2 (â—): Boundary Node
  - Current frontiers: 
    1--8 (-) axis id: 1
    2--5 (-) axis id: 3
    3--9 (-) axis id: 2
> Mapping vertex 3 (â—): Boundary Node
  - Current frontiers: 
    1--8 (-) axis id: 1
    2--5 (-) axis id: 3
    3--9 (-) axis id: 2
> Mapping vertex 1 (â—): Boundary Node
  - Current frontiers: 
    1--8 (-) axis id: 1
    2--5 (-) axis id: 3
    3--9 (-) axis id: 2

The resulting tensor is: 
{{ 1.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  1.      +0.i,  0.      +0.i},
 { 0.      +0.i,  1.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  1.      +0.i}}

qsyn> q -f

