qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generate Graph 0
Checkout to Graph 0

qsyn> zxgedit -addi 0 0
Add input 0

qsyn> zxgedit -addv 1 0 Z 0
Add vertex 1

qsyn> zxgedit -addo 4 0
Add output 4

qsyn> zxgedit -addv 2 0 Z 0
Add vertex 2

qsyn> zxgedit -addv 3 0 Z 0
Add vertex 3

qsyn> zxgedit -adde 2 3 SIMPLE
Add edge ( 2, 3 )

qsyn> zxgedit -adde 1 2 SIMPLE
Add edge ( 1, 2 )

qsyn> zxgedit -adde 2 3 SIMPLE
Add edge ( 2, 3 )

qsyn> zxgedit -adde 2 3 SIMPLE
Add edge ( 2, 3 )

qsyn> zxgedit -adde 3 2 HADAMARD
Add edge ( 3, 2 )

qsyn> zxgedit -adde 3 2 SIMPLE
Add edge ( 3, 2 )

qsyn> zxgedit -adde 2 0 SIMPLE
Add edge ( 2, 0 )

qsyn> zxgedit -adde 3 1 SIMPLE
Add edge ( 3, 1 )

qsyn> zxgedit -adde 4 1 SIMPLE
Add edge ( 4, 1 )

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(2, -) (3, -) (4, -) 
ID:	4	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	7	(0, -) (1, -) (3, -) (3, [1m[34mH[0m[0m) (3, -) (3, -) (3, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	6	(1, -) (2, -) (2, [1m[34mH[0m[0m) (2, -) (2, -) (2, -) 
Total #Vertices: 5

qsyn> zxgp -e
( 2, 3 )	Type:	-
( 1, 2 )	Type:	-
( 2, 3 )	Type:	-
( 2, 3 )	Type:	-
( 3, 2 )	Type:	[1m[34mH[0m[0m
( 3, 2 )	Type:	-
( 2, 0 )	Type:	-
( 3, 1 )	Type:	-
( 4, 1 )	Type:	-
Total #Edges: 9

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
> Mapping vertex 0 (â—): New Subgraph
> Mapping vertex 2 ([1m[32mZ[0m[0m): Tensordot
> Mapping vertex 1 ([1m[32mZ[0m[0m): Tensordot
> Mapping vertex 4 (â—): Boundary Node
> Mapping vertex 3 ([1m[32mZ[0m[0m): Tensordot

The resulting tensor is: 
{{ 4.+0.i,  0.+0.i},
 { 0.+0.i, -4.+0.i}}

qsyn> zxgsimp -spi
Spider Fusion: 1 Add edge ( 2, 1 )
Add edge ( 2, 2 )
Remove ID: 3
. 1 Add edge ( 1, 2 )
Add edge ( 1, 2 )
Add edge ( 1, 0 )
Remove ID: 2
. 2 iterations

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(0, -) (4, -) 
ID:	4	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
Total #Vertices: 3

qsyn> zxgp -e
( 4, 1 )	Type:	-
( 1, 0 )	Type:	-
Total #Edges: 2

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
> Mapping vertex 0 (â—): New Subgraph
> Mapping vertex 1 ([1m[32mZ[0m[0m): Tensordot
> Mapping vertex 4 (â—): Boundary Node

The resulting tensor is: 
{{ 1.+0.000000e+00i,  0.+0.000000e+00i},
 { 0.+0.000000e+00i, -1.+1.224647e-16i}}

qsyn> q -f

