DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/pseudoSimp/tof2.qasm
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgas 1 I X pi

qsyn> zxgas 1 O X pi

qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> // tsp 0
qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (10, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (25, -) 
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 2)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, π)           (Qubit, Col): (2, 1)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (8, -) (13, -) (27, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (2, 1)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (2, 1)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (2, 1)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (1, 1)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (2, 1)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, π)           (Qubit, Col): (2, 1)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (0, 1)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (0, 1)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (1, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (24, -) (25, -) (28, -) 
ID:  27 ([1m[31mX[0m[0m, π)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (7, -) 
ID:  28 ([1m[31mX[0m[0m, π)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (26, -) 
Total #Vertices: 27


qsyn> zxgs -fr
Hadamard Rule: 2 . 1 iterations
Spider Fusion Rule: 
3 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
3 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Boundary Rule: 
No matches
Phase Gadget Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
2 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Boundary Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (10, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (10, -) 
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (19, [1m[34mH[0m[0m) 
ID:   5 (●, 0)           (Qubit, Col): (2, 2)	  #Neighbors:   1     (19, [1m[34mH[0m[0m) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (1, -) (19, [1m[34mH[0m[0m) 
ID:  19 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:  29 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (30, [1m[34mH[0m[0m) 
ID:  30 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (-1, 0)	  #Neighbors:   1     (29, [1m[34mH[0m[0m) 
Total #Vertices: 8


qsyn> zxgs -stco
State Copy Rule: 
1 iterations

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (10, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (10, -) 
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (19, [1m[34mH[0m[0m) 
ID:   5 (●, 0)           (Qubit, Col): (2, 2)	  #Neighbors:   1     (19, [1m[34mH[0m[0m) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (1, -) (19, [1m[34mH[0m[0m) 
ID:  19 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
Total #Vertices: 6


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> // tsp 1
qsyn> qccr -R benchmark/pseudoSimp/tof2.qasm
Note: original QCir is replaced...

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 1
Checkout to Graph 1

qsyn> zxgas 1 I X 0

qsyn> zxgas 1 O X 0

qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 2
Stored the resulting tensor as tensor id 2

qsyn> // tsp 2
qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (10, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (25, -) 
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 2)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, π)           (Qubit, Col): (2, 1)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (8, -) (13, -) (27, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (2, 1)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (2, 1)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (2, 1)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (1, 1)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (2, 1)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, π)           (Qubit, Col): (2, 1)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (0, 1)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (0, 1)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (1, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (24, -) (25, -) (28, -) 
ID:  27 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (7, -) 
ID:  28 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (26, -) 
Total #Vertices: 27


qsyn> zxgs -fr
Hadamard Rule: 2 . 1 iterations
Spider Fusion Rule: 
3 iterations
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
3 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Boundary Rule: 
No matches
Phase Gadget Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Boundary Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (1, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (0, -) 
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (5, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 2)	  #Neighbors:   1     (4, -) 
ID:  29 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (30, [1m[34mH[0m[0m) 
ID:  30 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   1     (29, [1m[34mH[0m[0m) 
Total #Vertices: 6


qsyn> zxgs -stco
State Copy Rule: 
1 iterations

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (1, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (0, -) 
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (5, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 2)	  #Neighbors:   1     (4, -) 
Total #Vertices: 4


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 3
Stored the resulting tensor as tensor id 3

qsyn> // tsp 3
qsyn> qccr -R benchmark/pseudoSimp/tof2.qasm
Note: original QCir is replaced...

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 2
Checkout to Graph 2

qsyn> zxgas 1 I X pi

qsyn> zxgas 1 O X pi

qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 4
Stored the resulting tensor as tensor id 4

qsyn> // tsp 4
qsyn> zxgp -v

ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 2)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, π)           (Qubit, Col): (2, 1)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (8, -) (13, -) (27, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (2, 1)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (11, -) (16, -) (29, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (2, 1)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (2, 1)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (1, 1)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (2, 1)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, π)           (Qubit, Col): (2, 1)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (0, 1)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (0, 1)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (23, -) (26, -) (30, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (24, -) (25, -) (28, -) 
ID:  27 ([1m[31mX[0m[0m, π)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (7, -) 
ID:  28 ([1m[31mX[0m[0m, π)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (26, -) 
ID:  29 ([1m[31mX[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (10, -) 
ID:  30 ([1m[31mX[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (25, -) 
Total #Vertices: 27


qsyn> zxgs -FR
Hadamard Rule: 2 . 1 iterations
Spider Fusion Rule: 
3 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
3 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Boundary Rule: 
No matches
Phase Gadget Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Boundary Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches

qsyn> // commenting due to output instability
qsyn> // zxgp -v
qsyn> zxgs -stco
State Copy Rule: 
1 iterations

qsyn> // commenting due to output instability
qsyn> // zxgp -v
qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 5
Stored the resulting tensor as tensor id 5

qsyn> tsp 5
{{ 0.      +6.123234e-17i,  1.      -6.123234e-17i},
 { 1.      -6.123234e-17i,  0.      +6.123234e-17i}}
#Dim:    2	Info: ZX 2

qsyn> qq -f

