DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> zxm -on
Illegal command!! (zxm)

qsyn> qccread benchmark/benchmark_SABRE/large/cm82a_208.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qc2zx

qsyn> zxgp
Graph 0( 16 inputs, 16 outputs, 965 vertices, 1232 edges )

qsyn> zxcopy

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgprint
Graph 1( 16 inputs, 16 outputs, 1930 vertices, 2480 edges )

qsyn> zxgs -fr
Spider Fusion Rule            4 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Pivot Gadget Rule             8 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            5 iteration(s)
Pivot Rule                    2 iteration(s)
Local Complementation Rule    20 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            13 iteration(s)
Pivot Rule                    1 iteration(s)
Local Complementation Rule    6 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            3 iteration(s)
Local Complementation Rule    2 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Phase Gadget Rule             1 iteration(s)
Pivot Rule                    1 iteration(s)
Local Complementation Rule    2 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    3 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Boundary Rule           1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         2 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         2 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         2 iteration(s)

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 32 vertices, 16 edges )

qsyn> zxgt -id
The graph is an identity!

qsyn> usage
Period time used : 0.07 seconds
Total time used  : 0.07 seconds
Total memory used: 4.828 M Bytes

qsyn> qq -f

