DV Lab, NTUEE, Qsyn 0.5.1
qsyn> zxgr benchmark/zx/cnot.zx

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxge -rme 2 3 SIMPLE

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   2     (0, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   2     (1, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxr

qsyn> zxgr benchmark/zx/cnot.zx

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxge -rmv 2

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   0     
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   2     (1, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   0     
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 5


qsyn> zxge -rmv -i
Note: removing isolated vertices...

qsyn> zxgp -v

ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   2     (1, -) (5, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 3


qsyn> zxr

qsyn> zxgr benchmark/zx/cnot.zx

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxge -rmv 1 2

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   0     
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   1     (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   0     
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 4


qsyn> zxr 

qsyn> zxnew

qsyn> zxge -addi 1

qsyn> zxge -addi 0

qsyn> zxge -addi 2

qsyn> zxge -addo 0

qsyn> zxge -addo 2

qsyn> zxge -addo 1

qsyn> zxgp -inputs
Input:  (0, 1, 2)
Total #Inputs: 3

qsyn> zxgp -o
Output: (3, 4, 5)
Total #Outputs: 3

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   0     
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   0     
ID:   2 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   0     
ID:   3 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   0     
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   0     
ID:   5 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   0     
Total #Vertices: 6


qsyn> zxr

qsyn> zxgr benchmark/zx/cnot.zx

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxge -rmv 0

qsyn> zxgp -v

ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   2     (3, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 5


qsyn> zxge -rme 2 3 SIMPLE

qsyn> zxgp -v 

ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   1     (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   2     (1, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 5


qsyn> zxge -addi 0

qsyn> zxgp -v

ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   1     (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   2     (1, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
ID:   6 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   0     
Total #Vertices: 6


qsyn> zxge -adde 6 2 SIMPLE

qsyn> zxge -adde 2 3 SIMPLE

qsyn> zxgp -v

ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (3, -) (4, -) (6, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
ID:   6 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
Total #Vertices: 6


qsyn> qq -f

