DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> format 0

qsyn> qccread ./benchmark/benchmark_SABRE/small/rd32-v1_68.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qc2zx

qsyn> zxgp -Q

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(13, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(35, -) 
ID:	13	VertexType:	Z	Qubit:	0	Phase:	π/4	#Neighbors:	2	(0, -) (14, -) 
ID:	14	VertexType:	Z	Qubit:	0	Phase:	0	#Neighbors:	3	(13, -) (15, -) (17, -) 
ID:	17	VertexType:	X	Qubit:	0	Phase:	0	#Neighbors:	3	(14, -) (16, -) (18, -) 
ID:	18	VertexType:	Z	Qubit:	0	Phase:	7π/4	#Neighbors:	2	(17, -) (23, -) 
ID:	23	VertexType:	X	Qubit:	0	Phase:	0	#Neighbors:	3	(18, -) (22, -) (24, -) 
ID:	24	VertexType:	Z	Qubit:	0	Phase:	7π/4	#Neighbors:	2	(23, -) (26, -) 
ID:	26	VertexType:	X	Qubit:	0	Phase:	0	#Neighbors:	3	(24, -) (25, -) (33, -) 
ID:	33	VertexType:	Z	Qubit:	0	Phase:	0	#Neighbors:	3	(26, -) (34, -) (35, -) 
ID:	35	VertexType:	Z	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (33, -) (36, -) 


ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(12, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(58, -) 
ID:	12	VertexType:	Z	Qubit:	1	Phase:	π/4	#Neighbors:	2	(2, -) (15, -) 
ID:	15	VertexType:	X	Qubit:	1	Phase:	0	#Neighbors:	3	(12, -) (14, -) (19, -) 
ID:	19	VertexType:	Z	Qubit:	1	Phase:	0	#Neighbors:	3	(15, -) (20, -) (22, -) 
ID:	22	VertexType:	Z	Qubit:	1	Phase:	0	#Neighbors:	3	(19, -) (23, -) (27, -) 
ID:	27	VertexType:	Z	Qubit:	1	Phase:	7π/4	#Neighbors:	2	(22, -) (28, -) 
ID:	28	VertexType:	Z	Qubit:	1	Phase:	0	#Neighbors:	3	(27, -) (29, -) (34, -) 
ID:	34	VertexType:	X	Qubit:	1	Phase:	0	#Neighbors:	3	(28, -) (33, -) (36, -) 
ID:	36	VertexType:	X	Qubit:	1	Phase:	0	#Neighbors:	3	(34, -) (35, -) (37, -) 
ID:	37	VertexType:	Z	Qubit:	1	Phase:	π/4	#Neighbors:	2	(36, -) (38, -) 
ID:	38	VertexType:	Z	Qubit:	1	Phase:	0	#Neighbors:	3	(37, -) (39, -) (41, -) 
ID:	41	VertexType:	X	Qubit:	1	Phase:	0	#Neighbors:	3	(38, -) (40, -) (42, -) 
ID:	42	VertexType:	Z	Qubit:	1	Phase:	7π/4	#Neighbors:	2	(41, -) (47, -) 
ID:	47	VertexType:	X	Qubit:	1	Phase:	0	#Neighbors:	3	(42, -) (46, -) (48, -) 
ID:	48	VertexType:	Z	Qubit:	1	Phase:	7π/4	#Neighbors:	2	(47, -) (50, -) 
ID:	50	VertexType:	X	Qubit:	1	Phase:	0	#Neighbors:	3	(48, -) (49, -) (56, -) 
ID:	56	VertexType:	Z	Qubit:	1	Phase:	0	#Neighbors:	3	(50, -) (57, -) (58, -) 
ID:	58	VertexType:	Z	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (56, -) (59, -) 


ID:	4	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(11, -) 
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(59, -) 
ID:	11	VertexType:	Z	Qubit:	2	Phase:	π/4	#Neighbors:	2	(4, -) (39, -) 
ID:	39	VertexType:	X	Qubit:	2	Phase:	0	#Neighbors:	3	(11, -) (38, -) (43, -) 
ID:	43	VertexType:	Z	Qubit:	2	Phase:	0	#Neighbors:	3	(39, -) (44, -) (46, -) 
ID:	46	VertexType:	Z	Qubit:	2	Phase:	0	#Neighbors:	3	(43, -) (47, -) (51, -) 
ID:	51	VertexType:	Z	Qubit:	2	Phase:	7π/4	#Neighbors:	2	(46, -) (52, -) 
ID:	52	VertexType:	Z	Qubit:	2	Phase:	0	#Neighbors:	3	(51, -) (53, -) (57, -) 
ID:	57	VertexType:	X	Qubit:	2	Phase:	0	#Neighbors:	3	(52, -) (56, -) (59, -) 
ID:	59	VertexType:	X	Qubit:	2	Phase:	0	#Neighbors:	3	(5, -) (57, -) (58, -) 


ID:	6	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(8, -) 
ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(55, -) 
ID:	8	VertexType:	X	Qubit:	3	Phase:	π	#Neighbors:	2	(6, -) (9, -) 
ID:	9	VertexType:	H	Qubit:	3	Phase:	π	#Neighbors:	2	(8, -) (10, -) 
ID:	10	VertexType:	Z	Qubit:	3	Phase:	π/4	#Neighbors:	2	(9, -) (16, -) 
ID:	16	VertexType:	Z	Qubit:	3	Phase:	0	#Neighbors:	3	(10, -) (17, -) (20, -) 
ID:	20	VertexType:	X	Qubit:	3	Phase:	0	#Neighbors:	3	(16, -) (19, -) (21, -) 
ID:	21	VertexType:	Z	Qubit:	3	Phase:	π/4	#Neighbors:	2	(20, -) (25, -) 
ID:	25	VertexType:	Z	Qubit:	3	Phase:	0	#Neighbors:	3	(21, -) (26, -) (29, -) 
ID:	29	VertexType:	X	Qubit:	3	Phase:	0	#Neighbors:	3	(25, -) (28, -) (30, -) 
ID:	30	VertexType:	H	Qubit:	3	Phase:	π	#Neighbors:	2	(29, -) (31, -) 
ID:	31	VertexType:	H	Qubit:	3	Phase:	π	#Neighbors:	2	(30, -) (32, -) 
ID:	32	VertexType:	Z	Qubit:	3	Phase:	π/4	#Neighbors:	2	(31, -) (40, -) 
ID:	40	VertexType:	Z	Qubit:	3	Phase:	0	#Neighbors:	3	(32, -) (41, -) (44, -) 
ID:	44	VertexType:	X	Qubit:	3	Phase:	0	#Neighbors:	3	(40, -) (43, -) (45, -) 
ID:	45	VertexType:	Z	Qubit:	3	Phase:	π/4	#Neighbors:	2	(44, -) (49, -) 
ID:	49	VertexType:	Z	Qubit:	3	Phase:	0	#Neighbors:	3	(45, -) (50, -) (53, -) 
ID:	53	VertexType:	X	Qubit:	3	Phase:	0	#Neighbors:	3	(49, -) (52, -) (54, -) 
ID:	54	VertexType:	H	Qubit:	3	Phase:	π	#Neighbors:	2	(53, -) (55, -) 
ID:	55	VertexType:	X	Qubit:	3	Phase:	π	#Neighbors:	2	(7, -) (54, -) 


qsyn> zxgs -FR
Spider Fusion Rule            3 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Pivot Gadget Rule             3 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Boundary Rule           3 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)

qsyn> zxgp -Q

ID:	61	VertexType:	Z	Qubit:	-2	Phase:	7π/4	#Neighbors:	1	(62, H) 
ID:	67	VertexType:	Z	Qubit:	-2	Phase:	7π/4	#Neighbors:	6	(70, H) (75, H) (77, H) (78, H) (80, H) (85, H) 
ID:	69	VertexType:	Z	Qubit:	-2	Phase:	7π/4	#Neighbors:	1	(70, H) 
ID:	73	VertexType:	Z	Qubit:	-2	Phase:	5π/4	#Neighbors:	6	(70, H) (75, H) (77, H) (81, H) (83, H) (85, H) 
ID:	76	VertexType:	Z	Qubit:	-2	Phase:	π/4	#Neighbors:	1	(77, H) 
ID:	79	VertexType:	Z	Qubit:	-2	Phase:	π/4	#Neighbors:	1	(80, H) 
ID:	82	VertexType:	Z	Qubit:	-2	Phase:	3π/4	#Neighbors:	1	(83, H) 


ID:	62	VertexType:	Z	Qubit:	-1	Phase:	0	#Neighbors:	3	(8, H) (13, H) (61, H) 
ID:	70	VertexType:	Z	Qubit:	-1	Phase:	0	#Neighbors:	5	(8, H) (13, H) (67, H) (69, H) (73, H) 
ID:	77	VertexType:	Z	Qubit:	-1	Phase:	0	#Neighbors:	4	(13, H) (67, H) (73, H) (76, H) 
ID:	80	VertexType:	Z	Qubit:	-1	Phase:	0	#Neighbors:	3	(8, H) (67, H) (79, H) 
ID:	83	VertexType:	Z	Qubit:	-1	Phase:	0	#Neighbors:	3	(8, H) (73, H) (82, H) 


ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(13, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(13, -) 
ID:	13	VertexType:	Z	Qubit:	0	Phase:	π/4	#Neighbors:	6	(0, -) (1, -) (62, H) (70, H) (75, H) (77, H) 


ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(75, H) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(85, H) 
ID:	75	VertexType:	Z	Qubit:	1	Phase:	0	#Neighbors:	4	(2, H) (13, H) (67, H) (73, H) 
ID:	85	VertexType:	Z	Qubit:	1	Phase:	0	#Neighbors:	3	(3, H) (67, H) (73, H) 


ID:	4	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(78, H) 
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(81, H) 
ID:	78	VertexType:	Z	Qubit:	2	Phase:	0	#Neighbors:	3	(4, H) (8, H) (67, H) 
ID:	81	VertexType:	Z	Qubit:	2	Phase:	0	#Neighbors:	3	(5, H) (8, H) (73, H) 


ID:	6	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(8, H) 
ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(8, H) 
ID:	8	VertexType:	Z	Qubit:	3	Phase:	3π/2	#Neighbors:	8	(6, H) (7, H) (62, H) (70, H) (78, H) (80, H) (81, H) (83, H) 


qsyn> q -f

