qsyn> ver 1
Note: verbose level is set to 1

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qccread benchmark/benchmark_SABRE/large/qft_10.qasm

qsyn> qczxm

qsyn> zxgp
Graph 0
Inputs:        16
Outputs:       16
Vertices:      322
Edges:         396

qsyn> zxcopy

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgprint
Graph 1
Inputs:        16
Outputs:       16
Vertices:      612
Edges:         776

qsyn> zxgs -fr
Spider Fusion Rule            12 iterator(s)
Identity Removal Rule         3 iterator(s)

qsyn> zxgp
Graph 1
Inputs:        16
Outputs:       16
Vertices:      32
Edges:         16

qsyn> zxgp -v

ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(338, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(339, -) 
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(340, -) 
ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(341, -) 
ID:	9	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(342, -) 
ID:	11	VertexType:	●	Qubit:	5	Phase:	0	#Neighbors:	1	(343, -) 
ID:	13	VertexType:	●	Qubit:	6	Phase:	0	#Neighbors:	1	(344, -) 
ID:	15	VertexType:	●	Qubit:	7	Phase:	0	#Neighbors:	1	(345, -) 
ID:	17	VertexType:	●	Qubit:	8	Phase:	0	#Neighbors:	1	(346, -) 
ID:	19	VertexType:	●	Qubit:	9	Phase:	0	#Neighbors:	1	(347, -) 
ID:	21	VertexType:	●	Qubit:	10	Phase:	0	#Neighbors:	1	(348, -) 
ID:	23	VertexType:	●	Qubit:	11	Phase:	0	#Neighbors:	1	(349, -) 
ID:	25	VertexType:	●	Qubit:	12	Phase:	0	#Neighbors:	1	(350, -) 
ID:	27	VertexType:	●	Qubit:	13	Phase:	0	#Neighbors:	1	(351, -) 
ID:	29	VertexType:	●	Qubit:	14	Phase:	0	#Neighbors:	1	(352, -) 
ID:	31	VertexType:	●	Qubit:	15	Phase:	0	#Neighbors:	1	(353, -) 
ID:	338	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	339	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	340	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(5, -) 
ID:	341	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(7, -) 
ID:	342	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(9, -) 
ID:	343	VertexType:	●	Qubit:	5	Phase:	0	#Neighbors:	1	(11, -) 
ID:	344	VertexType:	●	Qubit:	6	Phase:	0	#Neighbors:	1	(13, -) 
ID:	345	VertexType:	●	Qubit:	7	Phase:	0	#Neighbors:	1	(15, -) 
ID:	346	VertexType:	●	Qubit:	8	Phase:	0	#Neighbors:	1	(17, -) 
ID:	347	VertexType:	●	Qubit:	9	Phase:	0	#Neighbors:	1	(19, -) 
ID:	348	VertexType:	●	Qubit:	10	Phase:	0	#Neighbors:	1	(21, -) 
ID:	349	VertexType:	●	Qubit:	11	Phase:	0	#Neighbors:	1	(23, -) 
ID:	350	VertexType:	●	Qubit:	12	Phase:	0	#Neighbors:	1	(25, -) 
ID:	351	VertexType:	●	Qubit:	13	Phase:	0	#Neighbors:	1	(27, -) 
ID:	352	VertexType:	●	Qubit:	14	Phase:	0	#Neighbors:	1	(29, -) 
ID:	353	VertexType:	●	Qubit:	15	Phase:	0	#Neighbors:	1	(31, -) 
Total #Vertices: 32


qsyn> usage
Period time used : 0.05 seconds
Total time used  : 0.05 seconds
Total memory used: 0.2734 M Bytes

qsyn> q -f

