DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/pseudoSimp/tof_3.qasm
Create and checkout to QCir 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgp -v

ID:   0 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (30, -) 
ID:   1 (‚óè, 0)           (Qubit, Col): (0, 38)	  #Neighbors:   1     (82, -) 
ID:   2 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (24, -) 
ID:   3 (‚óè, 0)           (Qubit, Col): (1, 38)	  #Neighbors:   1     (77, -) 
ID:   4 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (53, -) 
ID:   5 (‚óè, 0)           (Qubit, Col): (2, 38)	  #Neighbors:   1     (57, -) 
ID:   6 (‚óè, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (12, -) 
ID:   7 (‚óè, 0)           (Qubit, Col): (3, 38)	  #Neighbors:   1     (59, -) 
ID:   8 (‚óè, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (10, -) 
ID:   9 (‚óè, 0)           (Qubit, Col): (4, 38)	  #Neighbors:   1     (84, -) 
ID:  10 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 2)	  #Neighbors:   2     (8, -) (11, -) 
ID:  11 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 3)	  #Neighbors:   2     (10, -) (14, [1m[34mH[0m[0m) 
ID:  12 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (3, 2)	  #Neighbors:   2     (6, -) (13, -) 
ID:  13 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (3, 3)	  #Neighbors:   2     (12, -) (37, [1m[34mH[0m[0m) 
ID:  14 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 13)	  #Neighbors:   2     (11, [1m[34mH[0m[0m) (15, -) 
ID:  15 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 14)	  #Neighbors:   3     (14, -) (16, -) (24, -) 
ID:  16 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (4, 15)	  #Neighbors:   2     (15, -) (17, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 16)	  #Neighbors:   3     (16, -) (18, -) (30, -) 
ID:  18 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (4, 17)	  #Neighbors:   2     (17, -) (19, -) 
ID:  19 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 18)	  #Neighbors:   3     (18, -) (20, -) (25, -) 
ID:  20 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (4, 19)	  #Neighbors:   2     (19, -) (21, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 20)	  #Neighbors:   3     (20, -) (22, -) (31, -) 
ID:  22 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (4, 21)	  #Neighbors:   2     (21, -) (23, [1m[34mH[0m[0m) 
ID:  23 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 22)	  #Neighbors:   2     (22, [1m[34mH[0m[0m) (35, -) 
ID:  24 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 14)	  #Neighbors:   3     (2, -) (15, -) (25, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 18)	  #Neighbors:   3     (19, -) (24, -) (26, -) 
ID:  26 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (1, 19)	  #Neighbors:   2     (25, -) (27, -) 
ID:  27 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 21)	  #Neighbors:   3     (26, -) (28, -) (32, -) 
ID:  28 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (1, 22)	  #Neighbors:   2     (27, -) (29, -) 
ID:  29 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 23)	  #Neighbors:   3     (28, -) (34, -) (72, -) 
ID:  30 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 16)	  #Neighbors:   3     (0, -) (17, -) (31, -) 
ID:  31 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 20)	  #Neighbors:   3     (21, -) (30, -) (32, -) 
ID:  32 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 21)	  #Neighbors:   3     (27, -) (31, -) (33, -) 
ID:  33 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (0, 22)	  #Neighbors:   2     (32, -) (34, -) 
ID:  34 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 23)	  #Neighbors:   3     (29, -) (33, -) (78, -) 
ID:  35 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 9)	  #Neighbors:   2     (23, -) (36, -) 
ID:  36 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 10)	  #Neighbors:   2     (35, -) (47, -) 
ID:  37 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (3, 20)	  #Neighbors:   2     (13, [1m[34mH[0m[0m) (38, -) 
ID:  38 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 21)	  #Neighbors:   3     (37, -) (39, -) (47, -) 
ID:  39 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (3, 22)	  #Neighbors:   2     (38, -) (40, -) 
ID:  40 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 23)	  #Neighbors:   3     (39, -) (41, -) (53, -) 
ID:  41 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (3, 24)	  #Neighbors:   2     (40, -) (42, -) 
ID:  42 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 25)	  #Neighbors:   3     (41, -) (43, -) (48, -) 
ID:  43 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (3, 26)	  #Neighbors:   2     (42, -) (44, -) 
ID:  44 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 27)	  #Neighbors:   3     (43, -) (45, -) (54, -) 
ID:  45 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (3, 28)	  #Neighbors:   2     (44, -) (46, [1m[34mH[0m[0m) 
ID:  46 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (3, 29)	  #Neighbors:   2     (45, [1m[34mH[0m[0m) (58, -) 
ID:  47 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 21)	  #Neighbors:   3     (36, -) (38, -) (48, -) 
ID:  48 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 25)	  #Neighbors:   3     (42, -) (47, -) (49, -) 
ID:  49 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (4, 26)	  #Neighbors:   2     (48, -) (50, -) 
ID:  50 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 28)	  #Neighbors:   3     (49, -) (51, -) (55, -) 
ID:  51 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (4, 29)	  #Neighbors:   2     (50, -) (52, -) 
ID:  52 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 30)	  #Neighbors:   3     (51, -) (57, -) (60, -) 
ID:  53 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 23)	  #Neighbors:   3     (4, -) (40, -) (54, -) 
ID:  54 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 27)	  #Neighbors:   3     (44, -) (53, -) (55, -) 
ID:  55 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 28)	  #Neighbors:   3     (50, -) (54, -) (56, -) 
ID:  56 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 29)	  #Neighbors:   2     (55, -) (57, -) 
ID:  57 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 30)	  #Neighbors:   3     (5, -) (52, -) (56, -) 
ID:  58 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (3, 16)	  #Neighbors:   2     (46, -) (59, -) 
ID:  59 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (3, 17)	  #Neighbors:   2     (7, -) (58, -) 
ID:  60 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 16)	  #Neighbors:   2     (52, -) (61, -) 
ID:  61 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 17)	  #Neighbors:   2     (60, -) (62, [1m[34mH[0m[0m) 
ID:  62 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 27)	  #Neighbors:   2     (61, [1m[34mH[0m[0m) (63, -) 
ID:  63 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 28)	  #Neighbors:   3     (62, -) (64, -) (72, -) 
ID:  64 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (4, 29)	  #Neighbors:   2     (63, -) (65, -) 
ID:  65 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 30)	  #Neighbors:   3     (64, -) (66, -) (78, -) 
ID:  66 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (4, 31)	  #Neighbors:   2     (65, -) (67, -) 
ID:  67 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 32)	  #Neighbors:   3     (66, -) (68, -) (73, -) 
ID:  68 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (4, 33)	  #Neighbors:   2     (67, -) (69, -) 
ID:  69 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 34)	  #Neighbors:   3     (68, -) (70, -) (79, -) 
ID:  70 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (4, 35)	  #Neighbors:   2     (69, -) (71, [1m[34mH[0m[0m) 
ID:  71 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 36)	  #Neighbors:   2     (70, [1m[34mH[0m[0m) (83, -) 
ID:  72 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 28)	  #Neighbors:   3     (29, -) (63, -) (73, -) 
ID:  73 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 32)	  #Neighbors:   3     (67, -) (72, -) (74, -) 
ID:  74 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (1, 33)	  #Neighbors:   2     (73, -) (75, -) 
ID:  75 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 35)	  #Neighbors:   3     (74, -) (76, -) (80, -) 
ID:  76 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (1, 36)	  #Neighbors:   2     (75, -) (77, -) 
ID:  77 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 37)	  #Neighbors:   3     (3, -) (76, -) (82, -) 
ID:  78 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 30)	  #Neighbors:   3     (34, -) (65, -) (79, -) 
ID:  79 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 34)	  #Neighbors:   3     (69, -) (78, -) (80, -) 
ID:  80 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 35)	  #Neighbors:   3     (75, -) (79, -) (81, -) 
ID:  81 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (0, 36)	  #Neighbors:   2     (80, -) (82, -) 
ID:  82 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 37)	  #Neighbors:   3     (1, -) (77, -) (81, -) 
ID:  83 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 23)	  #Neighbors:   2     (71, -) (84, -) 
ID:  84 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 24)	  #Neighbors:   2     (9, -) (83, -) 
Total #Vertices: 85


qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> zxgas 1 I X pi

qsyn> zxgas 1 O X pi

qsyn> zxgas 2 I X pi

qsyn> zxgas 2 O X pi

qsyn> zxgas 4 I X 0

qsyn> zxgas 4 O X 0

qsyn> zxgp -v

ID:   6 (‚óè, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (12, -) 
ID:   7 (‚óè, 0)           (Qubit, Col): (3, 38)	  #Neighbors:   1     (59, -) 
ID:  10 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 2)	  #Neighbors:   2     (11, -) (91, -) 
ID:  11 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 3)	  #Neighbors:   2     (10, -) (14, [1m[34mH[0m[0m) 
ID:  12 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (3, 2)	  #Neighbors:   2     (6, -) (13, -) 
ID:  13 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (3, 3)	  #Neighbors:   2     (12, -) (37, [1m[34mH[0m[0m) 
ID:  14 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 13)	  #Neighbors:   2     (11, [1m[34mH[0m[0m) (15, -) 
ID:  15 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 14)	  #Neighbors:   3     (14, -) (16, -) (24, -) 
ID:  16 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (4, 15)	  #Neighbors:   2     (15, -) (17, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 16)	  #Neighbors:   3     (16, -) (18, -) (30, -) 
ID:  18 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (4, 17)	  #Neighbors:   2     (17, -) (19, -) 
ID:  19 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 18)	  #Neighbors:   3     (18, -) (20, -) (25, -) 
ID:  20 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (4, 19)	  #Neighbors:   2     (19, -) (21, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 20)	  #Neighbors:   3     (20, -) (22, -) (31, -) 
ID:  22 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (4, 21)	  #Neighbors:   2     (21, -) (23, [1m[34mH[0m[0m) 
ID:  23 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 22)	  #Neighbors:   2     (22, [1m[34mH[0m[0m) (35, -) 
ID:  24 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 14)	  #Neighbors:   3     (15, -) (25, -) (87, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 18)	  #Neighbors:   3     (19, -) (24, -) (26, -) 
ID:  26 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (1, 19)	  #Neighbors:   2     (25, -) (27, -) 
ID:  27 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 21)	  #Neighbors:   3     (26, -) (28, -) (32, -) 
ID:  28 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (1, 22)	  #Neighbors:   2     (27, -) (29, -) 
ID:  29 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 23)	  #Neighbors:   3     (28, -) (34, -) (72, -) 
ID:  30 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 16)	  #Neighbors:   3     (17, -) (31, -) (85, -) 
ID:  31 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 20)	  #Neighbors:   3     (21, -) (30, -) (32, -) 
ID:  32 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 21)	  #Neighbors:   3     (27, -) (31, -) (33, -) 
ID:  33 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (0, 22)	  #Neighbors:   2     (32, -) (34, -) 
ID:  34 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 23)	  #Neighbors:   3     (29, -) (33, -) (78, -) 
ID:  35 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 9)	  #Neighbors:   2     (23, -) (36, -) 
ID:  36 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 10)	  #Neighbors:   2     (35, -) (47, -) 
ID:  37 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (3, 20)	  #Neighbors:   2     (13, [1m[34mH[0m[0m) (38, -) 
ID:  38 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 21)	  #Neighbors:   3     (37, -) (39, -) (47, -) 
ID:  39 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (3, 22)	  #Neighbors:   2     (38, -) (40, -) 
ID:  40 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 23)	  #Neighbors:   3     (39, -) (41, -) (53, -) 
ID:  41 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (3, 24)	  #Neighbors:   2     (40, -) (42, -) 
ID:  42 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 25)	  #Neighbors:   3     (41, -) (43, -) (48, -) 
ID:  43 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (3, 26)	  #Neighbors:   2     (42, -) (44, -) 
ID:  44 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (3, 27)	  #Neighbors:   3     (43, -) (45, -) (54, -) 
ID:  45 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (3, 28)	  #Neighbors:   2     (44, -) (46, [1m[34mH[0m[0m) 
ID:  46 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (3, 29)	  #Neighbors:   2     (45, [1m[34mH[0m[0m) (58, -) 
ID:  47 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 21)	  #Neighbors:   3     (36, -) (38, -) (48, -) 
ID:  48 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 25)	  #Neighbors:   3     (42, -) (47, -) (49, -) 
ID:  49 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (4, 26)	  #Neighbors:   2     (48, -) (50, -) 
ID:  50 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 28)	  #Neighbors:   3     (49, -) (51, -) (55, -) 
ID:  51 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (4, 29)	  #Neighbors:   2     (50, -) (52, -) 
ID:  52 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 30)	  #Neighbors:   3     (51, -) (57, -) (60, -) 
ID:  53 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 23)	  #Neighbors:   3     (40, -) (54, -) (89, -) 
ID:  54 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 27)	  #Neighbors:   3     (44, -) (53, -) (55, -) 
ID:  55 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 28)	  #Neighbors:   3     (50, -) (54, -) (56, -) 
ID:  56 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 29)	  #Neighbors:   2     (55, -) (57, -) 
ID:  57 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 30)	  #Neighbors:   3     (52, -) (56, -) (90, -) 
ID:  58 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (3, 16)	  #Neighbors:   2     (46, -) (59, -) 
ID:  59 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (3, 17)	  #Neighbors:   2     (7, -) (58, -) 
ID:  60 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 16)	  #Neighbors:   2     (52, -) (61, -) 
ID:  61 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 17)	  #Neighbors:   2     (60, -) (62, [1m[34mH[0m[0m) 
ID:  62 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 27)	  #Neighbors:   2     (61, [1m[34mH[0m[0m) (63, -) 
ID:  63 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 28)	  #Neighbors:   3     (62, -) (64, -) (72, -) 
ID:  64 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (4, 29)	  #Neighbors:   2     (63, -) (65, -) 
ID:  65 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 30)	  #Neighbors:   3     (64, -) (66, -) (78, -) 
ID:  66 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (4, 31)	  #Neighbors:   2     (65, -) (67, -) 
ID:  67 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 32)	  #Neighbors:   3     (66, -) (68, -) (73, -) 
ID:  68 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (4, 33)	  #Neighbors:   2     (67, -) (69, -) 
ID:  69 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 34)	  #Neighbors:   3     (68, -) (70, -) (79, -) 
ID:  70 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (4, 35)	  #Neighbors:   2     (69, -) (71, [1m[34mH[0m[0m) 
ID:  71 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (4, 36)	  #Neighbors:   2     (70, [1m[34mH[0m[0m) (83, -) 
ID:  72 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 28)	  #Neighbors:   3     (29, -) (63, -) (73, -) 
ID:  73 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 32)	  #Neighbors:   3     (67, -) (72, -) (74, -) 
ID:  74 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (1, 33)	  #Neighbors:   2     (73, -) (75, -) 
ID:  75 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 35)	  #Neighbors:   3     (74, -) (76, -) (80, -) 
ID:  76 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (1, 36)	  #Neighbors:   2     (75, -) (77, -) 
ID:  77 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 37)	  #Neighbors:   3     (76, -) (82, -) (88, -) 
ID:  78 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 30)	  #Neighbors:   3     (34, -) (65, -) (79, -) 
ID:  79 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 34)	  #Neighbors:   3     (69, -) (78, -) (80, -) 
ID:  80 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 35)	  #Neighbors:   3     (75, -) (79, -) (81, -) 
ID:  81 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (0, 36)	  #Neighbors:   2     (80, -) (82, -) 
ID:  82 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 37)	  #Neighbors:   3     (77, -) (81, -) (86, -) 
ID:  83 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 23)	  #Neighbors:   2     (71, -) (84, -) 
ID:  84 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (4, 24)	  #Neighbors:   2     (83, -) (92, -) 
ID:  85 ([1m[31mX[0m[0m, œÄ)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (30, -) 
ID:  86 ([1m[31mX[0m[0m, œÄ)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (82, -) 
ID:  87 ([1m[31mX[0m[0m, œÄ)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (24, -) 
ID:  88 ([1m[31mX[0m[0m, œÄ)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (77, -) 
ID:  89 ([1m[31mX[0m[0m, œÄ)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (53, -) 
ID:  90 ([1m[31mX[0m[0m, œÄ)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (57, -) 
ID:  91 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (12, -) 
ID:  92 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (82, -) 
Total #Vertices: 85


qsyn> zxgs -fr

All rules applied in order:
Hadamard Rule                 2 iterations.
  1) 6 matches
  2) 6 matches
Spider Fusion Rule            5 iterations.
  1) 9 matches
  2) 6 matches
  3) 4 matches
  4) 1 matches
  5) 1 matches
Identity Removal Rule         1 iterations.
  1) 5 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    1 iterations.
  1) 2 matches
Local Complementation Rule    2 iterations.
  1) 1 matches
  2) 1 matches
Pivot Gadget Rule             4 iterations.
  1) 5 matches
  2) 4 matches
  3) 3 matches
  4) 2 matches
Identity Removal Rule         1 iterations.
  1) 3 matches
Spider Fusion Rule            1 iterations.
  1) 2 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Local Complementation Rule    2 iterations.
  1) 1 matches
  2) 1 matches
Identity Removal Rule         1 iterations.
  1) 2 matches
Spider Fusion Rule            1 iterations.
  1) 2 matches
Phase Gadget Rule             1 iterations.
  1) 3 matches
Identity Removal Rule         1 iterations.
  1) 2 matches
Spider Fusion Rule            1 iterations.
  1) 2 matches
Local Complementation Rule    4 iterations.
  1) 1 matches
  2) 1 matches
  3) 1 matches
  4) 1 matches

qsyn> zxgp -v

ID:   6 (‚óè, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (45, [1m[34mH[0m[0m) 
ID:   7 (‚óè, 0)           (Qubit, Col): (3, 38)	  #Neighbors:   1     (45, [1m[34mH[0m[0m) 
ID:  45 ([1m[32mZ[0m[0m, œÄ)           (Qubit, Col): (3, 28)	  #Neighbors:   2     (6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:  95 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (-2, 14)	  #Neighbors:   1     (96, [1m[34mH[0m[0m) 
ID:  96 ([1m[32mZ[0m[0m, œÄ)           (Qubit, Col): (-1, 14)	  #Neighbors:   1     (95, [1m[34mH[0m[0m) 
ID: 105 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (-2, 28)	  #Neighbors:   1     (106, [1m[34mH[0m[0m) 
ID: 106 ([1m[32mZ[0m[0m, œÄ)           (Qubit, Col): (-1, 28)	  #Neighbors:   1     (105, [1m[34mH[0m[0m) 
ID: 109 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (-2, 36)	  #Neighbors:   1     (110, [1m[34mH[0m[0m) 
ID: 110 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 36)	  #Neighbors:   1     (109, [1m[34mH[0m[0m) 
ID: 117 ([1m[32mZ[0m[0m, 3œÄ/4)        (Qubit, Col): (-2, 22)	  #Neighbors:   1     (118, [1m[34mH[0m[0m) 
ID: 118 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 22)	  #Neighbors:   1     (117, [1m[34mH[0m[0m) 
ID: 119 ([1m[32mZ[0m[0m, 5œÄ/4)        (Qubit, Col): (-2, 23)	  #Neighbors:   1     (120, [1m[34mH[0m[0m) 
ID: 120 ([1m[32mZ[0m[0m, œÄ)           (Qubit, Col): (-1, 23)	  #Neighbors:   1     (119, [1m[34mH[0m[0m) 
Total #Vertices: 13


qsyn> zxgs -stco

qsyn> zxgp -v

ID:   6 (‚óè, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (45, [1m[34mH[0m[0m) 
ID:   7 (‚óè, 0)           (Qubit, Col): (3, 38)	  #Neighbors:   1     (45, [1m[34mH[0m[0m) 
ID:  45 ([1m[32mZ[0m[0m, œÄ)           (Qubit, Col): (3, 28)	  #Neighbors:   2     (6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:  95 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (-2, 14)	  #Neighbors:   1     (96, [1m[34mH[0m[0m) 
ID:  96 ([1m[32mZ[0m[0m, œÄ)           (Qubit, Col): (-1, 14)	  #Neighbors:   1     (95, [1m[34mH[0m[0m) 
ID: 105 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (-2, 28)	  #Neighbors:   1     (106, [1m[34mH[0m[0m) 
ID: 106 ([1m[32mZ[0m[0m, œÄ)           (Qubit, Col): (-1, 28)	  #Neighbors:   1     (105, [1m[34mH[0m[0m) 
ID: 109 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (-2, 36)	  #Neighbors:   1     (110, [1m[34mH[0m[0m) 
ID: 110 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 36)	  #Neighbors:   1     (109, [1m[34mH[0m[0m) 
ID: 117 ([1m[32mZ[0m[0m, 3œÄ/4)        (Qubit, Col): (-2, 22)	  #Neighbors:   1     (118, [1m[34mH[0m[0m) 
ID: 118 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 22)	  #Neighbors:   1     (117, [1m[34mH[0m[0m) 
ID: 119 ([1m[32mZ[0m[0m, 5œÄ/4)        (Qubit, Col): (-2, 23)	  #Neighbors:   1     (120, [1m[34mH[0m[0m) 
ID: 120 ([1m[32mZ[0m[0m, œÄ)           (Qubit, Col): (-1, 23)	  #Neighbors:   1     (119, [1m[34mH[0m[0m) 
Total #Vertices: 13


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 4.266422e-17+6.123234e-17i,  1.000000e+00-6.123234e-17i},
 { 1.000000e+00-6.123234e-17i,  4.266422e-17+6.123234e-17i}}
#Dim:    2	Info: ZX 0

qsyn> qq -f

