DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/pseudoSimp/tof_3.qasm
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgp -v

ID:	0	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(18, -) 
ID:	1	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(81, -) 
ID:	2	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	3	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(82, -) 
ID:	4	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(41, -) 
ID:	5	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(56, -) 
ID:	6	VertexType:	‚óè	Qubit:	3	Phase:	0	#Neighbors:	1	(12, -) 
ID:	7	VertexType:	‚óè	Qubit:	3	Phase:	0	#Neighbors:	1	(59, -) 
ID:	8	VertexType:	‚óè	Qubit:	4	Phase:	0	#Neighbors:	1	(10, -) 
ID:	9	VertexType:	‚óè	Qubit:	4	Phase:	0	#Neighbors:	1	(84, -) 
ID:	10	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(8, -) (11, -) 
ID:	11	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(10, -) (14, -) 
ID:	12	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(6, -) (13, -) 
ID:	13	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(12, -) (37, -) 
ID:	14	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(11, -) (16, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(2, -) (16, -) (21, -) 
ID:	16	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(14, -) (15, -) (17, -) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	7œÄ/4	#Neighbors:	2	(16, -) (19, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (19, -) (24, -) 
ID:	19	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(17, -) (18, -) (20, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	œÄ/4	#Neighbors:	2	(19, -) (22, -) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(15, -) (22, -) (26, -) 
ID:	22	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(20, -) (21, -) (23, -) 
ID:	23	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	7œÄ/4	#Neighbors:	2	(22, -) (25, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(18, -) (25, -) (28, -) 
ID:	25	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(23, -) (24, -) (27, -) 
ID:	26	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	œÄ/4	#Neighbors:	2	(21, -) (29, -) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	œÄ/4	#Neighbors:	2	(25, -) (30, -) 
ID:	28	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(24, -) (29, -) (31, -) 
ID:	29	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(26, -) (28, -) (32, -) 
ID:	30	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(27, -) (35, -) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	œÄ/4	#Neighbors:	2	(28, -) (33, -) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7œÄ/4	#Neighbors:	2	(29, -) (34, -) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(31, -) (34, -) (66, -) 
ID:	34	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(32, -) (33, -) (63, -) 
ID:	35	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(30, -) (36, -) 
ID:	36	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(35, -) (38, -) 
ID:	37	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(13, -) (39, -) 
ID:	38	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(36, -) (39, -) (44, -) 
ID:	39	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(37, -) (38, -) (40, -) 
ID:	40	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	7œÄ/4	#Neighbors:	2	(39, -) (42, -) 
ID:	41	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(4, -) (42, -) (47, -) 
ID:	42	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(40, -) (41, -) (43, -) 
ID:	43	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	œÄ/4	#Neighbors:	2	(42, -) (45, -) 
ID:	44	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(38, -) (45, -) (49, -) 
ID:	45	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(43, -) (44, -) (46, -) 
ID:	46	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	7œÄ/4	#Neighbors:	2	(45, -) (48, -) 
ID:	47	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(41, -) (48, -) (51, -) 
ID:	48	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(46, -) (47, -) (50, -) 
ID:	49	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	œÄ/4	#Neighbors:	2	(44, -) (52, -) 
ID:	50	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	œÄ/4	#Neighbors:	2	(48, -) (53, -) 
ID:	51	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(47, -) (52, -) (54, -) 
ID:	52	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(49, -) (51, -) (55, -) 
ID:	53	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(50, -) (58, -) 
ID:	54	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	œÄ/4	#Neighbors:	2	(51, -) (56, -) 
ID:	55	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7œÄ/4	#Neighbors:	2	(52, -) (57, -) 
ID:	56	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(5, -) (54, -) (57, -) 
ID:	57	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(55, -) (56, -) (60, -) 
ID:	58	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(53, -) (59, -) 
ID:	59	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(7, -) (58, -) 
ID:	60	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(57, -) (61, -) 
ID:	61	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(60, -) (62, -) 
ID:	62	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(61, -) (64, -) 
ID:	63	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(34, -) (64, -) (69, -) 
ID:	64	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(62, -) (63, -) (65, -) 
ID:	65	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	7œÄ/4	#Neighbors:	2	(64, -) (67, -) 
ID:	66	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(33, -) (67, -) (72, -) 
ID:	67	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(65, -) (66, -) (68, -) 
ID:	68	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	œÄ/4	#Neighbors:	2	(67, -) (70, -) 
ID:	69	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(63, -) (70, -) (74, -) 
ID:	70	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(68, -) (69, -) (71, -) 
ID:	71	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	7œÄ/4	#Neighbors:	2	(70, -) (73, -) 
ID:	72	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(66, -) (73, -) (76, -) 
ID:	73	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(71, -) (72, -) (75, -) 
ID:	74	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	œÄ/4	#Neighbors:	2	(69, -) (77, -) 
ID:	75	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	œÄ/4	#Neighbors:	2	(73, -) (78, -) 
ID:	76	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(72, -) (77, -) (79, -) 
ID:	77	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(74, -) (76, -) (80, -) 
ID:	78	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(75, -) (83, -) 
ID:	79	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	œÄ/4	#Neighbors:	2	(76, -) (81, -) 
ID:	80	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7œÄ/4	#Neighbors:	2	(77, -) (82, -) 
ID:	81	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (79, -) (82, -) 
ID:	82	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (80, -) (81, -) 
ID:	83	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(78, -) (84, -) 
ID:	84	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(9, -) (83, -) 
Total #Vertices: 85


qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> zxgas 2 I X pi

qsyn> zxgas 2 O X pi

qsyn> zxgas 4 I X 0

qsyn> zxgas 4 O X 0

qsyn> zxgp -v

ID:	2	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	3	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(82, -) 
ID:	6	VertexType:	‚óè	Qubit:	3	Phase:	0	#Neighbors:	1	(12, -) 
ID:	7	VertexType:	‚óè	Qubit:	3	Phase:	0	#Neighbors:	1	(59, -) 
ID:	10	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(11, -) (89, -) 
ID:	11	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(10, -) (14, -) 
ID:	12	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(6, -) (13, -) 
ID:	13	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(12, -) (37, -) 
ID:	14	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(11, -) (16, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(2, -) (16, -) (21, -) 
ID:	16	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(14, -) (15, -) (17, -) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	7œÄ/4	#Neighbors:	2	(16, -) (19, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(19, -) (24, -) (85, -) 
ID:	19	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(17, -) (18, -) (20, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	œÄ/4	#Neighbors:	2	(19, -) (22, -) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(15, -) (22, -) (26, -) 
ID:	22	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(20, -) (21, -) (23, -) 
ID:	23	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	7œÄ/4	#Neighbors:	2	(22, -) (25, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(18, -) (25, -) (28, -) 
ID:	25	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(23, -) (24, -) (27, -) 
ID:	26	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	œÄ/4	#Neighbors:	2	(21, -) (29, -) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	œÄ/4	#Neighbors:	2	(25, -) (30, -) 
ID:	28	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(24, -) (29, -) (31, -) 
ID:	29	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(26, -) (28, -) (32, -) 
ID:	30	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(27, -) (35, -) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	œÄ/4	#Neighbors:	2	(28, -) (33, -) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7œÄ/4	#Neighbors:	2	(29, -) (34, -) 
ID:	33	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(31, -) (34, -) (66, -) 
ID:	34	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(32, -) (33, -) (63, -) 
ID:	35	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(30, -) (36, -) 
ID:	36	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(35, -) (38, -) 
ID:	37	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(13, -) (39, -) 
ID:	38	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(36, -) (39, -) (44, -) 
ID:	39	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(37, -) (38, -) (40, -) 
ID:	40	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	7œÄ/4	#Neighbors:	2	(39, -) (42, -) 
ID:	41	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(42, -) (47, -) (87, -) 
ID:	42	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(40, -) (41, -) (43, -) 
ID:	43	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	œÄ/4	#Neighbors:	2	(42, -) (45, -) 
ID:	44	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(38, -) (45, -) (49, -) 
ID:	45	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(43, -) (44, -) (46, -) 
ID:	46	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	7œÄ/4	#Neighbors:	2	(45, -) (48, -) 
ID:	47	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(41, -) (48, -) (51, -) 
ID:	48	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(46, -) (47, -) (50, -) 
ID:	49	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	œÄ/4	#Neighbors:	2	(44, -) (52, -) 
ID:	50	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	œÄ/4	#Neighbors:	2	(48, -) (53, -) 
ID:	51	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(47, -) (52, -) (54, -) 
ID:	52	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(49, -) (51, -) (55, -) 
ID:	53	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(50, -) (58, -) 
ID:	54	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	œÄ/4	#Neighbors:	2	(51, -) (56, -) 
ID:	55	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7œÄ/4	#Neighbors:	2	(52, -) (57, -) 
ID:	56	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(54, -) (57, -) (88, -) 
ID:	57	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(55, -) (56, -) (60, -) 
ID:	58	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(53, -) (59, -) 
ID:	59	VertexType:	[1m[33mH[0m[0m	Qubit:	3	Phase:	œÄ	#Neighbors:	2	(7, -) (58, -) 
ID:	60	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(57, -) (61, -) 
ID:	61	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(60, -) (62, -) 
ID:	62	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(61, -) (64, -) 
ID:	63	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(34, -) (64, -) (69, -) 
ID:	64	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(62, -) (63, -) (65, -) 
ID:	65	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	7œÄ/4	#Neighbors:	2	(64, -) (67, -) 
ID:	66	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(33, -) (67, -) (72, -) 
ID:	67	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(65, -) (66, -) (68, -) 
ID:	68	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	œÄ/4	#Neighbors:	2	(67, -) (70, -) 
ID:	69	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(63, -) (70, -) (74, -) 
ID:	70	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(68, -) (69, -) (71, -) 
ID:	71	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	7œÄ/4	#Neighbors:	2	(70, -) (73, -) 
ID:	72	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(66, -) (73, -) (76, -) 
ID:	73	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(71, -) (72, -) (75, -) 
ID:	74	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	œÄ/4	#Neighbors:	2	(69, -) (77, -) 
ID:	75	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	œÄ/4	#Neighbors:	2	(73, -) (78, -) 
ID:	76	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(72, -) (77, -) (79, -) 
ID:	77	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(74, -) (76, -) (80, -) 
ID:	78	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(75, -) (83, -) 
ID:	79	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	œÄ/4	#Neighbors:	2	(76, -) (81, -) 
ID:	80	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7œÄ/4	#Neighbors:	2	(77, -) (82, -) 
ID:	81	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(79, -) (82, -) (86, -) 
ID:	82	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (80, -) (81, -) 
ID:	83	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(78, -) (84, -) 
ID:	84	VertexType:	[1m[33mH[0m[0m	Qubit:	4	Phase:	œÄ	#Neighbors:	2	(83, -) (90, -) 
ID:	85	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	œÄ	#Neighbors:	1	(18, -) 
ID:	86	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	œÄ	#Neighbors:	1	(81, -) 
ID:	87	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	1	(41, -) 
ID:	88	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	1	(56, -) 
ID:	89	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	1	(10, -) 
ID:	90	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	1	(84, -) 
Total #Vertices: 85


qsyn> zxgs -fr
Hadamard Rule: 6 . 6 . 6 . 3 iterations
Spider Fusion Rule: 
5 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
2 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
4 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Boundary Rule: 
No matches
Phase Gadget Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
5 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Boundary Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches

qsyn> zxgp -v

ID:	2	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	3	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	6	VertexType:	‚óè	Qubit:	3	Phase:	0	#Neighbors:	1	(50, [1m[34mH[0m[0m) 
ID:	7	VertexType:	‚óè	Qubit:	3	Phase:	0	#Neighbors:	1	(50, [1m[34mH[0m[0m) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(2, -) (3, -) (50, [1m[34mH[0m[0m) 
ID:	50	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	103	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	œÄ/4	#Neighbors:	1	(104, [1m[34mH[0m[0m) 
ID:	104	VertexType:	[1m[32mZ[0m[0m	Qubit:	-1	Phase:	œÄ	#Neighbors:	1	(103, [1m[34mH[0m[0m) 
Total #Vertices: 8


qsyn> zxgs -stco
State Copy Rule: 
1 iterations

qsyn> zxgp -v

ID:	2	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	3	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(15, -) 
ID:	6	VertexType:	‚óè	Qubit:	3	Phase:	0	#Neighbors:	1	(50, [1m[34mH[0m[0m) 
ID:	7	VertexType:	‚óè	Qubit:	3	Phase:	0	#Neighbors:	1	(50, [1m[34mH[0m[0m) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(2, -) (3, -) (50, [1m[34mH[0m[0m) 
ID:	50	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
Total #Vertices: 6


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  1.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  1.      +0.i},
 { 0.      +0.i,  0.      +0.i,  1.      +0.i,  0.      +0.i}}
#Dim:    2	Info: ZX 0

qsyn> q -f

