qsyn> qccread benchmark/qft/qft_5dec.qasm
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qccp
QCir 0( 5 qubits, 55 gates)

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgp
Graph 0( 5 inputs, 5 outputs, 75 vertices, 80 edges )

qsyn> zxgp -a
#T-gate:                      12
#Non-(Clifford+T)-gate:       18
#Non-Clifford-gate:           30

qsyn> zxgs -fr
Spider Fusion Rule: 
5 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
1 iterations
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
2 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches

qsyn> zxgp -a
#T-gate:                      6
#Non-(Clifford+T)-gate:       12
#Non-Clifford-gate:           18

qsyn> qq -f

