DV Lab, NTUEE, Qsyn 0.5.1
qsyn> verb 3
Note: verbose level is set to 3

qsyn> qccread ./benchmark/qft/qft_7.qasm

qsyn> qc2zx 

qsyn> zxcopy 1

qsyn> zxgs -preduce 4

Full Reduce:
All rules applied in order:
Spider Fusion Rule            3 iterations.
  1) 4 matches
  2) 2 matches
  3) 1 matches

Dynamic Reduce: (T-optimal: 1)
All rules applied in order:
Spider Fusion Rule            3 iterations.
  1) 4 matches
  2) 2 matches
  3) 1 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 3 matches
  2) 1 matches

Dynamic Reduce: (T-optimal: 5)
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 3 matches
  2) 1 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 4 matches
  2) 2 matches

Dynamic Reduce: (T-optimal: 1)
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 4 matches
  2) 2 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 2 matches
  2) 2 matches

Dynamic Reduce: (T-optimal: 3)
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 2 matches
  2) 2 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 2 matches
  2) 1 matches

Dynamic Reduce: (T-optimal: 5)
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 2 matches
  2) 1 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 2 matches
  2) 1 matches

Dynamic Reduce: (T-optimal: 3)
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 2 matches
  2) 1 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 3 matches

Dynamic Reduce: (T-optimal: 8)
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 3 matches

qsyn> zxgadjoint 

qsyn> zxcompose 0

qsyn> zxgs -freduce

All rules applied in order:
Hadamard Rule                 1 iterations.
  1) 7 matches
Spider Fusion Rule            5 iterations.
  1) 21 matches
  2) 13 matches
  3) 7 matches
  4) 7 matches
  5) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    1 iterations.
  1) 5 matches
Identity Removal Rule         1 iterations.
  1) 2 matches
Spider Fusion Rule            1 iterations.
  1) 2 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 3 matches
Spider Fusion Rule            1 iterations.
  1) 3 matches
Pivot Rule                    1 iterations.
  1) 2 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 2 matches
Spider Fusion Rule            1 iterations.
  1) 2 matches
Pivot Rule                    1 iterations.
  1) 2 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 2 matches
Spider Fusion Rule            1 iterations.
  1) 2 matches
Pivot Rule                    1 iterations.
  1) 2 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Phase Gadget Rule             1 iterations.
  1) 6 matches
Pivot Rule                    1 iterations.
  1) 6 matches
Identity Removal Rule         1 iterations.
  1) 7 matches

qsyn> zxgt -id
The graph is an identity!

qsyn> qq -f

