DV Lab, NTUEE, Qsyn 0.5.1
qsyn> verb 3
Note: verbose level is set to 3

qsyn> qccread ./benchmark/qft/qft_5.qasm
Create and checkout to QCir 0

qsyn> qc2zx
Created and checked out to ZXGraph 0

qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> zxcopy
Successfully copied ZXGraph 0 to ZXGraph 1
Checked out to ZXGraph 1

qsyn> zxgs -preduce 2 1

All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 2 matches

All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 4 matches
  2) 1 matches

qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

