DV Lab, NTUEE, Qsyn 0.5.1
qsyn> verb 3
Note: verbose level is set to 3

qsyn> qccread ./benchmark/qft/qft_5.qasm
Created and checked out to QCir 0

qsyn> qc2zx
Created and checked out to ZXGraph 0

qsyn> zx2ts
Traverse and build the tensor... 
Created and checked out to Tensor 0

qsyn> zxcopy
Successfully copied ZXGraph 0 to ZXGraph 1
Checked out to ZXGraph 1

qsyn> zxgs -preduce 4

Full Reduce:
All rules applied in order:

Dynamic Reduce: (T-optimal: 5)
All rules applied in order:

Full Reduce:
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 2 matches
  2) 1 matches

Dynamic Reduce: (T-optimal: 1)
All rules applied in order:
Spider Fusion Rule            2 iterations.
  1) 2 matches
  2) 1 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 2 matches

Dynamic Reduce: (T-optimal: 4)
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 2 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 2 matches

Dynamic Reduce: (T-optimal: 0)
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 2 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 1 matches

Dynamic Reduce: (T-optimal: 6)
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 1 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 1 matches

Dynamic Reduce: (T-optimal: 2)
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 1 matches

Full Reduce:
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 3 matches

Dynamic Reduce: (T-optimal: 6)
All rules applied in order:
Spider Fusion Rule            1 iterations.
  1) 3 matches

qsyn> zx2ts
Traverse and build the tensor... 
Created and checked out to Tensor 1

qsyn> tseq 0 1
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

