DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr FullReduceError/urf1_149.qasm

qsyn> qccp -a
Clifford: 103986
└── CX: 80878
T-family: 80878
Others  : 0

qsyn> qc2ts
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.000000e+00-3.599632e-12i,  2.609295e-14+3.510701e-13i,
   1.950404e-14+3.199555e-13i, ..., -1.031663e-16+1.607451e-17i,
  -1.780403e-16-1.519691e-16i,  1.727880e-16-1.082894e-17i},
 { 2.214128e-14+3.480282e-13i,  1.000000e+00-4.335261e-12i,
  -2.340169e-16+1.300517e-15i, ...,  3.723743e-16+5.134781e-16i,
   1.153490e-16+3.078853e-15i,  4.986842e-16+5.225464e-16i},
 { 2.054679e-14+3.197157e-13i, -2.260854e-15+8.207545e-16i,
   1.000000e+00-4.513556e-12i, ..., -6.792261e-16+2.773638e-15i,
  -3.333746e-16+2.160324e-15i, -2.782537e-16+1.666045e-15i},
 ...,
 {-9.934173e-16-4.481796e-16i,  3.160632e-16+8.925152e-16i,
  -9.721199e-16+2.095814e-15i, ...,  1.002054e-16+5.342948e-16i,
  -4.375749e-16+2.702699e-15i,  5.950014e-16+2.994932e-15i},
 { 8.400952e-17+9.784111e-17i,  2.039022e-16+2.610759e-16i,
   6.466140e-16+2.836547e-15i, ...,  2.704593e-16-2.281161e-16i,
  -6.560669e-16+4.871104e-15i, -1.204911e-16+8.239937e-17i},
 {-7.360757e-16+5.624706e-16i,  3.832382e-16+2.710863e-15i,
  -1.766099e-16+1.654528e-15i, ...,  1.615846e-16+2.827599e-15i,
   1.000000e+00-5.895736e-12i,  1.940596e-15-5.456071e-15i}}
#Dim:    2	Info: QC

qsyn> qc2zx

qsyn> extp -s

Sort Frontier:     False
Sort Neighbors:    True
Permute Qubits:    True
Filter Duplicated: True
Block Size:        5
Optimize Level:    1

qsyn> zxgs -fr

qsyn> usage
Period time used : 885 seconds
Total time used  : 885 seconds
Total memory used: 853.7 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 31.32 seconds
Total time used  : 916.4 seconds
Total memory used: 853.7 M Bytes

qsyn> qccp -a
Clifford: 191868
└── CX: 92440
T-family: 40380
Others  : 0

qsyn> qc2ts
Stored the resulting tensor as tensor id 1

qsyn> tsp 1
{{-9.2388e-01+3.826834e-01i, -1.0492e-13-2.148083e-13i,
  -9.9034e-14-1.939803e-13i, ..., 3.7655e-16 +6.082780e-17i,
  2.5496e-17 -5.309086e-16i, 5.5554e-16 +1.586098e-15i},
 {-1.0351e-13-2.144158e-13i, -9.2388e-01+3.826834e-01i,
  5.9629e-16 +1.363267e-15i, ..., -8.6179e-16-7.108623e-16i,
  -9.1582e-16-1.543450e-15i, -3.6350e-16-7.706400e-16i},
 {-9.7744e-14-1.962821e-13i, 5.1771e-16 -8.068552e-16i,
  -9.2388e-01+3.826834e-01i, ..., -3.0823e-16+7.137294e-17i,
  -5.2893e-16-1.368063e-15i, -3.4483e-16-1.110603e-15i},
 ...,
 {2.0369e-16 +2.085420e-16i, -2.5130e-16-4.861322e-16i,
  -9.5183e-16+2.632311e-16i, ..., 2.7698e-16 -3.113669e-16i,
  -1.1007e-15+8.106490e-16i, -5.6936e-16-1.535337e-15i},
 {-4.5078e-16-7.388104e-17i, -1.4988e-15-4.284884e-16i,
  -1.2561e-15-2.077919e-15i, ..., -4.5274e-17+4.596644e-16i,
  -6.4905e-16-1.636781e-15i, 9.6379e-16 +4.865069e-16i},
 {-2.4716e-16-4.999553e-16i, -2.9414e-16-2.271427e-15i,
  -2.3544e-16-6.859623e-16i, ..., -1.2308e-15-5.844787e-16i,
  -9.2388e-01+3.826834e-01i, 4.3437e-15 +4.343748e-15i}}
#Dim:    2	Info: QC

qsyn> tseq 0 1
Equivalent
- Global Norm : 1
- Global Phase: 7π/8

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 3444 seconds
Total time used  : 4360 seconds
Total memory used: 862 M Bytes

qsyn> zxgt -id 
The graph is not an identity!

qsyn> zxgw FullReduceError/urf1_149_fr.zx

qsyn> zx2ts
Stored the resulting tensor as tensor id 2

qsyn> tsp 2
{{ 0.5   -3.630784e-16i,  0.    +0.000000e+00i,  0.    +0.000000e+00i, ...,
   0.    +0.000000e+00i,  0.    +0.000000e+00i,  0.    +0.000000e+00i},
 { 0.    +0.000000e+00i,  0.5   -4.279647e-16i,  0.    +0.000000e+00i, ...,
   0.    +0.000000e+00i,  0.    +0.000000e+00i,  0.    +0.000000e+00i},
 { 0.    +0.000000e+00i,  0.    +0.000000e+00i,  0.5   -3.630784e-16i, ...,
   0.    +0.000000e+00i,  0.    +0.000000e+00i,  0.    +0.000000e+00i},
 ...,
 { 0.    +0.000000e+00i,  0.    +0.000000e+00i,  0.    +0.000000e+00i, ...,
   0.5   -3.315691e-16i,  0.    +0.000000e+00i,  0.    +0.000000e+00i},
 { 0.    +0.000000e+00i,  0.    +0.000000e+00i,  0.    +0.000000e+00i, ...,
   0.    +0.000000e+00i,  0.5   -3.315691e-16i,  0.    +0.000000e+00i},
 { 0.    +0.000000e+00i,  0.    +0.000000e+00i,  0.    +0.000000e+00i, ...,
   0.    +0.000000e+00i,  0.    +0.000000e+00i,  0.5   -3.315691e-16i}}
#Dim:    2	Info: ZX 2

qsyn> // qc2ts
qsyn> // tsp 1
qsyn> qq -f

