DV Lab, NTUEE, Qsyn 0.4.2
qsyn> ver 0
Note: verbose level is set to 0

qsyn> qcp -se

Delay of Single-qubit gate :     1
Delay of Double-qubit gate :     2
Delay of SWAP gate :             6 (3 CXs)
Delay of Multiple-qubit gate :   5

qsyn> qcset -double 2 -sw 6

qsyn> qcp -se

Delay of Single-qubit gate :     1
Delay of Double-qubit gate :     2
Delay of SWAP gate :             6 (3 CXs)
Delay of Multiple-qubit gate :   5

qsyn> qccr benchmark/benchmark_SABRE/large/cm82a_208.qasm

qsyn> dtgr benchmark/topology/guadalupe.layout 

qsyn> qccp -a
[1m[32mClifford    : 370[0m[0m
â””â”€â”€ [1m[31m2-qubit : 283[0m[0m
[1m[31mT-family    : 280[0m[0m
[1m[32mOthers      : 0[0m[0m

qsyn> duoprint -d

Scheduler:         search
Router:            duostra
Placer:            dfs

Candidates:        -1
Search Depth:      4

Orient:            true
APSP Coeff.:       1
Available Time:    max
Prefer Cost:       min
Never Cache:       true
Single Immed.:     false

qsyn> duoset -depth 2 -si true

qsyn> duoprint -d

Scheduler:         search
Router:            duostra
Placer:            dfs

Candidates:        -1
Search Depth:      2

Orient:            true
APSP Coeff.:       1
Available Time:    max
Prefer Cost:       min
Never Cache:       true
Single Immed.:     true

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  1603
Total Time:     3633
#SWAP:          450


qsyn> qccp -a
[1m[32mClifford    : 1720[0m[0m
â””â”€â”€ [1m[31m2-qubit : 1633[0m[0m
[1m[31mT-family    : 280[0m[0m
[1m[32mOthers      : 0[0m[0m

qsyn> duoset -sc greedy

qsyn> duoprint

Scheduler:         greedy
Router:            duostra
Placer:            dfs

qsyn> duostra -c
Routing...

Checking...

Duostra Result: 

Scheduler:      greedy
Router:         duostra
Placer:         dfs

Mapping Depth:  2441
Total Time:     6753
#SWAP:          520


qsyn> qccp -a
[1m[32mClifford    : 3280[0m[0m
â””â”€â”€ [1m[31m2-qubit : 3193[0m[0m
[1m[31mT-family    : 280[0m[0m
[1m[32mOthers      : 0[0m[0m

qsyn> qq -f

