DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/9symml_195.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 19649
└── CX: 15232
T-family: 15232
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 48.8 seconds
Total time used  : 48.8 seconds
Total memory used: 969.2 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 7.27 seconds
Total time used  : 56.07 seconds
Total memory used: 969.2 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 34285
└── CX: 22569
T-family: 6450
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 222.5 seconds
Total time used  : 278.6 seconds
Total memory used: 969.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

