DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dc2_222.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 5332
└── CX: 4131
T-family: 4130
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 4.96 seconds
Total time used  : 4.96 seconds
Total memory used: 145.5 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.99 seconds
Total time used  : 6.95 seconds
Total memory used: 145.5 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 10108
└── CX: 6823
T-family: 1758
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 7.56 seconds
Total time used  : 14.51 seconds
Total memory used: 145.5 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

