DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dist_223.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 21428
└── CX: 16624
T-family: 16618
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 84.99 seconds
Total time used  : 84.99 seconds
Total memory used: 1102 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 9.14 seconds
Total time used  : 94.13 seconds
Total memory used: 1102 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 41263
└── CX: 28168
T-family: 6868
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 193.5 seconds
Total time used  : 287.7 seconds
Total memory used: 1102 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

