DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd84_253.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 7701
└── CX: 5960
T-family: 5957
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 10.57 seconds
Total time used  : 10.57 seconds
Total memory used: 277 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.61 seconds
Total time used  : 13.18 seconds
Total memory used: 277 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 16933
└── CX: 11852
T-family: 2625
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 50.76 seconds
Total time used  : 63.94 seconds
Total memory used: 425.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

