DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqn_258.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 5764
└── CX: 4459
T-family: 4459
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 5.69 seconds
Total time used  : 5.69 seconds
Total memory used: 197.4 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.77 seconds
Total time used  : 7.46 seconds
Total memory used: 197.4 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 12137
└── CX: 8011
T-family: 2097
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 10.34 seconds
Total time used  : 17.8 seconds
Total memory used: 197.4 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

