DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqrt8_260.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 1700
└── CX: 1314
T-family: 1309
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.49 seconds
Total time used  : 0.49 seconds
Total memory used: 33.65 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.52 seconds
Total time used  : 1.01 seconds
Total memory used: 33.65 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 4053
└── CX: 2766
T-family: 581
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.71 seconds
Total time used  : 1.72 seconds
Total memory used: 33.65 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

