DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qcba
Note: QCir list is empty now. Create a new one.
Create and checkout to QCir 0

qsyn> qcga -rz -ph 11*pi/17 0 

qsyn> qcga -rz -ph 1l*pi/17 0 
Error: not a legal phase!!
Error: Illegal option!! (1l*pi/17)

qsyn> qcga -rz -ph 3*3*PI/4/3 0

qsyn> qcga -rz -ph 3*4/PI 0

qsyn> qcga -rz -ph PI*PI/pi 0

qsyn> qcga -rz -ph PI*3PI/pi 0
Error: not a legal phase!!
Error: Illegal option!! (PI*3PI/pi)

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> qq -f

