qsyn> qcba

qsyn> qcga -rz -ph 11*pi/17 0 

qsyn> qcga -rz -ph 1l*pi/17 0 
Error: not a legal phase!!
Error: Illegal option!! (1l*pi/17)

qsyn> qcga -rz -ph 3*3*PI/4/3 0

qsyn> qcga -rz -ph 3*4/PI 0

qsyn> qcga -rz -ph PI*PI/pi 0

qsyn> qcga -rz -ph PI*3PI/pi 0
Error: not a legal phase!!
Error: Illegal option!! (PI*3PI/pi)

qsyn> zxmode -on
ZXMODE turn ON!

qsyn> qczxm
Successfully generated Graph 0
Checkout to Graph 0
---- TRAVERSE AND BUILD THE GRAPH ----
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------

qsyn> q -f

