DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/benchmark_SABRE/small/3_17_13.qasm
Create and checkout to QCir 0

qsyn> exts -op 1

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> extp -f
Error: ZX-graph (id: 0) is not graph-like. Not extractable!!

qsyn> zxgs -fr

All rules applied in order:
Hadamard Rule                 1 iterations.
  1) 4 matches
Spider Fusion Rule            3 iterations.
  1) 10 matches
  2) 3 matches
  3) 2 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    2 iterations.
  1) 2 matches
  2) 1 matches
Pivot Gadget Rule             3 iterations.
  1) 6 matches
  2) 2 matches
  3) 1 matches
Identity Removal Rule         1 iterations.
  1) 2 matches
Phase Gadget Rule             1 iterations.
  1) 1 matches
Local Complementation Rule    2 iterations.
  1) 1 matches
  2) 1 matches

qsyn> zxcopy 1
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1

qsyn> qcn
Create and checkout to QCir 1

qsyn> qcba 3

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> zxgp -q

ID:  15 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 6)	  #Neighbors:   1     (16, [1m[34mH[0m[0m) 
ID:  17 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 16)	  #Neighbors:   1     (18, [1m[34mH[0m[0m) 
ID:  19 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 21)	  #Neighbors:   1     (20, [1m[34mH[0m[0m) 
ID:  21 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 28)	  #Neighbors:   1     (22, [1m[34mH[0m[0m) 
ID:  23 ([1m[32mZ[0m[0m, -3Ï€/4)       (Qubit, Col): (-2, 30)	  #Neighbors:   1     (24, [1m[34mH[0m[0m) 
ID:  25 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 7)	  #Neighbors:   1     (26, [1m[34mH[0m[0m) 
ID:  27 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 12)	  #Neighbors:   1     (28, [1m[34mH[0m[0m) 


ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 6)	  #Neighbors:   3     (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:  18 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 16)	  #Neighbors:   6     (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 21)	  #Neighbors:   3     (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) 
ID:  22 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 28)	  #Neighbors:   3     (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:  24 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 30)	  #Neighbors:   3     (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (23, [1m[34mH[0m[0m) 
ID:  26 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 7)	  #Neighbors:   5     (8, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (25, [1m[34mH[0m[0m) 
ID:  28 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 12)	  #Neighbors:   5     (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (27, [1m[34mH[0m[0m) 


ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 42)	  #Neighbors:   1     (13, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 5)	  #Neighbors:   4     (0, -) (6, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) 
ID:   9 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (0, 14)	  #Neighbors:   6     (7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (16, [1m[34mH[0m[0m) (18, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) 
ID:  11 ([1m[32mZ[0m[0m, -3Ï€/4)       (Qubit, Col): (0, 30)	  #Neighbors:   9     (6, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (18, [1m[34mH[0m[0m) (22, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 39)	  #Neighbors:   3     (1, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 


ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (8, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 42)	  #Neighbors:   1     (14, [1m[34mH[0m[0m) 
ID:   8 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (1, 14)	  #Neighbors:   7     (2, -) (6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (16, [1m[34mH[0m[0m) (18, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) 
ID:  12 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (1, 32)	  #Neighbors:  12     (6, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (18, [1m[34mH[0m[0m) (20, [1m[34mH[0m[0m) (22, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) 
ID:  14 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 40)	  #Neighbors:   4     (3, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 


ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, [1m[34mH[0m[0m) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 42)	  #Neighbors:   1     (10, [1m[34mH[0m[0m) 
ID:   6 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (2, 2)	  #Neighbors:   6     (4, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:  10 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (2, 24)	  #Neighbors:  12     (5, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (18, [1m[34mH[0m[0m) (20, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) 


qsyn> ver 0
Note: verbose level is set to 0

qsyn> extp -f
Frontier:
Qubit:0: 13
Qubit:1: 14
Qubit:2: 10


qsyn> extp -n
Neighbors:
12
11
6
9
24
18
20
26
28


qsyn> extp -a
Axels:
16 (phase gadget: 15)
18 (phase gadget: 17)
20 (phase gadget: 19)
22 (phase gadget: 21)
24 (phase gadget: 23)
26 (phase gadget: 25)
28 (phase gadget: 27)


qsyn> extr -zx 1 -qc 1 -PH

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  - h( 1)-
Q 2  -td( 3)-- h( 2)-

qsyn> extr -zx 1 -qc 1 -CZ

qsyn> qccp -q
Q 0  -------------------------cz( 4)-- h( 0)-
Q 1  ---------cz( 5)-- h( 1)-
Q 2  ---------cz( 5)----------cz( 4)--td( 3)-- h( 2)-

qsyn> extr -zx 1 -qc 1 -RMG
Gadget(s) are removed

qsyn> qccp -q
Q 0  -------------------------cz( 4)-- h( 0)-
Q 1  ---------cz( 5)-- h( 1)-
Q 2  ---------cz( 5)----------cz( 4)--td( 3)-- h( 2)-

qsyn> extp -f
Frontier:
Qubit:0: 13
Qubit:1: 14
Qubit:2: 29


qsyn> extp -n
Neighbors:
12
11
23


qsyn> extp -m
M2 matrix:
1 0 0 
1 1 0 
0 1 1 


qsyn> extr -zx 1 -qc 1 -CX
Note: frontier is dirty, please clean it first.

qsyn> qccp -q
Q 0  -------------------------cz( 4)-- h( 0)-
Q 1  ---------cz( 5)-- h( 1)-
Q 2  ---------cz( 5)----------cz( 4)--td( 3)-- h( 2)-

qsyn> extr -zx 1 -qc 1 -H
Note: frontier is dirty, please clean it first.

qsyn> qccp -q
Q 0  -------------------------cz( 4)-- h( 0)-
Q 1  ---------cz( 5)-- h( 1)-
Q 2  ---------cz( 5)----------cz( 4)--td( 3)-- h( 2)-

qsyn> extr -zx 1 -qc 1 -L 2

qsyn> qccp -q
Q 0  - h(10)----------cz( 9)-- t( 8)-- h( 7)----------cz( 4)-- h( 0)-
Q 1  - h(11)----------cz( 9)----------cz( 5)-- h( 1)-
Q 2  - h( 6)--------------------------cz( 5)----------cz( 4)--td( 3)-- h( 2)-

qsyn> extr -zx 1 -qc 1 -L 100

qsyn> qccp -q
Q 0  - h(52)--------------------------------------------------------------------------cz(51)-- h(47)--------------------------------------------------cz(45)--------------------------cz(41)--rz(39)-- h(37)------------------cz(34)------------------------------------------cz(29)--------------------------------------------------------------------------cx(20)--------------------------cz(17)-- h(10)--------------------------------------------------cz( 9)-- t( 8)-- h( 7)----------cz( 4)-- h( 0)-
Q 1  - h(60)-- h(59)----------cz(57)--------------------------cz(54)-- h(53)----------cz(51)----------cz(50)--td(49)-- h(48)----------cz(46)-- h(42)-- t(40)-- h(38)------------------------------------------cz(35)-- h(31)----------------------------------cz(30)----------cz(29)--rz(28)-- h(27)----------cz(26)--rz(24)-- h(22)----------cx(21)----------cx(20)----------cz(18)-- h(14)----------------------------------cz(13)-- t(12)-- h(11)----------cz( 9)----------cz( 5)-- h( 1)-
Q 2  - h(58)------------------cz(57)-- z(56)-- h(55)----------cz(54)----------------------------------cz(50)--------------------------cz(46)----------cz(45)--rz(44)-- h(43)----------cz(41)-- h(36)----------cz(35)----------cz(34)--rz(33)-- h(32)----------cz(30)------------------------------------------cz(26)-- t(25)-- h(23)----------cx(21)-- h(19)------------------cz(18)----------cz(17)--rz(16)-- h(15)----------cz(13)-- h( 6)----------------------------------cz( 5)----------cz( 4)--td( 3)-- h( 2)-

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr  

qsyn> zxgp -q

ID: 102 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 71)	  #Neighbors:   1     (103, [1m[34mH[0m[0m) 
ID: 104 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 81)	  #Neighbors:   1     (105, [1m[34mH[0m[0m) 
ID: 106 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 86)	  #Neighbors:   1     (107, [1m[34mH[0m[0m) 
ID: 108 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 93)	  #Neighbors:   1     (109, [1m[34mH[0m[0m) 
ID: 110 ([1m[32mZ[0m[0m, -3Ï€/4)       (Qubit, Col): (-2, 95)	  #Neighbors:   1     (111, [1m[34mH[0m[0m) 
ID: 112 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 72)	  #Neighbors:   1     (113, [1m[34mH[0m[0m) 
ID: 114 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 77)	  #Neighbors:   1     (115, [1m[34mH[0m[0m) 
ID: 116 ([1m[32mZ[0m[0m, 3Ï€/4)        (Qubit, Col): (-2, 54)	  #Neighbors:   1     (117, [1m[34mH[0m[0m) 
ID: 118 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 44)	  #Neighbors:   1     (119, [1m[34mH[0m[0m) 
ID: 120 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 30)	  #Neighbors:   1     (121, [1m[34mH[0m[0m) 
ID: 122 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 10)	  #Neighbors:   1     (123, [1m[34mH[0m[0m) 
ID: 124 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 6)	  #Neighbors:   1     (125, [1m[34mH[0m[0m) 
ID: 126 ([1m[32mZ[0m[0m, -3Ï€/4)       (Qubit, Col): (-2, 51)	  #Neighbors:   1     (127, [1m[34mH[0m[0m) 
ID: 128 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 43)	  #Neighbors:   1     (129, [1m[34mH[0m[0m) 
ID: 130 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 24)	  #Neighbors:   1     (131, [1m[34mH[0m[0m) 


ID: 103 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 71)	  #Neighbors:   3     (2, [1m[34mH[0m[0m) (96, [1m[34mH[0m[0m) (102, [1m[34mH[0m[0m) 
ID: 105 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 81)	  #Neighbors:   6     (2, [1m[34mH[0m[0m) (96, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (104, [1m[34mH[0m[0m) 
ID: 107 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 86)	  #Neighbors:   3     (97, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (106, [1m[34mH[0m[0m) 
ID: 109 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 93)	  #Neighbors:   3     (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (108, [1m[34mH[0m[0m) 
ID: 111 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 95)	  #Neighbors:   3     (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (110, [1m[34mH[0m[0m) 
ID: 113 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 72)	  #Neighbors:   5     (2, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (112, [1m[34mH[0m[0m) 
ID: 115 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 77)	  #Neighbors:   5     (96, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (114, [1m[34mH[0m[0m) 
ID: 117 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 54)	  #Neighbors:   5     (46, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (116, [1m[34mH[0m[0m) 
ID: 119 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 44)	  #Neighbors:   3     (37, [1m[34mH[0m[0m) (46, [1m[34mH[0m[0m) (118, [1m[34mH[0m[0m) 
ID: 121 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 30)	  #Neighbors:   6     (63, [1m[34mH[0m[0m) (80, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (120, [1m[34mH[0m[0m) 
ID: 123 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 10)	  #Neighbors:   3     (63, [1m[34mH[0m[0m) (80, [1m[34mH[0m[0m) (122, [1m[34mH[0m[0m) 
ID: 125 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 6)	  #Neighbors:   5     (63, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (124, [1m[34mH[0m[0m) 
ID: 127 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 51)	  #Neighbors:   5     (37, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (126, [1m[34mH[0m[0m) 
ID: 129 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 43)	  #Neighbors:   6     (37, [1m[34mH[0m[0m) (46, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (128, [1m[34mH[0m[0m) 
ID: 131 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 24)	  #Neighbors:   5     (80, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (130, [1m[34mH[0m[0m) 


ID:   1 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (82, [1m[34mH[0m[0m) 
ID:  82 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   6     (1, [1m[34mH[0m[0m) (63, [1m[34mH[0m[0m) (80, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) 
ID:  88 (â—, 0)           (Qubit, Col): (0, 107)	  #Neighbors:   1     (100, [1m[34mH[0m[0m) 
ID:  96 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (0, 79)	  #Neighbors:   6     (46, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (103, [1m[34mH[0m[0m) (105, [1m[34mH[0m[0m) (115, [1m[34mH[0m[0m) 
ID:  98 ([1m[32mZ[0m[0m, -3Ï€/4)       (Qubit, Col): (0, 95)	  #Neighbors:  19     (37, [1m[34mH[0m[0m) (46, [1m[34mH[0m[0m) (63, [1m[34mH[0m[0m) (74, [1m[34mH[0m[0m) (82, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (101, [1m[34mH[0m[0m) (105, [1m[34mH[0m[0m) (109, [1m[34mH[0m[0m) (111, [1m[34mH[0m[0m) (113, [1m[34mH[0m[0m) (115, [1m[34mH[0m[0m) (117, [1m[34mH[0m[0m) (121, [1m[34mH[0m[0m) (125, [1m[34mH[0m[0m) (127, [1m[34mH[0m[0m) (129, [1m[34mH[0m[0m) (131, [1m[34mH[0m[0m) 
ID: 100 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 104)	  #Neighbors:   3     (88, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) 


ID:   2 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (1, 64)	  #Neighbors:   5     (37, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (103, [1m[34mH[0m[0m) (105, [1m[34mH[0m[0m) (113, [1m[34mH[0m[0m) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (74, [1m[34mH[0m[0m) 
ID:  46 ([1m[32mZ[0m[0m, -3Ï€/4)       (Qubit, Col): (1, 30)	  #Neighbors:   8     (63, [1m[34mH[0m[0m) (96, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (117, [1m[34mH[0m[0m) (119, [1m[34mH[0m[0m) (129, [1m[34mH[0m[0m) 
ID:  74 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 6)	  #Neighbors:   4     (3, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) 
ID:  90 (â—, 0)           (Qubit, Col): (1, 107)	  #Neighbors:   1     (101, [1m[34mH[0m[0m) 
ID:  99 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (1, 97)	  #Neighbors:  22     (2, [1m[34mH[0m[0m) (37, [1m[34mH[0m[0m) (46, [1m[34mH[0m[0m) (63, [1m[34mH[0m[0m) (74, [1m[34mH[0m[0m) (82, [1m[34mH[0m[0m) (96, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (100, [1m[34mH[0m[0m) (101, [1m[34mH[0m[0m) (105, [1m[34mH[0m[0m) (107, [1m[34mH[0m[0m) (109, [1m[34mH[0m[0m) (113, [1m[34mH[0m[0m) (115, [1m[34mH[0m[0m) (117, [1m[34mH[0m[0m) (121, [1m[34mH[0m[0m) (125, [1m[34mH[0m[0m) (127, [1m[34mH[0m[0m) (129, [1m[34mH[0m[0m) (131, [1m[34mH[0m[0m) 
ID: 101 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 105)	  #Neighbors:   4     (90, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) 


ID:   5 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (80, [1m[34mH[0m[0m) 
ID:  37 ([1m[32mZ[0m[0m, 3Ï€/4)        (Qubit, Col): (2, 36)	  #Neighbors:   9     (2, [1m[34mH[0m[0m) (63, [1m[34mH[0m[0m) (80, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (119, [1m[34mH[0m[0m) (127, [1m[34mH[0m[0m) (129, [1m[34mH[0m[0m) 
ID:  63 ([1m[32mZ[0m[0m, 3Ï€/4)        (Qubit, Col): (2, 16)	  #Neighbors:  10     (37, [1m[34mH[0m[0m) (46, [1m[34mH[0m[0m) (80, [1m[34mH[0m[0m) (82, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (121, [1m[34mH[0m[0m) (123, [1m[34mH[0m[0m) (125, [1m[34mH[0m[0m) 
ID:  80 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 4)	  #Neighbors:   7     (5, [1m[34mH[0m[0m) (37, [1m[34mH[0m[0m) (63, [1m[34mH[0m[0m) (82, [1m[34mH[0m[0m) (121, [1m[34mH[0m[0m) (123, [1m[34mH[0m[0m) (131, [1m[34mH[0m[0m) 
ID:  92 (â—, 0)           (Qubit, Col): (2, 107)	  #Neighbors:   1     (97, [1m[34mH[0m[0m) 
ID:  97 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (2, 89)	  #Neighbors:  22     (37, [1m[34mH[0m[0m) (46, [1m[34mH[0m[0m) (63, [1m[34mH[0m[0m) (74, [1m[34mH[0m[0m) (82, [1m[34mH[0m[0m) (92, [1m[34mH[0m[0m) (96, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (100, [1m[34mH[0m[0m) (101, [1m[34mH[0m[0m) (105, [1m[34mH[0m[0m) (107, [1m[34mH[0m[0m) (111, [1m[34mH[0m[0m) (113, [1m[34mH[0m[0m) (115, [1m[34mH[0m[0m) (117, [1m[34mH[0m[0m) (121, [1m[34mH[0m[0m) (125, [1m[34mH[0m[0m) (127, [1m[34mH[0m[0m) (129, [1m[34mH[0m[0m) (131, [1m[34mH[0m[0m) 


qsyn> qq -F

