DV Lab, NTUEE, Qsyn 0.4.0
qsyn> color 0
Note: colored is set to 0

qsyn> zxgread benchmark/bzx/tof3.bzx
Create and checkout to Graph 0

qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -fr

qsyn> zxgp -q

ID:  27 (Z, 7π/4)        (Qubit, Col): (-2, 3)	  #Neighbors:   1     (28, H) 
ID:  29 (Z, 7π/4)        (Qubit, Col): (-2, 7)	  #Neighbors:   1     (30, H) 
ID:  31 (Z, 7π/4)        (Qubit, Col): (-2, 5)	  #Neighbors:   1     (32, H) 
ID:  33 (Z, π/4)         (Qubit, Col): (-2, 5)	  #Neighbors:   1     (34, H) 


ID:  28 (Z, 0)           (Qubit, Col): (-1, 3)	  #Neighbors:   3     (7, H) (19, H) (27, H) 
ID:  30 (Z, 0)           (Qubit, Col): (-1, 7)	  #Neighbors:   3     (10, H) (19, H) (29, H) 
ID:  32 (Z, 0)           (Qubit, Col): (-1, 5)	  #Neighbors:   3     (7, H) (10, H) (31, H) 
ID:  34 (Z, 0)           (Qubit, Col): (-1, 5)	  #Neighbors:   4     (7, H) (10, H) (19, H) (33, H) 


ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (●, 0)           (Qubit, Col): (0, 11)	  #Neighbors:   1     (10, -) 
ID:  10 (Z, π/4)         (Qubit, Col): (0, 1)	  #Neighbors:   5     (0, -) (3, -) (30, H) (32, H) (34, H) 


ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (7, -) 
ID:   4 (●, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   1     (7, -) 
ID:   7 (Z, π/4)         (Qubit, Col): (1, 1)	  #Neighbors:   5     (1, -) (4, -) (28, H) (32, H) (34, H) 


ID:   2 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (19, H) 
ID:   5 (●, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   1     (19, H) 
ID:  19 (Z, π/4)         (Qubit, Col): (2, 9)	  #Neighbors:   5     (2, H) (5, H) (28, H) (30, H) (34, H) 


qsyn> ver 5
Note: verbose level is set to 5

qsyn> zx2qc
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1
Initialize
Note: (0) is not a gadget vertex!
Note: (1) is not a gadget vertex!
Note: (2) is not a gadget vertex!
Note: (3) is not a gadget vertex!
Note: (4) is not a gadget vertex!
Note: (5) is not a gadget vertex!
Note: (6) is not a gadget vertex!
Note: (7) is not a gadget vertex!
Note: (8) is not a gadget vertex!
Note: (10) is not a gadget vertex!
Note: (12) is not a gadget vertex!
Note: (14) is not a gadget vertex!
Note: (16) is not a gadget vertex!
Note: (17) is not a gadget vertex!
Note: (18) is not a gadget vertex!
Note: (19) is not a gadget vertex!
Clean Frontier
Extract Singles
Extract CZs
Remove Gadget
Frontier:
Qubit:0: 7
Qubit:1: 6
Qubit:2: 8

Axels:
10 (phase gadget: Note: (6) is not a gadget vertex!
Note: (8) is not a gadget vertex!
9)
12 (phase gadget: Note: (7) is not a gadget vertex!
Note: (8) is not a gadget vertex!
11)
14 (phase gadget: Note: (6) is not a gadget vertex!
Note: (7) is not a gadget vertex!
13)
16 (phase gadget: Note: (6) is not a gadget vertex!
Note: (7) is not a gadget vertex!
Note: (8) is not a gadget vertex!
15)

Frontier:
Qubit:1: 20
Qubit:0: 21
Qubit:2: 22

Axels:
10 (phase gadget: 9)
Note: (13) is not a gadget vertex!
Note: (11) is not a gadget vertex!

Gadget(s) are removed.
Clean Frontier
Extract Singles
Extract CZs
Remove Gadget
Frontier:
Qubit:0: 21
Qubit:1: 20
Qubit:2: 22

Axels:
10 (phase gadget: 9)
Note: (13) is not a gadget vertex!
Note: (11) is not a gadget vertex!

Frontier:
Qubit:0: 21
Qubit:1: 20
Qubit:2: 22

Axels:
10 (phase gadget: 9)
Note: (13) is not a gadget vertex!
Note: (11) is not a gadget vertex!

Perform Gaussian Elimination.
Update Graph by Matrix
Extract CXs
Add CX: 2 0
Add CX: 2 1
Add CX: 0 2
Add CX: 1 2
Add CX: 0 1
Extract Hs
Clean Frontier
Extract Singles
Extract CZs
Remove Gadget
Frontier:
Qubit:0: 13
Qubit:1: 11
Qubit:2: 15

Axels:
10 (phase gadget: 9)
Note: (13) is not a gadget vertex!
Note: (11) is not a gadget vertex!

Frontier:
Qubit:1: 11
Qubit:2: 15
Qubit:0: 23

Axels:

Gadget(s) are removed.
Clean Frontier
Extract Singles
Extract CZs
Remove Gadget
Frontier:
Qubit:0: 23
Qubit:1: 11
Qubit:2: 15

Axels:

Frontier:
Qubit:0: 23
Qubit:1: 11
Qubit:2: 15

Axels:

Construct an easy matrix.
Extract Hs
Clean Frontier
Extract Singles
Extract CZs
Remove Gadget
Frontier:
Qubit:0: 9
Qubit:1: 11
Qubit:2: 15

Axels:

Frontier:
Qubit:0: 9
Qubit:1: 11
Qubit:2: 15

Axels:

Perform Gaussian Elimination.
Update Graph by Matrix
Extract CXs
Add CX: 2 0
Add CX: 1 2
Add CX: 0 1
Extract Hs
Clean Frontier
Extract Singles
Extract CZs
Finish extracting!
Permute Qubit
Create and checkout to QCir 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qc2zx 

qsyn> zxgadj 

qsyn> zxcomp 0

qsyn> zxgs -fr    

qsyn> zxgp -q

ID:   1 (●, 0)           (Qubit, Col): (0, 22)	  #Neighbors:   1     (54, -) 
ID:  54 (●, 0)           (Qubit, Col): (0, 12)	  #Neighbors:   1     (1, -) 


ID:   3 (●, 0)           (Qubit, Col): (1, 22)	  #Neighbors:   1     (55, -) 
ID:  55 (●, 0)           (Qubit, Col): (1, 12)	  #Neighbors:   1     (3, -) 


ID:   5 (●, 0)           (Qubit, Col): (2, 22)	  #Neighbors:   1     (56, -) 
ID:  56 (●, 0)           (Qubit, Col): (2, 12)	  #Neighbors:   1     (5, -) 


qsyn> qccp
QCir 0( 3 qubits, 33 gates)

qsyn> qccp -q
Q 0  - h(28)-- h(25)------------------cx(24)----------cx(22)--td(21)-- h(20)--cz(19)-- h(18)--td(15)-- h(12)--cx(11)----------cx( 9)----------cx( 7)-- h( 4)-- t( 0)-
Q 1  -cx(32)--cx(31)--cx(30)-- h(26)--cx(24)--cx(23)--------------------------cz(19)--td(16)-- h(13)----------cx(11)--cx(10)----------cx( 8)-- h( 5)-- t( 1)-
Q 2  -cx(32)--cx(31)--cx(30)-- h(29)-- h(27)--cx(23)--cx(22)-- t(17)-- h(14)------------------------------------------cx(10)--cx( 9)--cx( 8)--cx( 7)-- h( 6)-- t( 3)-- h( 2)-

qsyn> zxgt -id
The graph is an identity!

qsyn> qc2ts
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

