DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/benchmark_SABRE/small/3_17_13.qasm
Create and checkout to QCir 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> extp -f
Error: ZX-graph (id: 0) is not graph-like. Not extractable!!

qsyn> zxgs -fr

All rules applied in order:
Hadamard Rule                 1 iterations.
  1) 4 matches
Spider Fusion Rule            3 iterations.
  1) 10 matches
  2) 3 matches
  3) 2 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    2 iterations.
  1) 2 matches
  2) 1 matches
Pivot Gadget Rule             3 iterations.
  1) 6 matches
  2) 2 matches
  3) 1 matches
Phase Gadget Rule             1 iterations.
  1) 1 matches
Local Complementation Rule    2 iterations.
  1) 1 matches
  2) 1 matches

qsyn> zxcopy 1
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1

qsyn> qcn
Create and checkout to QCir 1

qsyn> qcba 3

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> zxgp -q

ID:  17 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (-2, 3)	  #Neighbors:   1     (18, [1m[34mH[0m[0m) 
ID:  19 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (-2, 4)	  #Neighbors:   1     (20, [1m[34mH[0m[0m) 
ID:  21 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (-2, 7)	  #Neighbors:   1     (22, [1m[34mH[0m[0m) 
ID:  23 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (-2, 11)	  #Neighbors:   1     (24, [1m[34mH[0m[0m) 
ID:  25 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (-2, 14)	  #Neighbors:   1     (26, [1m[34mH[0m[0m) 
ID:  27 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (-2, 18)	  #Neighbors:   1     (28, [1m[34mH[0m[0m) 
ID:  29 ([1m[32mZ[0m[0m, 3π/4)        (Qubit, Col): (-2, 7)	  #Neighbors:   1     (30, [1m[34mH[0m[0m) 


ID:  18 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 3)	  #Neighbors:   3     (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 4)	  #Neighbors:   5     (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) 
ID:  22 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 7)	  #Neighbors:   5     (9, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:  24 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 11)	  #Neighbors:   3     (11, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (23, [1m[34mH[0m[0m) 
ID:  26 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 14)	  #Neighbors:   3     (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (25, [1m[34mH[0m[0m) 
ID:  28 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 18)	  #Neighbors:   3     (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (27, [1m[34mH[0m[0m) 
ID:  30 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 7)	  #Neighbors:   6     (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 


ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 23)	  #Neighbors:   1     (14, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   6     (0, -) (6, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 
ID:   9 ([1m[32mZ[0m[0m, 5π/4)        (Qubit, Col): (0, 8)	  #Neighbors:   7     (6, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (18, [1m[34mH[0m[0m) (22, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:  12 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (0, 16)	  #Neighbors:  12     (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (16, [1m[34mH[0m[0m) (20, [1m[34mH[0m[0m) (22, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:  14 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 21)	  #Neighbors:   3     (1, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 


ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (8, [1m[34mH[0m[0m) 
ID:   3 (●, 0)           (Qubit, Col): (1, 23)	  #Neighbors:   1     (15, [1m[34mH[0m[0m) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 3)	  #Neighbors:   6     (2, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 
ID:  11 ([1m[32mZ[0m[0m, π/4)         (Qubit, Col): (1, 16)	  #Neighbors:  11     (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (20, [1m[34mH[0m[0m) (22, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:  15 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 22)	  #Neighbors:   4     (3, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 


ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, [1m[34mH[0m[0m) 
ID:   5 (●, 0)           (Qubit, Col): (2, 23)	  #Neighbors:   1     (16, -) 
ID:   6 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (2, 1)	  #Neighbors:   4     (4, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:  10 ([1m[32mZ[0m[0m, 3π/4)        (Qubit, Col): (2, 9)	  #Neighbors:   8     (6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (18, [1m[34mH[0m[0m) (20, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:  13 ([1m[32mZ[0m[0m, 7π/4)        (Qubit, Col): (2, 17)	  #Neighbors:  11     (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (16, [1m[34mH[0m[0m) (20, [1m[34mH[0m[0m) (22, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 22)	  #Neighbors:   3     (5, -) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 


qsyn> ver 0
Note: verbose level is set to 0

qsyn> extp -f
Frontier:
Qubit:0: 14
Qubit:1: 15
Qubit:2: 16


qsyn> extp -n
Neighbors:
11
13
12


qsyn> extp -a
Axels:
18 (phase gadget: 17)
20 (phase gadget: 19)
22 (phase gadget: 21)
24 (phase gadget: 23)
26 (phase gadget: 25)
28 (phase gadget: 27)
30 (phase gadget: 29)


qsyn> extr -zx 1 -qc 1 -PH

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  - h( 1)-
Q 2  

qsyn> extr -zx 1 -qc 1 -CZ

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  - h( 1)-
Q 2  

qsyn> extr -zx 1 -qc 1 -RMG
No gadget(s) are found

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  - h( 1)-
Q 2  

qsyn> extp -f
Frontier:
Qubit:0: 14
Qubit:1: 15
Qubit:2: 16


qsyn> extp -n
Neighbors:
11
13
12


qsyn> extp -m
M2 matrix:
1 1 0 
1 1 1 
0 1 1 


qsyn> extr -zx 1 -qc 1 -CX

qsyn> qccp -q
Q 0  -cx( 5)------------------cx( 2)-- h( 0)-
Q 1  -cx( 5)--cx( 4)--cx( 3)--cx( 2)-- h( 1)-
Q 2  ---------cx( 4)--cx( 3)-

qsyn> extr -zx 1 -qc 1 -H

qsyn> qccp -q
Q 0  - h( 6)--cx( 5)------------------cx( 2)-- h( 0)-
Q 1  - h( 7)--cx( 5)--cx( 4)--cx( 3)--cx( 2)-- h( 1)-
Q 2  - h( 8)----------cx( 4)--cx( 3)-

qsyn> extr -zx 1 -qc 1 -L 2

qsyn> qccp -q
Q 0  -----------------------------------------cx(22)----------cx(20)------------------cx(17)--cx(16)-- h(13)--cz(12)-- t( 9)-- h( 6)--cx( 5)------------------cx( 2)-- h( 0)-
Q 1  - h(29)--cz(28)-- h(27)--td(25)-- h(23)--cx(22)--cx(21)----------cx(19)--cx(18)----------cx(16)-- h(14)--td(10)-- h( 7)----------cx( 5)--cx( 4)--cx( 3)--cx( 2)-- h( 1)-
Q 2  - h(30)--cz(28)-- t(26)-- h(24)------------------cx(21)--cx(20)--cx(19)--cx(18)--cx(17)-- h(15)----------cz(12)-- t(11)-- h( 8)----------cx( 4)--cx( 3)-

qsyn> extr -zx 1 -qc 1 -L 100

qsyn> qccp -q
Q 0  - h(61)-- h(60)--cz(57)------------------cz(53)-- h(50)--cz(49)--td(48)-- h(47)--cz(45)-- h(41)-- t(38)-- h(36)--------------------------cz(33)--------------------------------------------------cx(22)----------cx(20)------------------cx(17)--cx(16)-- h(13)--cz(12)-- t( 9)-- h( 6)--cx( 5)------------------cx( 2)-- h( 0)-
Q 1  - h(58)-- h(54)--rz(52)-- h(51)--------------------------cz(49)--cz(46)-- h(42)--------------------------cz(40)--rz(39)-- h(37)--cz(34)-- t(31)-- h(29)----------cz(28)-- h(27)--td(25)-- h(23)--cx(22)--cx(21)----------cx(19)--cx(18)----------cx(16)-- h(14)--td(10)-- h( 7)----------cx( 5)--cx( 4)--cx( 3)--cx( 2)-- h( 1)-
Q 2  - h(59)----------cz(57)-- z(56)-- h(55)--cz(53)------------------cz(46)----------cz(45)-- t(44)-- h(43)--cz(40)-- h(35)----------cz(34)--cz(33)--rz(32)-- h(30)--cz(28)-- t(26)-- h(24)------------------cx(21)--cx(20)--cx(19)--cx(18)--cx(17)-- h(15)----------cz(12)-- t(11)-- h( 8)----------cx( 4)--cx( 3)-

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr  

All rules applied in order:
Hadamard Rule                 2 iterations.
Spider Fusion Rule            3 iterations.
Identity Removal Rule         1 iterations.
Spider Fusion Rule            1 iterations.
Pivot Rule                    1 iterations.
Pivot Gadget Rule             4 iterations.
Identity Removal Rule         1 iterations.
Spider Fusion Rule            1 iterations.
Pivot Rule                    2 iterations.
Identity Removal Rule         1 iterations.
Spider Fusion Rule            1 iterations.
Pivot Rule                    2 iterations.
Identity Removal Rule         1 iterations.
Spider Fusion Rule            1 iterations.
Pivot Boundary Rule           1 iterations.
Identity Removal Rule         1 iterations.
Spider Fusion Rule            1 iterations.
Pivot Rule                    3 iterations.
Identity Removal Rule         1 iterations.
Spider Fusion Rule            1 iterations.
Pivot Rule                    3 iterations.
Identity Removal Rule         2 iterations.
Spider Fusion Rule            1 iterations.
Identity Removal Rule         1 iterations.

qsyn> zxgp -q

ID:   1 (●, 0)           (Qubit, Col): (0, 41)	  #Neighbors:   1     (90, -) 
ID:  90 (●, 0)           (Qubit, Col): (0, 24)	  #Neighbors:   1     (1, -) 


ID:   3 (●, 0)           (Qubit, Col): (1, 41)	  #Neighbors:   1     (92, -) 
ID:  92 (●, 0)           (Qubit, Col): (1, 24)	  #Neighbors:   1     (3, -) 


ID:   5 (●, 0)           (Qubit, Col): (2, 41)	  #Neighbors:   1     (94, -) 
ID:  94 (●, 0)           (Qubit, Col): (2, 24)	  #Neighbors:   1     (5, -) 


qsyn> qq -F

