DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/benchmark_SABRE/small/3_17_13.qasm
Create and checkout to QCir 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> extp -f
Error: ZX-graph (id: 0) is not graph-like. Not extractable!!

qsyn> zxgs -fr

All rules applied in order:
Hadamard Rule                 1 iterations.
  1) 4 matches
Spider Fusion Rule            3 iterations.
  1) 10 matches
  2) 3 matches
  3) 2 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Pivot Rule                    2 iterations.
  1) 2 matches
  2) 1 matches
Pivot Gadget Rule             3 iterations.
  1) 6 matches
  2) 2 matches
  3) 1 matches
Phase Gadget Rule             1 iterations.
  1) 1 matches
Local Complementation Rule    2 iterations.
  1) 1 matches
  2) 1 matches

qsyn> zxcopy 1
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1

qsyn> qcn
Create and checkout to QCir 1

qsyn> qcba 3

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> zxgp -q

ID:  17 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 4)	  #Neighbors:   1     (18, [1m[34mH[0m[0m) 
ID:  19 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 5)	  #Neighbors:   1     (20, [1m[34mH[0m[0m) 
ID:  21 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (-2, 8)	  #Neighbors:   1     (22, [1m[34mH[0m[0m) 
ID:  23 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 12)	  #Neighbors:   1     (24, [1m[34mH[0m[0m) 
ID:  25 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 15)	  #Neighbors:   1     (26, [1m[34mH[0m[0m) 
ID:  27 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (-2, 19)	  #Neighbors:   1     (28, [1m[34mH[0m[0m) 
ID:  29 ([1m[32mZ[0m[0m, 3Ï€/4)        (Qubit, Col): (-2, 8)	  #Neighbors:   1     (30, [1m[34mH[0m[0m) 


ID:  18 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 4)	  #Neighbors:   3     (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (17, [1m[34mH[0m[0m) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 5)	  #Neighbors:   5     (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (19, [1m[34mH[0m[0m) 
ID:  22 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 8)	  #Neighbors:   5     (9, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (21, [1m[34mH[0m[0m) 
ID:  24 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 12)	  #Neighbors:   3     (11, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (23, [1m[34mH[0m[0m) 
ID:  26 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 15)	  #Neighbors:   3     (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (25, [1m[34mH[0m[0m) 
ID:  28 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 19)	  #Neighbors:   3     (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (27, [1m[34mH[0m[0m) 
ID:  30 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 8)	  #Neighbors:   6     (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (29, [1m[34mH[0m[0m) 


ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 24)	  #Neighbors:   1     (14, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 3)	  #Neighbors:   6     (0, -) (6, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 
ID:   9 ([1m[32mZ[0m[0m, 5Ï€/4)        (Qubit, Col): (0, 9)	  #Neighbors:   7     (6, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (18, [1m[34mH[0m[0m) (22, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:  12 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (0, 17)	  #Neighbors:  12     (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (16, [1m[34mH[0m[0m) (20, [1m[34mH[0m[0m) (22, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:  14 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 22)	  #Neighbors:   3     (1, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 


ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (8, [1m[34mH[0m[0m) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 24)	  #Neighbors:   1     (15, [1m[34mH[0m[0m) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 4)	  #Neighbors:   6     (2, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 
ID:  11 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (1, 17)	  #Neighbors:  11     (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (20, [1m[34mH[0m[0m) (22, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) (28, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:  15 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 23)	  #Neighbors:   4     (3, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 


ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, [1m[34mH[0m[0m) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 24)	  #Neighbors:   1     (16, -) 
ID:   6 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (2, 2)	  #Neighbors:   4     (4, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:  10 ([1m[32mZ[0m[0m, 3Ï€/4)        (Qubit, Col): (2, 10)	  #Neighbors:   8     (6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (18, [1m[34mH[0m[0m) (20, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:  13 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (2, 18)	  #Neighbors:  11     (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (16, [1m[34mH[0m[0m) (20, [1m[34mH[0m[0m) (22, [1m[34mH[0m[0m) (24, [1m[34mH[0m[0m) (26, [1m[34mH[0m[0m) (30, [1m[34mH[0m[0m) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 23)	  #Neighbors:   3     (5, -) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) 


qsyn> ver 0
Note: verbose level is set to 0

qsyn> extp -f
Frontier:
Qubit:0: 14
Qubit:1: 15
Qubit:2: 16


qsyn> extp -n
Neighbors:
11
13
12


qsyn> extp -a
Axels:
18 (phase gadget: 17)
20 (phase gadget: 19)
22 (phase gadget: 21)
24 (phase gadget: 23)
26 (phase gadget: 25)
28 (phase gadget: 27)
30 (phase gadget: 29)


qsyn> extr -zx 1 -qc 1 -PH

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  - h( 1)-
Q 2  

qsyn> extr -zx 1 -qc 1 -CZ

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  - h( 1)-
Q 2  

qsyn> extr -zx 1 -qc 1 -RMG
No gadget(s) are found

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  - h( 1)-
Q 2  

qsyn> extp -f
Frontier:
Qubit:0: 14
Qubit:1: 15
Qubit:2: 16


qsyn> extp -n
Neighbors:
11
13
12


qsyn> extp -m
M2 matrix:
1 1 0 
1 1 1 
0 1 1 


qsyn> extr -zx 1 -qc 1 -CX

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  - h( 1)-
Q 2  

qsyn> extr -zx 1 -qc 1 -H

qsyn> qccp -q
Q 0  - h( 2)-- h( 0)-
Q 1  - h( 3)-- h( 1)-
Q 2  - h( 4)-

qsyn> extr -zx 1 -qc 1 -L 2

qsyn> qccp -q
Q 0  - h(24)--cz(22)-- h(21)--td(19)-- h(17)--cx(16)--cx(15)------------------cx(12)-- h( 9)--cz( 8)-- t( 5)-- h( 2)-- h( 0)-
Q 1  - h(23)--cz(22)-- t(20)-- h(18)------------------cx(15)--cx(14)--cx(13)-- h(10)----------cz( 8)-- t( 6)-- h( 3)-- h( 1)-
Q 2  -----------------------------------------cx(16)----------cx(14)--cx(13)--cx(12)-- h(11)--td( 7)-- h( 4)-

qsyn> extr -zx 1 -qc 1 -L 100

qsyn> qccp -q
Q 0  - h(53)-- h(49)--rz(46)-- h(44)--------------------------cz(43)--------------------------cz(39)-- h(35)----------cz(34)--rz(32)-- h(30)--cz(27)-- t(25)-- h(24)--cz(22)-- h(21)--td(19)-- h(17)--cx(16)--cx(15)------------------cx(12)-- h( 9)--cz( 8)-- t( 5)-- h( 2)-- h( 0)-
Q 1  - h(52)----------cz(51)-- z(50)-- h(48)--cz(47)----------------------------------cz(40)--cz(39)-- t(38)-- h(37)--cz(34)-- h(29)--cz(28)--cz(27)--rz(26)-- h(23)--cz(22)-- t(20)-- h(18)------------------cx(15)--cx(14)--cx(13)-- h(10)----------cz( 8)-- t( 6)-- h( 3)-- h( 1)-
Q 2  - h(55)-- h(54)--cz(51)------------------cz(47)-- h(45)--cz(43)--td(42)-- h(41)--cz(40)-- h(36)-- t(33)-- h(31)------------------cz(28)----------------------------------------------------------cx(16)----------cx(14)--cx(13)--cx(12)-- h(11)--td( 7)-- h( 4)-

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr  

qsyn> zxgp -q

ID:  94 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 5)	  #Neighbors:   1     (95, [1m[34mH[0m[0m) 
ID:  96 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 6)	  #Neighbors:   1     (97, [1m[34mH[0m[0m) 
ID:  98 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (-2, 9)	  #Neighbors:   1     (99, [1m[34mH[0m[0m) 
ID: 100 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 13)	  #Neighbors:   1     (101, [1m[34mH[0m[0m) 
ID: 102 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 16)	  #Neighbors:   1     (103, [1m[34mH[0m[0m) 
ID: 104 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (-2, 20)	  #Neighbors:   1     (105, [1m[34mH[0m[0m) 
ID: 106 ([1m[32mZ[0m[0m, 3Ï€/4)        (Qubit, Col): (-2, 9)	  #Neighbors:   1     (107, [1m[34mH[0m[0m) 
ID: 108 ([1m[32mZ[0m[0m, 5Ï€/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (109, [1m[34mH[0m[0m) 
ID: 110 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (-2, 14)	  #Neighbors:   1     (111, [1m[34mH[0m[0m) 
ID: 112 ([1m[32mZ[0m[0m, 5Ï€/4)        (Qubit, Col): (-2, 18)	  #Neighbors:   1     (113, [1m[34mH[0m[0m) 
ID: 114 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 24)	  #Neighbors:   1     (115, [1m[34mH[0m[0m) 
ID: 116 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 18)	  #Neighbors:   1     (117, [1m[34mH[0m[0m) 
ID: 118 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (-2, 19)	  #Neighbors:   1     (119, [1m[34mH[0m[0m) 
ID: 120 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (-2, 22)	  #Neighbors:   1     (121, [1m[34mH[0m[0m) 
ID: 122 ([1m[32mZ[0m[0m, 5Ï€/4)        (Qubit, Col): (-2, 9)	  #Neighbors:   1     (123, [1m[34mH[0m[0m) 


ID:  95 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 5)	  #Neighbors:   3     (86, [1m[34mH[0m[0m) (87, [1m[34mH[0m[0m) (94, [1m[34mH[0m[0m) 
ID:  97 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 6)	  #Neighbors:   5     (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (87, [1m[34mH[0m[0m) (96, [1m[34mH[0m[0m) 
ID:  99 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 9)	  #Neighbors:   5     (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (86, [1m[34mH[0m[0m) (98, [1m[34mH[0m[0m) 
ID: 101 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 13)	  #Neighbors:   5     (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (89, [1m[34mH[0m[0m) (100, [1m[34mH[0m[0m) 
ID: 103 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 16)	  #Neighbors:   3     (89, [1m[34mH[0m[0m) (90, [1m[34mH[0m[0m) (102, [1m[34mH[0m[0m) 
ID: 105 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 20)	  #Neighbors:   5     (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (90, [1m[34mH[0m[0m) (104, [1m[34mH[0m[0m) 
ID: 107 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 9)	  #Neighbors:   6     (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (86, [1m[34mH[0m[0m) (87, [1m[34mH[0m[0m) (106, [1m[34mH[0m[0m) 
ID: 109 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   5     (13, [1m[34mH[0m[0m) (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (108, [1m[34mH[0m[0m) 
ID: 111 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 14)	  #Neighbors:   6     (13, [1m[34mH[0m[0m) (35, [1m[34mH[0m[0m) (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (110, [1m[34mH[0m[0m) 
ID: 113 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 18)	  #Neighbors:   3     (13, [1m[34mH[0m[0m) (35, [1m[34mH[0m[0m) (112, [1m[34mH[0m[0m) 
ID: 115 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 24)	  #Neighbors:   3     (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (114, [1m[34mH[0m[0m) 
ID: 117 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 18)	  #Neighbors:   6     (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (89, [1m[34mH[0m[0m) (90, [1m[34mH[0m[0m) (116, [1m[34mH[0m[0m) 
ID: 119 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 19)	  #Neighbors:   3     (61, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (118, [1m[34mH[0m[0m) 
ID: 121 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 22)	  #Neighbors:   3     (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (120, [1m[34mH[0m[0m) 
ID: 123 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 9)	  #Neighbors:   5     (35, [1m[34mH[0m[0m) (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (122, [1m[34mH[0m[0m) 


ID:   1 (â—, 0)           (Qubit, Col): (0, 36)	  #Neighbors:   1     (64, -) 
ID:  35 ([1m[32mZ[0m[0m, 3Ï€/4)        (Qubit, Col): (0, 16)	  #Neighbors:   7     (13, [1m[34mH[0m[0m) (61, [1m[34mH[0m[0m) (86, [1m[34mH[0m[0m) (87, [1m[34mH[0m[0m) (111, [1m[34mH[0m[0m) (113, [1m[34mH[0m[0m) (123, [1m[34mH[0m[0m) 
ID:  64 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (0, 30)	  #Neighbors:  18     (1, -) (61, [1m[34mH[0m[0m) (86, [1m[34mH[0m[0m) (87, [1m[34mH[0m[0m) (89, [1m[34mH[0m[0m) (91, [1m[34mH[0m[0m) (92, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (101, [1m[34mH[0m[0m) (105, [1m[34mH[0m[0m) (107, [1m[34mH[0m[0m) (109, [1m[34mH[0m[0m) (111, [1m[34mH[0m[0m) (115, [1m[34mH[0m[0m) (117, [1m[34mH[0m[0m) (121, [1m[34mH[0m[0m) (123, [1m[34mH[0m[0m) 
ID:  78 (â—, 0)           (Qubit, Col): (0, 25)	  #Neighbors:   1     (91, [1m[34mH[0m[0m) 
ID:  86 ([1m[32mZ[0m[0m, 5Ï€/4)        (Qubit, Col): (0, 10)	  #Neighbors:  10     (13, [1m[34mH[0m[0m) (35, [1m[34mH[0m[0m) (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (89, [1m[34mH[0m[0m) (90, [1m[34mH[0m[0m) (95, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (107, [1m[34mH[0m[0m) 
ID:  89 ([1m[32mZ[0m[0m, 5Ï€/4)        (Qubit, Col): (0, 18)	  #Neighbors:  10     (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (86, [1m[34mH[0m[0m) (90, [1m[34mH[0m[0m) (91, [1m[34mH[0m[0m) (93, [1m[34mH[0m[0m) (101, [1m[34mH[0m[0m) (103, [1m[34mH[0m[0m) (117, [1m[34mH[0m[0m) 
ID:  91 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 23)	  #Neighbors:   5     (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (78, [1m[34mH[0m[0m) (89, [1m[34mH[0m[0m) 


ID:   3 (â—, 0)           (Qubit, Col): (1, 36)	  #Neighbors:   1     (61, -) 
ID:  13 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (1, 7)	  #Neighbors:   6     (35, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (86, [1m[34mH[0m[0m) (109, [1m[34mH[0m[0m) (111, [1m[34mH[0m[0m) (113, [1m[34mH[0m[0m) 
ID:  61 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (1, 29)	  #Neighbors:  19     (3, -) (35, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (86, [1m[34mH[0m[0m) (87, [1m[34mH[0m[0m) (89, [1m[34mH[0m[0m) (91, [1m[34mH[0m[0m) (92, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (101, [1m[34mH[0m[0m) (105, [1m[34mH[0m[0m) (107, [1m[34mH[0m[0m) (109, [1m[34mH[0m[0m) (111, [1m[34mH[0m[0m) (115, [1m[34mH[0m[0m) (117, [1m[34mH[0m[0m) (119, [1m[34mH[0m[0m) (123, [1m[34mH[0m[0m) 
ID:  80 (â—, 0)           (Qubit, Col): (1, 25)	  #Neighbors:   1     (92, [1m[34mH[0m[0m) 
ID:  92 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 24)	  #Neighbors:   4     (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (80, [1m[34mH[0m[0m) 


ID:   5 (â—, 0)           (Qubit, Col): (2, 36)	  #Neighbors:   1     (75, [1m[34mH[0m[0m) 
ID:  75 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 32)	  #Neighbors:  18     (5, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (86, [1m[34mH[0m[0m) (87, [1m[34mH[0m[0m) (89, [1m[34mH[0m[0m) (91, [1m[34mH[0m[0m) (92, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (99, [1m[34mH[0m[0m) (101, [1m[34mH[0m[0m) (105, [1m[34mH[0m[0m) (107, [1m[34mH[0m[0m) (109, [1m[34mH[0m[0m) (111, [1m[34mH[0m[0m) (117, [1m[34mH[0m[0m) (119, [1m[34mH[0m[0m) (121, [1m[34mH[0m[0m) (123, [1m[34mH[0m[0m) 
ID:  82 (â—, 0)           (Qubit, Col): (2, 25)	  #Neighbors:   1     (93, -) 
ID:  87 ([1m[32mZ[0m[0m, 3Ï€/4)        (Qubit, Col): (2, 11)	  #Neighbors:   8     (35, [1m[34mH[0m[0m) (61, [1m[34mH[0m[0m) (64, [1m[34mH[0m[0m) (75, [1m[34mH[0m[0m) (90, [1m[34mH[0m[0m) (95, [1m[34mH[0m[0m) (97, [1m[34mH[0m[0m) (107, [1m[34mH[0m[0m) 
ID:  90 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (2, 19)	  #Neighbors:   7     (86, [1m[34mH[0m[0m) (87, [1m[34mH[0m[0m) (89, [1m[34mH[0m[0m) (93, [1m[34mH[0m[0m) (103, [1m[34mH[0m[0m) (105, [1m[34mH[0m[0m) (117, [1m[34mH[0m[0m) 
ID:  93 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 24)	  #Neighbors:   3     (82, -) (89, [1m[34mH[0m[0m) (90, [1m[34mH[0m[0m) 


qsyn> qq -F

