DV Lab, NTUEE, Qsyn 0.3.0
qsyn> zxgread -bzx benchmark/bzx/eqc2-1.bzx
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgp -v

ID:	0	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	2	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (4, -) (7, -) 
ID:	4	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (3, -) (5, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(4, -) (6, -) (8, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(2, -) (5, -) (11, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(3, -) (8, -) (13, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(5, -) (7, -) (9, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(8, -) (10, -) (14, -) 
ID:	10	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(9, -) (11, -) (12, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(6, -) (10, -) (16, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	5	Phase:	œÄ/7	#Neighbors:	1	(10, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(7, -) (14, -) (17, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(9, -) (13, -) (15, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(14, -) (16, [1m[34mH[0m[0m) (18, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(11, -) (15, [1m[34mH[0m[0m) (21, -) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(13, -) (18, -) (19, -) 
ID:	18	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(15, -) (17, -) (20, -) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(17, -) (22, -) (24, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(18, -) (22, -) (25, -) 
ID:	21	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(16, -) (22, -) (26, -) 
ID:	22	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	4	(19, -) (20, -) (21, -) (23, -) 
ID:	23	VertexType:	[1m[32mZ[0m[0m	Qubit:	5	Phase:	œÄ/7	#Neighbors:	1	(22, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(19, -) (25, -) (29, -) 
ID:	25	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(20, -) (24, -) (27, -) 
ID:	26	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	2	(21, -) (28, -) 
ID:	27	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	œÄ/7	#Neighbors:	2	(25, -) (30, -) 
ID:	28	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	13œÄ/7	#Neighbors:	2	(26, -) (33, -) 
ID:	29	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(24, -) (30, -) (31, -) 
ID:	30	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(27, -) (29, -) (32, -) 
ID:	31	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(29, -) 
ID:	32	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(30, -) 
ID:	33	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(28, -) 
Total #Vertices: 34


qsyn> zxgread -bzx benchmark/bzx/eqc2-2.bzx
Successfully generated Graph 1
Checkout to Graph 1

qsyn> zxgp -v

ID:	0	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (4, -) (8, -) 
ID:	4	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(2, -) (3, -) (6, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (6, -) (7, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(4, -) (5, -) (11, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(5, -) (8, -) (9, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (7, -) (10, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(7, -) (12, -) (13, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(8, -) (12, -) (14, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(6, -) (12, -) (17, -) 
ID:	12	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	4	(9, -) (10, -) (11, -) (15, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(9, -) (14, -) (18, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(10, -) (13, -) (16, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	5	Phase:	œÄ/7	#Neighbors:	1	(12, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(14, -) (17, [1m[34mH[0m[0m) (21, -) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(11, -) (16, [1m[34mH[0m[0m) (19, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(13, -) (19, [1m[34mH[0m[0m) (20, -) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(17, -) (18, [1m[34mH[0m[0m) (24, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(18, -) (21, -) (26, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(16, -) (20, -) (22, -) 
ID:	22	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(21, -) (23, -) (27, -) 
ID:	23	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(22, -) (24, -) (25, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(19, -) (23, -) (31, -) 
ID:	25	VertexType:	[1m[32mZ[0m[0m	Qubit:	5	Phase:	œÄ/7	#Neighbors:	1	(23, -) 
ID:	26	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(20, -) (27, -) (28, -) 
ID:	27	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(22, -) (26, -) (30, -) 
ID:	28	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(26, -) (29, -) (34, -) 
ID:	29	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(28, -) (30, -) (32, -) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(27, -) (29, -) (35, -) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	œÄ/7	#Neighbors:	2	(24, -) (33, -) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	5	Phase:	œÄ/7	#Neighbors:	1	(29, -) 
ID:	33	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	2	(31, -) (36, -) 
ID:	34	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(28, -) 
ID:	35	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(30, -) 
ID:	36	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(33, -) 
Total #Vertices: 37


qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgp -v

ID:	0	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(5, -) (37, -) 
ID:	1	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(3, -) (38, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	2	(4, -) (39, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (4, -) (8, -) 
ID:	4	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(2, -) (3, -) (6, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (6, -) (7, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(4, -) (5, -) (11, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(5, -) (8, -) (9, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (7, -) (10, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(7, -) (12, -) (13, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(8, -) (12, -) (14, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(6, -) (12, -) (17, -) 
ID:	12	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	4	(9, -) (10, -) (11, -) (15, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(9, -) (14, -) (18, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(10, -) (13, -) (16, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	5	Phase:	13œÄ/7	#Neighbors:	1	(12, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(14, -) (17, [1m[34mH[0m[0m) (21, -) 
ID:	17	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(11, -) (16, [1m[34mH[0m[0m) (19, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(13, -) (19, [1m[34mH[0m[0m) (20, -) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(17, -) (18, [1m[34mH[0m[0m) (24, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(18, -) (21, -) (26, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(16, -) (20, -) (22, -) 
ID:	22	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(21, -) (23, -) (27, -) 
ID:	23	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(22, -) (24, -) (25, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(19, -) (23, -) (31, -) 
ID:	25	VertexType:	[1m[32mZ[0m[0m	Qubit:	5	Phase:	13œÄ/7	#Neighbors:	1	(23, -) 
ID:	26	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(20, -) (27, -) (28, -) 
ID:	27	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(22, -) (26, -) (30, -) 
ID:	28	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(26, -) (29, -) (34, -) 
ID:	29	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(28, -) (30, -) (32, -) 
ID:	30	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(27, -) (29, -) (35, -) 
ID:	31	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	13œÄ/7	#Neighbors:	2	(24, -) (33, -) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	5	Phase:	13œÄ/7	#Neighbors:	1	(29, -) 
ID:	33	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	2	(31, -) (36, -) 
ID:	34	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(28, -) 
ID:	35	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(30, -) 
ID:	36	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(33, -) 
ID:	37	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (40, -) 
ID:	38	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(1, -) (41, -) 
ID:	39	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	2	(2, -) (43, -) 
ID:	40	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(37, -) (41, -) (44, -) 
ID:	41	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(38, -) (40, -) (42, -) 
ID:	42	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(41, -) (43, -) (45, -) 
ID:	43	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(39, -) (42, -) (48, -) 
ID:	44	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(40, -) (45, -) (50, -) 
ID:	45	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(42, -) (44, -) (46, -) 
ID:	46	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(45, -) (47, -) (51, -) 
ID:	47	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(46, -) (48, -) (49, -) 
ID:	48	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(43, -) (47, -) (53, -) 
ID:	49	VertexType:	[1m[32mZ[0m[0m	Qubit:	5	Phase:	œÄ/7	#Neighbors:	1	(47, -) 
ID:	50	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(44, -) (51, -) (54, -) 
ID:	51	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(46, -) (50, -) (52, -) 
ID:	52	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(51, -) (53, [1m[34mH[0m[0m) (55, -) 
ID:	53	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(48, -) (52, [1m[34mH[0m[0m) (58, -) 
ID:	54	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(50, -) (55, -) (56, -) 
ID:	55	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(52, -) (54, -) (57, -) 
ID:	56	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(54, -) (59, -) (61, -) 
ID:	57	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(55, -) (59, -) (62, -) 
ID:	58	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(53, -) (59, -) (63, -) 
ID:	59	VertexType:	[1m[31mX[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	4	(56, -) (57, -) (58, -) (60, -) 
ID:	60	VertexType:	[1m[32mZ[0m[0m	Qubit:	5	Phase:	œÄ/7	#Neighbors:	1	(59, -) 
ID:	61	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(56, -) (62, -) (66, -) 
ID:	62	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(57, -) (61, -) (64, -) 
ID:	63	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	2	(58, -) (65, -) 
ID:	64	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	œÄ/7	#Neighbors:	2	(62, -) (67, -) 
ID:	65	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	13œÄ/7	#Neighbors:	2	(63, -) (70, -) 
ID:	66	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(61, -) (67, -) (68, -) 
ID:	67	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(64, -) (66, -) (69, -) 
ID:	68	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(66, -) 
ID:	69	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(67, -) 
ID:	70	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(65, -) 
Total #Vertices: 71


qsyn> zxgs -fr
Spider Fusion Rule: 
6 iterations
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
6 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
2 iterations
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches

qsyn> zxgp -q

ID:	34	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(68, -) 
ID:	68	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(34, -) 


ID:	35	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(69, -) 
ID:	69	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(35, -) 


ID:	36	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(70, -) 
ID:	70	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(36, -) 


qsyn> zxgt -v
The graph is valid!

qsyn> q -f

