DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/qft/qft_7.qasm
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qccp -q 
Q 0  - h( 0)--cr( 1)--cr( 2)--cr( 3)--cr( 4)--cr( 5)--cr( 6)-
Q 1  ---------cr( 1)-- h( 7)--cr( 8)--cr( 9)--cr(10)--cr(11)--cr(12)-
Q 2  -----------------cr( 2)--cr( 8)-- h(13)--cr(14)--cr(15)--cr(16)--cr(17)-
Q 3  -------------------------cr( 3)--cr( 9)--cr(14)-- h(18)--cr(19)--cr(20)--cr(21)-
Q 4  ---------------------------------cr( 4)--cr(10)--cr(15)--cr(19)-- h(22)--cr(23)--cr(24)-
Q 5  -----------------------------------------cr( 5)--cr(11)--cr(16)--cr(20)--cr(23)-- h(25)--cr(26)-
Q 6  -------------------------------------------------cr( 6)--cr(12)--cr(17)--cr(21)--cr(24)--cr(26)-- h(27)-

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 0
Checkout to Graph 0

qsyn> qccr benchmark/qft/qft_7dec.qasm
Successfully generated QCir 1
Checkout to QCir 1

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 1
Checkout to Graph 1

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr
Hadamard Rule: 7 . 1 iterations
Spider Fusion Rule: 
7 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
3 iterations
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
4 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
2 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
2 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
2 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
2 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
2 iterations
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Boundary Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches

qsyn> zxgp -q

ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(183, -) 
ID:	183	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 


ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(185, -) 
ID:	185	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 


ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(187, -) 
ID:	187	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(5, -) 


ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(189, -) 
ID:	189	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(7, -) 


ID:	9	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(191, -) 
ID:	191	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(9, -) 


ID:	11	VertexType:	●	Qubit:	5	Phase:	0	#Neighbors:	1	(193, -) 
ID:	193	VertexType:	●	Qubit:	5	Phase:	0	#Neighbors:	1	(11, -) 


ID:	13	VertexType:	●	Qubit:	6	Phase:	0	#Neighbors:	1	(195, -) 
ID:	195	VertexType:	●	Qubit:	6	Phase:	0	#Neighbors:	1	(13, -) 


qsyn> q -f

