qsyn> qcp -se

Delay of Single-qubit gate :     1
Delay of Double-qubit gate :     2
Delay of SWAP gate :             6 (3 CXs)
Delay of Multiple-qubit gate :   5

qsyn> qcset -double 2 -sw 6

qsyn> qcp -se

Delay of Single-qubit gate :     1
Delay of Double-qubit gate :     2
Delay of SWAP gate :             6 (3 CXs)
Delay of Multiple-qubit gate :   5

qsyn> qccr benchmark/SABRE/large/cm82a_208.qasm

qsyn> device read benchmark/topology/guadalupe.layout 

qsyn> qccp -a
Clifford    : 370
└── 2-qubit : 283
T-family    : 280
Others      : 0

qsyn> duostra config --verbose

Scheduler:         search
Router:            duostra
Placer:            dfs

# Candidates:      unlimited
Search Depth:      4

Tie breaker:       min
APSP Coeff.:       1
2-Qb. Avail. Time: max
Cost Selector:     min
Never Cache:       true
Single Immed.:     false

qsyn> duostra config --depth 2 --single-immediate true

qsyn> duostra config --verbose

Scheduler:         search
Router:            duostra
Placer:            dfs

# Candidates:      unlimited
Search Depth:      2

Tie breaker:       min
APSP Coeff.:       1
2-Qb. Avail. Time: max
Cost Selector:     min
Never Cache:       true
Single Immed.:     true

qsyn> duostra --check
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  1603
Total Time:     3633
#SWAP:          450


qsyn> qccp -a
Clifford    : 1720
└── 2-qubit : 1633
T-family    : 280
Others      : 0

qsyn> duostra config --scheduler greedy

qsyn> duostra config

Scheduler:         greedy
Router:            duostra
Placer:            dfs

qsyn> duostra --check
Routing...

Checking...

Duostra Result: 

Scheduler:      greedy
Router:         duostra
Placer:         dfs

Mapping Depth:  2441
Total Time:     6753
#SWAP:          520


qsyn> qccp -a
Clifford    : 3280
└── 2-qubit : 3193
T-family    : 280
Others      : 0

qsyn> quit -f

