qsyn> device read benchmark/topology/guadalupe.layout

qsyn> qcset -d 2 -sw 6

qsyn> qccr benchmark/SABRE/small/3_17_13.qasm

qsyn> duostra --check
Routing...

Checking...

Duostra Result: 

Scheduler:      search
Router:         duostra
Placer:         dfs

Mapping Depth:  85
Total Time:     101
#SWAP:          8


qsyn> qccp
QCir (16 qubits, 60 gates, 41 2-qubits gates, 14 T-gates, 85 depths)

qsyn> qcp -l
  0    3_17_13             
â˜… 1    3_17_13             Duostra

qsyn> help map-equiv
Usage: map-equiv [-h] (-logical <size_t LOGICAL>) (-physical <size_t PHYSICAL>) [-reverse]

Description:
  check equivalence of the physical and the logical circuits

Options:
  flag    -h, --help            show this help message                                 
  size_t  -logical    LOGICAL   logical circuit id                                     
  size_t  -physical   PHYSICAL  physical circuit id                                    
  flag    -reverse              check the circuit reversily, used in extracted circuit 

qsyn> map-equiv -l 0 -p 1
Equivalent up to permutation

qsyn> quit -f

