DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/qc/Adder32_pyzx.qc
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qcn 1
Successfully generated QCir 1
Checkout to QCir 1

qsyn> qcch 0
Checkout to QCir 0

qsyn> qccp
QCir 0( 95 qubits, 1684 gates)

qsyn> qccop 1
Error: QCir 1 already exists!! Add `-Replace` if you want to overwrite it.

qsyn> qccp
QCir 0( 95 qubits, 1684 gates)

qsyn> qccop 1 -r
Successfully copied QCir 0 to QCir 1
Checkout to QCir 1

qsyn> qccp
QCir 1( 95 qubits, 1684 gates)

qsyn> qcch 0
Checkout to QCir 0

qsyn> qccp
QCir 0( 95 qubits, 1684 gates)

qsyn> qcch 1
Checkout to QCir 1

qsyn> qccp
QCir 1( 95 qubits, 1684 gates)

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qq -f

