qsyn> qcir read benchmark/SABRE/large/adr4_197.qasm

qsyn> qcir print --statistics
QCir (16 qubits, 3439 gates)
Clifford   : 1941
└── H-gate : 428 (417 internal)
2-qubit    : 1498
T-family   : 1498
Others     : 5354
Depth       : 3088

qsyn> logger trace
[info]     Setting logger level to "trace"

qsyn> qcir optimize
[info]     Start basic optimization
[debug]    Start parsing forward
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Cancel X-X into Id
[trace]    Transform X gate into Z gate
[debug]      ParseForward No.0 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 10
[debug]        Fuse the Zphase: 10
[debug]        X gate canceled: 1
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 0
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 0
[debug]      Note: 0 CZs had been transformed into CXs.
[debug]            0 CXs had been transformed into CZs.
[debug]      Note: 0 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing backward
[trace]    Transform X gate into Z gate
[trace]    Apply a do_swap commutation
[trace]    Transform X gate into Z gate
[trace]    Apply a do_swap commutation
[trace]    Apply a do_swap commutation
[trace]    Apply a do_swap commutation
[debug]      ParseForward No.1 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 4
[debug]        Fuse the Zphase: 4
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 0
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 4
[debug]      Note: 0 CZs had been transformed into CXs.
[debug]            105 CXs had been transformed into CZs.
[debug]      Note: 4 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing forward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Transform X gate into Z gate
[trace]    Apply a do_swap commutation
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[debug]      ParseForward No.2 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 4
[debug]        Fuse the Zphase: 4
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 4
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 5
[debug]      Note: 52 CZs had been transformed into CXs.
[debug]            0 CXs had been transformed into CZs.
[debug]      Note: 3 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing backward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[debug]      ParseForward No.3 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 1
[debug]        Fuse the Zphase: 1
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 3
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 3
[debug]      Note: 0 CZs had been transformed into CXs.
[debug]            52 CXs had been transformed into CZs.
[debug]      Note: 3 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing forward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[debug]      ParseForward No.4 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 0
[debug]        Fuse the Zphase: 0
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 3
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 4
[debug]      Note: 53 CZs had been transformed into CXs.
[debug]            0 CXs had been transformed into CZs.
[debug]      Note: 2 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing backward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[debug]      ParseForward No.5 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 1
[debug]        Fuse the Zphase: 1
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 2
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 2
[debug]      Note: 0 CZs had been transformed into CXs.
[debug]            53 CXs had been transformed into CZs.
[debug]      Note: 2 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing forward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[debug]      ParseForward No.6 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 0
[debug]        Fuse the Zphase: 0
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 2
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 2
[debug]      Note: 35 CZs had been transformed into CXs.
[debug]            0 CXs had been transformed into CZs.
[debug]      Note: 2 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing backward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[debug]      ParseForward No.7 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 0
[debug]        Fuse the Zphase: 0
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 2
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 2
[debug]      Note: 0 CZs had been transformed into CXs.
[debug]            35 CXs had been transformed into CZs.
[debug]      Note: 2 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing forward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[debug]      ParseForward No.8 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 0
[debug]        Fuse the Zphase: 0
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 2
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 2
[debug]      Note: 35 CZs had been transformed into CXs.
[debug]            0 CXs had been transformed into CZs.
[debug]      Note: 2 swap gates had been added in the swap path.
[debug]    
[info]     Basic optimization finished after 19 iterations.
[info]       Two-qubit gates: 1498 → 1498
[info]       Hadamard gates : 428 → 210
[info]       Non-Pauli gates: 1498 → 1491
[info]     Note: Replacing QCir 0...

qsyn> logger warn

qsyn> qcir print --statistics
QCir (16 qubits, 3200 gates)
Clifford   : 1714
└── H-gate : 210 (199 internal)
2-qubit    : 1498
T-family   : 1472
Others     : 4897
Depth       : 3195

qsyn> qc2zx

qsyn> zx optimize

qsyn> zx2qc

qsyn> qcir print --statistics
QCir (16 qubits, 3339 gates)
Clifford   : 2647
└── H-gate : 1210 (1174 internal)
2-qubit    : 1433
T-family   : 599
Others     : 5946
Depth       : 3966

qsyn> logger info
[info]     Setting logger level to "info"

qsyn> qcir optimize --stat
[info]     Start basic optimization
  ParseForward No.0 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 0
    Fuse the Zphase: 0
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 9
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 13
  Note: 180 CZs had been transformed into CXs.
        107 CXs had been transformed into CZs.
  Note: 7 swap gates had been added in the swap path.

  ParseForward No.1 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 138
    Fuse the Zphase: 138
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 7
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 20
  Note: 87 CZs had been transformed into CXs.
        351 CXs had been transformed into CZs.
  Note: 8 swap gates had been added in the swap path.

  ParseForward No.2 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 105
    Fuse the Zphase: 105
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 8
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 19
  Note: 411 CZs had been transformed into CXs.
        37 CXs had been transformed into CZs.
  Note: 5 swap gates had been added in the swap path.

  ParseForward No.3 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 129
    Fuse the Zphase: 129
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 5
    CZ canceled    : 0
    Crz transform  : 57
    Do swap        : 10
  Note: 15 CZs had been transformed into CXs.
        361 CXs had been transformed into CZs.
  Note: 6 swap gates had been added in the swap path.

  ParseForward No.4 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 214
    Fuse the Zphase: 214
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 6
    CZ canceled    : 0
    Crz transform  : 1
    Do swap        : 9
  Note: 326 CZs had been transformed into CXs.
        9 CXs had been transformed into CZs.
  Note: 5 swap gates had been added in the swap path.

  ParseForward No.5 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 113
    Fuse the Zphase: 113
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 5
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 8
  Note: 8 CZs had been transformed into CXs.
        324 CXs had been transformed into CZs.
  Note: 6 swap gates had been added in the swap path.

  ParseForward No.6 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 104
    Fuse the Zphase: 104
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 6
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 7
  Note: 339 CZs had been transformed into CXs.
        7 CXs had been transformed into CZs.
  Note: 5 swap gates had been added in the swap path.

  ParseForward No.7 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 93
    Fuse the Zphase: 93
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 5
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 7
  Note: 7 CZs had been transformed into CXs.
        339 CXs had been transformed into CZs.
  Note: 7 swap gates had been added in the swap path.

  ParseForward No.8 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 117
    Fuse the Zphase: 117
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 7
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 7
  Note: 339 CZs had been transformed into CXs.
        7 CXs had been transformed into CZs.
  Note: 7 swap gates had been added in the swap path.

[info]     Basic optimization finished after 19 iterations.
[info]       Two-qubit gates: 1433 → 1327
[info]       Hadamard gates : 1210 → 210
[info]       Non-Pauli gates: 694 → 742
[info]     Note: Replacing QCir 1...

qsyn> logger warn

qsyn> qcir print --statistics
QCir (16 qubits, 2284 gates)
Clifford   : 1592
└── H-gate : 210 (204 internal)
2-qubit    : 1327
T-family   : 503
Others     : 3815
Depth       : 2980

qsyn> quit -f

