qsyn> qcir read benchmark/SABRE/large/adr4_197.qasm

qsyn> qcir print --statistics
QCir (16 qubits, 3439 gates)
Clifford   : 1941
└── H-gate : 428 (417 internal)
2-qubit    : 1498
T-family   : 1498
Others     : 0
Depth      : 3088

qsyn> logger trace
[info]     Setting logger level to "trace"

qsyn> qcir optimize
[info]     Start basic optimization
[debug]    Start parsing forward
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Cancel X-X into Id
[trace]    Transform X gate into Z gate
[debug]      ParseForward No.0 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 10
[debug]        Fuse the Zphase: 10
[debug]        X gate canceled: 1
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 0
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 0
[debug]      Note: 0 CZs had been transformed into CXs.
[debug]            0 CXs had been transformed into CZs.
[debug]      Note: 0 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing backward
[trace]    Apply a do_swap commutation
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Apply a do_swap commutation
[trace]    Apply a do_swap commutation
[debug]      ParseForward No.1 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 4
[debug]        Fuse the Zphase: 4
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 0
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 3
[debug]      Note: 0 CZs had been transformed into CXs.
[debug]            105 CXs had been transformed into CZs.
[debug]      Note: 3 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing forward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Apply a do_swap commutation
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[debug]      ParseForward No.2 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 3
[debug]        Fuse the Zphase: 3
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 3
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 5
[debug]      Note: 83 CZs had been transformed into CXs.
[debug]            0 CXs had been transformed into CZs.
[debug]      Note: 3 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing backward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[debug]      ParseForward No.3 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 2
[debug]        Fuse the Zphase: 2
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 3
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 3
[debug]      Note: 0 CZs had been transformed into CXs.
[debug]            83 CXs had been transformed into CZs.
[debug]      Note: 3 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing forward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[debug]      ParseForward No.4 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 0
[debug]        Fuse the Zphase: 0
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 3
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 3
[debug]      Note: 88 CZs had been transformed into CXs.
[debug]            0 CXs had been transformed into CZs.
[debug]      Note: 3 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing backward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[debug]      ParseForward No.5 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 0
[debug]        Fuse the Zphase: 0
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 3
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 3
[debug]      Note: 0 CZs had been transformed into CXs.
[debug]            88 CXs had been transformed into CZs.
[debug]      Note: 3 swap gates had been added in the swap path.
[debug]    
[debug]    Start parsing forward
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Apply a do_swap commutation
[trace]    Cancel with previous CX
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[trace]    Transform X gate into Z gate
[debug]      ParseForward No.6 iteration done.
[debug]      Operated rule numbers in this forward are: 
[debug]        Fuse the Zphase: 0
[debug]        Fuse the Zphase: 0
[debug]        X gate canceled: 0
[debug]        H-S exchange   : 0
[debug]        Cnot canceled  : 3
[debug]        CZ canceled    : 0
[debug]        Crz transform  : 0
[debug]        Do swap        : 3
[debug]      Note: 88 CZs had been transformed into CXs.
[debug]            0 CXs had been transformed into CZs.
[debug]      Note: 3 swap gates had been added in the swap path.
[debug]    
[info]     Basic optimization finished after 15 iterations.
[info]       Two-qubit gates: 1498 → 1502
[info]       Hadamard gates : 428 → 210
[info]       Non-Pauli gates: 1498 → 1492
[info]     Note: Replacing QCir 0...

qsyn> logger warn

qsyn> qcir print --statistics
QCir (16 qubits, 3205 gates)
Clifford   : 1717
└── H-gate : 210 (199 internal)
2-qubit    : 1502
T-family   : 1488
Others     : 0
Depth      : 3197

qsyn> qc2zx

qsyn> zx optimize

qsyn> zx2qc

qsyn> qcir print --statistics
QCir (16 qubits, 3613 gates)
Clifford   : 2921
└── H-gate : 1212 (1178 internal)
2-qubit    : 1705
T-family   : 692
Others     : 0
Depth      : 4595

qsyn> logger info
[info]     Setting logger level to "info"

qsyn> qcir optimize --stat
[info]     Start basic optimization
  ParseForward No.0 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 0
    Fuse the Zphase: 0
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 10
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 14
  Note: 177 CZs had been transformed into CXs.
        126 CXs had been transformed into CZs.
  Note: 6 swap gates had been added in the swap path.

  ParseForward No.1 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 148
    Fuse the Zphase: 148
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 6
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 13
  Note: 80 CZs had been transformed into CXs.
        439 CXs had been transformed into CZs.
  Note: 7 swap gates had been added in the swap path.

  ParseForward No.2 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 121
    Fuse the Zphase: 121
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 7
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 31
  Note: 519 CZs had been transformed into CXs.
        45 CXs had been transformed into CZs.
  Note: 7 swap gates had been added in the swap path.

  ParseForward No.3 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 165
    Fuse the Zphase: 165
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 7
    CZ canceled    : 0
    Crz transform  : 74
    Do swap        : 14
  Note: 8 CZs had been transformed into CXs.
        381 CXs had been transformed into CZs.
  Note: 8 swap gates had been added in the swap path.

  ParseForward No.4 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 289
    Fuse the Zphase: 289
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 8
    CZ canceled    : 0
    Crz transform  : 3
    Do swap        : 15
  Note: 316 CZs had been transformed into CXs.
        8 CXs had been transformed into CZs.
  Note: 9 swap gates had been added in the swap path.

  ParseForward No.5 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 134
    Fuse the Zphase: 134
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 9
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 10
  Note: 9 CZs had been transformed into CXs.
        313 CXs had been transformed into CZs.
  Note: 10 swap gates had been added in the swap path.

  ParseForward No.6 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 98
    Fuse the Zphase: 98
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 10
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 11
  Note: 331 CZs had been transformed into CXs.
        9 CXs had been transformed into CZs.
  Note: 9 swap gates had been added in the swap path.

  ParseForward No.7 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 131
    Fuse the Zphase: 131
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 9
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 9
  Note: 9 CZs had been transformed into CXs.
        330 CXs had been transformed into CZs.
  Note: 9 swap gates had been added in the swap path.

  ParseForward No.8 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 95
    Fuse the Zphase: 95
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 9
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 9
  Note: 330 CZs had been transformed into CXs.
        9 CXs had been transformed into CZs.
  Note: 9 swap gates had been added in the swap path.

  ParseForward No.9 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 130
    Fuse the Zphase: 130
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 9
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 9
  Note: 9 CZs had been transformed into CXs.
        330 CXs had been transformed into CZs.
  Note: 9 swap gates had been added in the swap path.

  ParseForward No.10 iteration done.
  Operated rule numbers in this forward are: 
    Fuse the Zphase: 95
    Fuse the Zphase: 95
    X gate canceled: 0
    H-S exchange   : 0
    Cnot canceled  : 9
    CZ canceled    : 0
    Crz transform  : 0
    Do swap        : 9
  Note: 330 CZs had been transformed into CXs.
        9 CXs had been transformed into CZs.
  Note: 9 swap gates had been added in the swap path.

[info]     Basic optimization finished after 23 iterations.
[info]       Two-qubit gates: 1705 → 1574
[info]       Hadamard gates : 1212 → 210
[info]       Non-Pauli gates: 695 → 754
[info]     Note: Replacing QCir 1...

qsyn> logger warn

qsyn> qcir print --statistics
QCir (16 qubits, 2542 gates)
Clifford   : 1850
└── H-gate : 210 (203 internal)
2-qubit    : 1574
T-family   : 692
Others     : 0
Depth      : 3505

qsyn> quit -f

