qsyn> exi -h
Usage: exit [-h] [-force]

Description:
  quit Qsyn

Options:
  flag  -h, --help    show this help message and exit 
  flag  -force        quit without reaffirming        

qsyn> alias exir qccr

qsyn> exi -h
[error]    Ambiguous command or alias `exi`!!

qsyn> exir -h
Usage: qccread [-h] [-replace] <string filepath>

Description:
  read a circuit and construct the corresponding netlist

Positional Arguments:
  string  filepath    the filepath to quantum circuit file. Supported extension: .qasm, .qc, .qsim, .quipper 

Options:
  flag  -h, --help    show this help message and exit                                         
  flag  -replace      if specified, replace the current circuit; otherwise store to a new one 

qsyn> exit -h
Usage: exit [-h] [-force]

Description:
  quit Qsyn

Options:
  flag  -h, --help    show this help message and exit 
  flag  -force        quit without reaffirming        

qsyn> alias -d exir

qsyn> exit -h
Usage: exit [-h] [-force]

Description:
  quit Qsyn

Options:
  flag  -h, --help    show this help message and exit 
  flag  -force        quit without reaffirming        

qsyn> exir -h
[error]    Unknown command!! (exir)

qsyn> exi -h
Usage: exit [-h] [-force]

Description:
  quit Qsyn

Options:
  flag  -h, --help    show this help message and exit 
  flag  -force        quit without reaffirming        

qsyn> exit -f

