qsyn> exi -h
Usage: quit [-h] [-force]

Description:
  quit qsyn

Options:
  flag  -h, --help    show this help message   
  flag  -force        quit without reaffirming 

qsyn> alias exir "qcir read"

qsyn> exi -h
[error]    Ambiguous command or alias `exi`!!

qsyn> exir -h
Usage: read [-h] [-replace] <string filepath>

Description:
  read a circuit and construct the corresponding netlist

Positional Arguments:
  string  filepath    the filepath to quantum circuit file. Supported extension: .qasm, .qc, .qsim, .quipper 

Options:
  flag  -h, --help    show this help message                                                  
  flag  -replace      if specified, replace the current circuit; otherwise store to a new one 

qsyn> exit -h
Usage: quit [-h] [-force]

Description:
  quit qsyn

Options:
  flag  -h, --help    show this help message   
  flag  -force        quit without reaffirming 

qsyn> alias -d exir

qsyn> exit -h
Usage: quit [-h] [-force]

Description:
  quit qsyn

Options:
  flag  -h, --help    show this help message   
  flag  -force        quit without reaffirming 

qsyn> exir -h
[error]    Unknown command!! (exir)

qsyn> exi -h
Usage: quit [-h] [-force]

Description:
  quit qsyn

Options:
  flag  -h, --help    show this help message   
  flag  -force        quit without reaffirming 

qsyn> exit -f

