DV Lab, NTUEE, Qsyn 0.5.1
qsyn> qq -h
Usage: qquit [-h] [-force]

Description:
  quit Qsyn

Options:
  flag  -h, --help    show this help message and exit 
  flag  -force        quit without reaffirming        

qsyn> alias qqqq qccr

qsyn> qq -h
[Error] Ambiguous command or alias `qq`!!

qsyn> qqq -h
Usage: qccread [-h] [-replace] <string filepath>

Description:
  read a circuit and construct the corresponding netlist

Positional Arguments:
  string  filepath    the filepath to quantum circuit file. Supported extension: .qasm, .qc, .qsim, .quipper 

Options:
  flag  -h, --help    show this help message and exit                                         
  flag  -replace      if specified, replace the current circuit; otherwise store to a new one 

qsyn> qqu -h
Usage: qquit [-h] [-force]

Description:
  quit Qsyn

Options:
  flag  -h, --help    show this help message and exit 
  flag  -force        quit without reaffirming        

qsyn> alias -d qqqq

qsyn> qquit -h
Usage: qquit [-h] [-force]

Description:
  quit Qsyn

Options:
  flag  -h, --help    show this help message and exit 
  flag  -force        quit without reaffirming        

qsyn> qqq -h
[Error] Unknown command or alias `qqq`!!

qsyn> qq -h
Usage: qquit [-h] [-force]

Description:
  quit Qsyn

Options:
  flag  -h, --help    show this help message and exit 
  flag  -force        quit without reaffirming        

qsyn> qq -f

