qsyn> logger -h
Usage: logger [-h] [-t | [<string level>]]

Description:
  display and set the logger's status

Positional Arguments:
  string  level    set log levels. Levels (ascending): off, critical, error, warning, info, debug, trace 

Options:
  flag  -h, --help    show this help message      
  flag  -t, --test    test current logger setting 

qsyn> source -h
Usage: source [-h] [-q] <string file> [<string arguments>]...

Description:
  execute the commands in the dofile

Positional Arguments:
  string  file         path to a dofile, i.e., a list of qsyn commands 
  string  arguments    arguments to the dofile                         

Options:
  flag  -h, --help     show this help message           
  flag  -q, --quiet    suppress the echoing of commands 

qsyn> zx vertex -h
Usage: zx vertex [-h] (add | remove) ...

Description:
  add, remove, or edit vertices of ZXGraph

Options:
  flag  -h, --help    show this help message 

Subcommands:
(add | remove)  
    add     add vertices to ZXGraph      
    remove  remove vertices from ZXGraph 

qsyn> zx vertex remove -h
Usage: zx vertex remove [-h] ([<size_t ids>]... | -i)

Description:
  remove vertices from ZXGraph

Positional Arguments:
  size_t  ids    the IDs of vertices to remove 

Options:
  flag  -h, --help        show this help message               
  flag  -i, --isolated    if set, remove all isolated vertices 

qsyn> zx edge remove -h
Usage: zx edge remove [-h] <size_t (vs, vt)> <size_t (vs, vt)> <string etype>

Description:
  remove edges from ZXGraph

Positional Arguments:
  size_t  (vs, vt)    the IDs to the two vertices to remove edges in between                      
  string  etype       the edge type to remove. Options: simple, hadamard, all (i.e., remove both) 

Options:
  flag  -h, --help    show this help message 

qsyn> extract step -h
Usage: extract step [-h] (-zx <size_t ID>) (-qc <size_t ID>) (-cx | -cz | -ph | -H | --clear-frontier | --remove-gadgets | --permute | -l [<size_t N>])

Description:
  perform step(s) in extraction

Options:
  flag    -h, --help            show this help message                                  
  size_t  -zx, --zxgraph    ID  the ID of the ZXGraph to extract from                   
  size_t  -qc, --qcir       ID  the ID of the QCir to extract to                        
  flag    -cx                   Extract CX gates                                        
  flag    -cz                   Extract CZ gates                                        
  flag    -ph, --phase          Extract Z-rotation gates                                
  flag    -H, --hadamard        Extract Hadamard gates                                  
  flag    --clear-frontier      Extract Z-rotation and then CZ gates                    
  flag    --remove-gadgets      Remove phase gadgets in the neighbor of the frontiers   
  flag    --permute             Add swap gates to account for ZXGraph I/O permutations  
  size_t  -l, --loop        N   Run N iteration of extraction loop. N is defaulted to 1 

qsyn> zx read -h
Usage: zx read [-h] [--keep-id] [-r] <string filepath>

Description:
  read a file and construct the corresponding ZXGraph

Positional Arguments:
  string  filepath    path to the ZX file. Supported extensions: .zx, .zxg 

Options:
  flag  -h, --help       show this help message                                                                  
  flag  --keep-id        if set, retain the IDs in the ZX file; otherwise the ID is rearranged to be consecutive 
  flag  -r, --replace    replace the current ZXGraph                                                             

qsyn> quit -f

