qsyn> logger -h
Usage: logger [-h] [test | level] ...

Description:
  display and set the logger's status

Options:
  flag  -h, --help    show this help message 

Subcommands:
  [test | level]  subcommands for logger  
    test          Test out logger setting 
    level         set logger level        

qsyn> source -h
Usage: source [-h] [-q] <string file> [<string arguments>]...

Description:
  execute the commands in the dofile

Positional Arguments:
  string  file         path to a dofile, i.e., a list of qsyn commands 
  string  arguments    arguments to the dofile                         

Options:
  flag  -h, --help     show this help message           
  flag  -q, --quiet    suppress the echoing of commands 

qsyn> zxgraph vertex -h
Usage: vertex [-h] (add | remove) ...

Description:
  add, remove, or edit vertices of ZXGraph

Options:
  flag  -h, --help    show this help message 

Subcommands:
  (add | remove)                          
    add           add vertices to ZXGraph 

qsyn> zxgraph vertex remove -h
Usage: remove [-h] ([<size_t ids>]... | -i)

Positional Arguments:
  size_t  ids    the IDs of vertices to remove 

Options:
  flag  -h, --help        show this help message               
  flag  -i, --isolated    if set, remove all isolated vertices 

qsyn> zxgraph edge remove -h
Usage: remove [-h] <size_t (vs, vt)> <size_t (vs, vt)> <string etype>

Description:
  remove edges from ZXGraph

Positional Arguments:
  size_t  (vs, vt)    the IDs to the two vertices to remove edges in between                      
  string  etype       the edge type to remove. Options: simple, hadamard, all (i.e., remove both) 

Options:
  flag  -h, --help    show this help message 

qsyn> extract step -h
Usage: step [-h] (-zxgraph <size_t ID>) (-qcir <size_t ID>) (-cx | -cz | -phase | -H | -clf | -rmg | -permute | -loop [<size_t N>])

Description:
  perform step(s) in extraction

Options:
  flag    -h, --help                  show this help message                                  
  size_t  -zxgraph                ID  the ID of the ZXGraph to extract from                   
  size_t  -qcir                   ID  the ID of the QCir to extract to                        
  flag    -cx                         Extract CX gates                                        
  flag    -cz                         Extract CZ gates                                        
  flag    -phase                      Extract Z-rotation gates                                
  flag    -H, --hadamard              Extract Hadamard gates                                  
  flag    -clf, --clear-frontier      Extract Z-rotation and then CZ gates                    
  flag    -rmg, --remove-gadgets      Remove phase gadgets in the neighbor of the frontiers   
  flag    -permute                    Add swap gates to account for ZXGraph I/O permutations  
  size_t  -loop                   N   Run N iteration of extraction loop. N is defaulted to 1 

qsyn> zxgraph read -h
Usage: read [-h] [-keepid] [-replace] <string filepath>

Description:
  read a file and construct the corresponding ZXGraph

Positional Arguments:
  string  filepath    path to the ZX file. Supported extensions: .zx 

Options:
  flag  -h, --help    show this help message                                                                  
  flag  -keepid       if set, retain the IDs in the ZX file; otherwise the ID is rearranged to be consecutive 
  flag  -replace      replace the current ZXGraph                                                             

qsyn> quit -f

