DV Lab, NTUEE, Qsyn 0.5.1
qsyn> logger
Logger Level: warning

qsyn> logger level debug
[[32mDebug[0m] Setting logger level to debug

qsyn> logger
Logger Level: debug

qsyn> logger test
[[30m[41mFatal[0m[0m] Test fatal log
[[31mError[0m] Test fatal log
[[33mWarning[0m] Test warning log
[Info] Test info log
[[32mDebug[0m] Test debug log

qsyn> logger mask -error -warning
[[32mDebug[0m] Masked logger level: error
[[32mDebug[0m] Masked logger level: warning

qsyn> logger
Logger Level: debug
Masked logging levels: error, warning

qsyn> logger test
[[30m[41mFatal[0m[0m] Test fatal log
[Info] Test info log
[[32mDebug[0m] Test debug log

qsyn> logger mask +warning
[[32mDebug[0m] Unmasked logger level: warning

qsyn> logger
Logger Level: debug
Masked logging levels: error

qsyn> logger test
[[30m[41mFatal[0m[0m] Test fatal log
[[33mWarning[0m] Test warning log
[Info] Test info log
[[32mDebug[0m] Test debug log

qsyn> logger level error

qsyn> logger test
[[30m[41mFatal[0m[0m] Test fatal log

qsyn> logger history
[[32mDebug[0m] Setting logger level to debug
[[30m[41mFatal[0m[0m] Test fatal log
[[31mError[0m] Test fatal log
[[33mWarning[0m] Test warning log
[Info] Test info log
[[32mDebug[0m] Test debug log
[[36mTrace[0m] Test trace log
[[32mDebug[0m] Masked logger level: error
[[32mDebug[0m] Masked logger level: warning
[[30m[41mFatal[0m[0m] Test fatal log
[[31mError[0m] Test fatal log
[[33mWarning[0m] Test warning log
[Info] Test info log
[[32mDebug[0m] Test debug log
[[36mTrace[0m] Test trace log
[[32mDebug[0m] Unmasked logger level: warning
[[30m[41mFatal[0m[0m] Test fatal log
[[31mError[0m] Test fatal log
[[33mWarning[0m] Test warning log
[Info] Test info log
[[32mDebug[0m] Test debug log
[[36mTrace[0m] Test trace log
[[32mDebug[0m] Setting logger level to error
[[30m[41mFatal[0m[0m] Test fatal log
[[31mError[0m] Test fatal log
[[33mWarning[0m] Test warning log
[Info] Test info log
[[32mDebug[0m] Test debug log
[[36mTrace[0m] Test trace log

qsyn> logger history 10
[Info] Test info log
[[32mDebug[0m] Test debug log
[[36mTrace[0m] Test trace log
[[32mDebug[0m] Setting logger level to error
[[30m[41mFatal[0m[0m] Test fatal log
[[31mError[0m] Test fatal log
[[33mWarning[0m] Test warning log
[Info] Test info log
[[32mDebug[0m] Test debug log
[[36mTrace[0m] Test trace log

qsyn> qq -f

