DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/pseudoSimp/achilles.qasm
Create and checkout to QCir 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 1 I X 0

qsyn> zxgas 1 O X 0

qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -sr

qsyn> zxgp -v

ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (41, [1m[34mH[0m[0m) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 47)	  #Neighbors:   1     (41, [1m[34mH[0m[0m) 
ID:   8 (â—, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (96, -) 
ID:   9 (â—, 0)           (Qubit, Col): (4, 47)	  #Neighbors:   1     (96, -) 
ID:  41 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 17)	  #Neighbors:   3     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (96, [1m[34mH[0m[0m) 
ID:  96 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 33)	  #Neighbors:   3     (8, -) (9, -) (41, [1m[34mH[0m[0m) 
ID: 148 ([1m[31mX[0m[0m, Ï€/4)         (Qubit, Col): (-2, 20)	  #Neighbors:   1     (149, [1m[34mH[0m[0m) 
ID: 149 ([1m[31mX[0m[0m, Ï€)           (Qubit, Col): (-1, 20)	  #Neighbors:   1     (148, [1m[34mH[0m[0m) 
ID: 162 ([1m[31mX[0m[0m, 7Ï€/4)        (Qubit, Col): (-2, 35)	  #Neighbors:   1     (163, [1m[34mH[0m[0m) 
ID: 163 ([1m[31mX[0m[0m, Ï€)           (Qubit, Col): (-1, 35)	  #Neighbors:   1     (162, [1m[34mH[0m[0m) 
ID: 184 ([1m[31mX[0m[0m, Ï€/4)         (Qubit, Col): (-2, 37)	  #Neighbors:   1     (185, [1m[34mH[0m[0m) 
ID: 185 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (-1, 37)	  #Neighbors:   1     (184, [1m[34mH[0m[0m) 
ID: 186 ([1m[31mX[0m[0m, Ï€/4)         (Qubit, Col): (-2, 12)	  #Neighbors:   1     (187, [1m[34mH[0m[0m) 
ID: 187 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (-1, 12)	  #Neighbors:   1     (186, [1m[34mH[0m[0m) 
ID: 190 ([1m[31mX[0m[0m, Ï€/4)         (Qubit, Col): (-2, 14)	  #Neighbors:   1     (191, [1m[34mH[0m[0m) 
ID: 191 ([1m[31mX[0m[0m, Ï€)           (Qubit, Col): (-1, 14)	  #Neighbors:   1     (190, [1m[34mH[0m[0m) 
ID: 194 ([1m[31mX[0m[0m, Ï€/4)         (Qubit, Col): (-2, 35)	  #Neighbors:   1     (195, [1m[34mH[0m[0m) 
ID: 195 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (-1, 35)	  #Neighbors:   1     (194, [1m[34mH[0m[0m) 
Total #Vertices: 18


qsyn> ver 3
Note: verbose level is set to 3

qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.000000e+00+0.i, -1.446853e-17+0.i,  2.361580e-17+0.i,
  -3.139397e-35+0.i},
 {-1.446853e-17+0.i,  1.000000e+00+0.i, -3.139397e-35+0.i,
   2.361580e-17+0.i},
 {-3.139397e-35+0.i,  2.361580e-17+0.i, -1.446853e-17+0.i,
   1.000000e+00+0.i},
 { 2.361580e-17+0.i, -3.139397e-35+0.i,  1.000000e+00+0.i,
  -1.446853e-17+0.i}}
#Dim:    2	Info: ZX 0

qsyn> qq -f

