DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/pseudoSimp/achilles.qasm
Create and checkout to QCir 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 2 I X 0

qsyn> zxgas 2 O X 0

qsyn> zxgas 0 I X 0

qsyn> zxgas 0 O X 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -sr

qsyn> ver 3
Note: verbose level is set to 3

qsyn> zxgp -v

ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 47)	  #Neighbors:   1     (2, -) 
ID:   8 (●, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (9, -) 
ID:   9 (●, 0)           (Qubit, Col): (4, 47)	  #Neighbors:   1     (8, -) 
ID: 144 ([1m[31mX[0m[0m, π/4)         (Qubit, Col): (-2, 17)	  #Neighbors:   1     (145, [1m[34mH[0m[0m) 
ID: 145 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (-1, 17)	  #Neighbors:   1     (144, [1m[34mH[0m[0m) 
ID: 154 ([1m[31mX[0m[0m, π/4)         (Qubit, Col): (-2, 34)	  #Neighbors:   1     (155, [1m[34mH[0m[0m) 
ID: 155 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (-1, 34)	  #Neighbors:   1     (154, [1m[34mH[0m[0m) 
ID: 194 ([1m[31mX[0m[0m, 7π/4)        (Qubit, Col): (-2, 25)	  #Neighbors:   1     (195, [1m[34mH[0m[0m) 
ID: 195 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (-1, 25)	  #Neighbors:   1     (194, [1m[34mH[0m[0m) 
ID: 198 ([1m[31mX[0m[0m, π/4)         (Qubit, Col): (-2, 22)	  #Neighbors:   1     (199, [1m[34mH[0m[0m) 
ID: 199 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (-1, 22)	  #Neighbors:   1     (198, [1m[34mH[0m[0m) 
Total #Vertices: 12


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i}}
#Dim:    2	Info: ZX 0

qsyn> qq -f

