DV Lab, NTUEE, Qsyn 0.5.1
qsyn> qccr benchmark/pseudoSimp/achilles.qasm
Created and checked out to QCir 0

qsyn> qc2zx
Created and checked out to ZXGraph 0

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 2 I X 0

qsyn> zxgas 2 O X 0

qsyn> zxgas 0 I X 0

qsyn> zxgas 0 O X 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -sr

qsyn> ver 3
Note: verbose level is set to 3

qsyn> zxgp -v

ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 47)	  #Neighbors:   1     (2, -) 
ID:   8 (●, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (9, -) 
ID:   9 (●, 0)           (Qubit, Col): (4, 47)	  #Neighbors:   1     (8, -) 
Total #Vertices: 4


qsyn> zx2ts
Traverse and build the tensor... 
Created and checked out to Tensor 0

qsyn> qcnew
Created and checked out to QCir 1

qsyn> qcba 2

qsyn> qc2ts
Traverse and build the tensor... 
Created and checked out to Tensor 1

qsyn> tseq 0 1
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

