DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/pseudoSimp/achilles.qasm

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qc2zx
Successfully generated Graph 0
Checkout to Graph 0
---- TRAVERSE AND BUILD THE GRAPH ----
--------------------------------------

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 1 I X 0

qsyn> zxgas 1 O X 0

qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -sr

qsyn> zxgp -v

ID:	4	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(32, -) 
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(32, -) 
ID:	8	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(107, [1m[34mH[0m[0m) 
ID:	9	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(107, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(4, -) (5, -) (107, [1m[34mH[0m[0m) 
ID:	107	VertexType:	[1m[32mZ[0m[0m	Qubit:	4	Phase:	0	#Neighbors:	3	(8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (32, [1m[34mH[0m[0m) 
Total #Vertices: 6


qsyn> ver 3
Note: verbose level is set to 3

qsyn> zx2ts
---- TRAVERSE AND BUILD THE TENSOR ----
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  1.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  1.      +0.i},
 { 0.      +0.i,  0.      +0.i,  1.      +0.i,  0.      +0.i}}
#Dim:    2	Info: ZX 0

qsyn> q -f

