DV Lab, NTUEE, Qsyn 0.5.1
qsyn> qccr benchmark/pseudoSimp/achilles.qasm
Created and checked out to QCir 0

qsyn> qc2zx
Created and checked out to ZXGraph 0

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 1 I X 0

qsyn> zxgas 1 O X 0

qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -sr

qsyn> zxgp -v

ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (41, [1m[34mH[0m[0m) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 47)	  #Neighbors:   1     (41, [1m[34mH[0m[0m) 
ID:   8 (â—, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (102, -) 
ID:   9 (â—, 0)           (Qubit, Col): (4, 47)	  #Neighbors:   1     (102, -) 
ID:  41 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 17)	  #Neighbors:   3     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (102, [1m[34mH[0m[0m) 
ID: 102 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 39)	  #Neighbors:   3     (8, -) (9, -) (41, [1m[34mH[0m[0m) 
Total #Vertices: 6


qsyn> ver 3
Note: verbose level is set to 3

qsyn> zx2ts
Traverse and build the tensor... 
Created and checked out to Tensor 0

qsyn> qcnew
Created and checked out to QCir 1

qsyn> qcba 2

qsyn> qcga -cx 0 1

qsyn> qc2ts
Traverse and build the tensor... 
Created and checked out to Tensor 1

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

