DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/pseudoSimp/achilles.qasm

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qczxm
Successfully generated Graph 0
Checkout to Graph 0
---- TRAVERSE AND BUILD THE GRAPH ----
--------------------------------------

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 1 I X pi

qsyn> zxgas 1 O X pi

qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> zxgs -sr
Hadamard Rule: 9 . 3 . 2 iterations
Spider Fusion Rule: 
6 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementary Rule: 
2 iterations
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementary Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementary Rule: 
2 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
6 iterations
Hopf Rule: 
No matches
[1m[32mTrue: The graph is graph-like[0m[0m
State Copy Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
4 iterations
Pivot Rule: 
No matches
Local Complementary Rule: 
4 iterations
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Phase Gadget Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
1 iterations
Hopf Rule: 
No matches
[1m[32mTrue: The graph is graph-like[0m[0m
State Copy Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Phase Gadget Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementary Rule: 
2 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
No matches
Hopf Rule: 
No matches
[1m[32mTrue: The graph is graph-like[0m[0m
State Copy Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
No matches
Hopf Rule: 
No matches
[1m[32mTrue: The graph is graph-like[0m[0m
State Copy Rule: 
No matches

qsyn> zxgp -v
ID:	4	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(32, -) 
ID:	5	VertexType:	â—	Qubit:	2	Phase:	0	#Neighbors:	1	(32, -) 
ID:	8	VertexType:	â—	Qubit:	4	Phase:	0	#Neighbors:	1	(165, [1m[34mH[0m[0m) 
ID:	9	VertexType:	â—	Qubit:	4	Phase:	0	#Neighbors:	1	(165, [1m[34mH[0m[0m) 
ID:	32	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(4, -) (5, -) (165, [1m[34mH[0m[0m) 
ID:	165	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€	#Neighbors:	3	(8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (32, [1m[34mH[0m[0m) 
Total #Vertices: 6

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> qccr -R benchmark/pseudoSimp/achilles.qasm
Note: original quantum circuit is replaced...

qsyn> zxm -on
Error: ZXMODE is already ON

qsyn> qczxm
Successfully generated Graph 0
Checkout to Graph 0
---- TRAVERSE AND BUILD THE GRAPH ----
--------------------------------------

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 1 I X pi

qsyn> zxgas 1 O X pi

qsyn> zxgas 2 I X pi

qsyn> zxgas 2 O X pi

qsyn> zxgs -sr
Hadamard Rule: 9 . 3 . 2 iterations
Spider Fusion Rule: 
6 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementary Rule: 
2 iterations
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementary Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementary Rule: 
2 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
5 iterations
Hopf Rule: 
No matches
[1m[32mTrue: The graph is graph-like[0m[0m
State Copy Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
4 iterations
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Phase Gadget Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
2 iterations
Pivot Rule: 
1 iterations
Local Complementary Rule: 
3 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
1 iterations
Local Complementary Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
No matches
Hopf Rule: 
No matches
[1m[32mTrue: The graph is graph-like[0m[0m
State Copy Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
No matches
Hopf Rule: 
No matches
[1m[32mTrue: The graph is graph-like[0m[0m
State Copy Rule: 
No matches

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	8	VertexType:	â—	Qubit:	4	Phase:	0	#Neighbors:	1	(167, [1m[34mH[0m[0m) 
ID:	9	VertexType:	â—	Qubit:	4	Phase:	0	#Neighbors:	1	(167, [1m[34mH[0m[0m) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (1, -) (167, [1m[34mH[0m[0m) 
ID:	167	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€	#Neighbors:	3	(8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) 
Total #Vertices: 6

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> qccr -R benchmark/pseudoSimp/achilles.qasm
Note: original quantum circuit is replaced...

qsyn> zxm -on
Error: ZXMODE is already ON

qsyn> qczxm
Successfully generated Graph 0
Checkout to Graph 0
---- TRAVERSE AND BUILD THE GRAPH ----
--------------------------------------

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 2 I X pi

qsyn> zxgas 2 O X pi

qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> zxgs -sr
Hadamard Rule: 9 . 3 . 2 iterations
Spider Fusion Rule: 
6 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementary Rule: 
2 iterations
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
1 iterations
Local Complementary Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
1 iterations
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
5 iterations
Hopf Rule: 
No matches
[1m[32mTrue: The graph is graph-like[0m[0m
State Copy Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
4 iterations
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Phase Gadget Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
2 iterations
Pivot Rule: 
1 iterations
Local Complementary Rule: 
4 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
No matches
Hopf Rule: 
No matches
[1m[32mTrue: The graph is graph-like[0m[0m
State Copy Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
No matches
Hopf Rule: 
No matches
[1m[32mTrue: The graph is graph-like[0m[0m
State Copy Rule: 
No matches

qsyn> zxgp -v
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	8	VertexType:	â—	Qubit:	4	Phase:	0	#Neighbors:	1	(167, [1m[34mH[0m[0m) 
ID:	9	VertexType:	â—	Qubit:	4	Phase:	0	#Neighbors:	1	(167, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(2, -) (3, -) (167, [1m[34mH[0m[0m) 
ID:	167	VertexType:	[1m[32mZ[0m[0m	Qubit:	-2	Phase:	Ï€	#Neighbors:	3	(8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
Total #Vertices: 6

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Successfully added Tensor 2
Stored the resulting tensor as tensor id 2

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 0 2
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 1 2
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> tsp 0
{{ 0.      +6.123234e-17i,  1.      -6.123234e-17i, 
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 1.      -6.123234e-17i,  0.      +6.123234e-17i, 
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i, 
   1.      -6.123234e-17i,  0.      +6.123234e-17i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i, 
   0.      +6.123234e-17i,  1.      -6.123234e-17i}}
#Dim:    2	Info: ZX 0

qsyn> q -f

