DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/pseudoSimp/achilles.qasm
Create and checkout to QCir 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 2 I X 0

qsyn> zxgas 2 O X 0

qsyn> zxgas 0 I X 0

qsyn> zxgas 0 O X 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -sr

qsyn> ver 3
Note: verbose level is set to 3

qsyn> zxgp -v

ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 36)	  #Neighbors:   1     (2, -) 
ID:   8 (â—, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (9, -) 
ID:   9 (â—, 0)           (Qubit, Col): (4, 36)	  #Neighbors:   1     (8, -) 
Total #Vertices: 4


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> qcnew
Create and checkout to QCir 1

qsyn> qcba 2

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

