DV Lab, NTUEE, Qsyn 0.5.1
qsyn> qccr benchmark/pseudoSimp/achilles.qasm
Created and checked out to QCir 0

qsyn> qc2zx
Created and checked out to ZXGraph 0

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 1 I X pi

qsyn> zxgas 1 O X pi

qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -sr

qsyn> ver 3
Note: verbose level is set to 3

qsyn> zx2ts
Traverse and build the tensor... 
Created and checked out to Tensor 0

qsyn> qccr -R benchmark/pseudoSimp/achilles.qasm
Note: original QCir is replaced...

qsyn> qc2zx
Created and checked out to ZXGraph 1

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 1 I X pi

qsyn> zxgas 1 O X pi

qsyn> zxgas 2 I X pi

qsyn> zxgas 2 O X pi

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -sr

qsyn> ver 3
Note: verbose level is set to 3

qsyn> zx2ts
Traverse and build the tensor... 
Created and checked out to Tensor 1

qsyn> qccr -R benchmark/pseudoSimp/achilles.qasm
Note: original QCir is replaced...

qsyn> qc2zx
Created and checked out to ZXGraph 2

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 2 I X pi

qsyn> zxgas 2 O X pi

qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -sr

qsyn> ver 3
Note: verbose level is set to 3

qsyn> zx2ts
Traverse and build the tensor... 
Created and checked out to Tensor 2

qsyn> tseq 0 1
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 0 2
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 1 2
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

