DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/pseudoSimp/achilles.qasm
Create and checkout to QCir 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgas 3 I X 0

qsyn> zxgas 3 O X 0

qsyn> zxgas 1 I X 0

qsyn> zxgas 1 O X 0

qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> ver 0
Note: verbose level is set to 0

qsyn> zxgs -sr

qsyn> zxgp -v

ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (35, [1m[34mH[0m[0m) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 36)	  #Neighbors:   1     (35, [1m[34mH[0m[0m) 
ID:   8 (â—, 0)           (Qubit, Col): (4, 0)	  #Neighbors:   1     (107, -) 
ID:   9 (â—, 0)           (Qubit, Col): (4, 36)	  #Neighbors:   1     (107, -) 
ID:  35 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 15)	  #Neighbors:   3     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (107, [1m[34mH[0m[0m) 
ID: 107 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (4, 30)	  #Neighbors:   3     (8, -) (9, -) (35, [1m[34mH[0m[0m) 
Total #Vertices: 6


qsyn> ver 3
Note: verbose level is set to 3

qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  1.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  1.      +0.i},
 { 0.      +0.i,  0.      +0.i,  1.      +0.i,  0.      +0.i}}
#Dim:    2	Info: ZX 0

qsyn> qq -f

