DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxnew
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxge -addi 0
Add vertex (●)0

qsyn> zxge -addo 0
Add vertex (●)1

qsyn> zxge -addi 1
Add vertex (●)2

qsyn> zxge -addo 1
Add vertex (●)3

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)4

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)5

qsyn> zxge -addv 0 Z 3.14159
Add vertex ([1m[32mZ[0m[0m)6

qsyn> zxge -addv 0 Z 3.14159
Add vertex ([1m[32mZ[0m[0m)7

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)8

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)9

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)10

qsyn> zxge -adde 4 6 HADAMARD
Add edge ( 4, 6 )

qsyn> zxge -adde 5 6 HADAMARD
Add edge ( 5, 6 )

qsyn> zxge -adde 6 7 HADAMARD
Add edge ( 6, 7 )

qsyn> zxge -adde 7 8 HADAMARD
Add edge ( 7, 8 )

qsyn> zxge -adde 7 9 HADAMARD
Add edge ( 7, 9 )

qsyn> zxge -adde 6 10 HADAMARD
Add edge ( 6, 10 )

qsyn> zxge -adde 7 10 HADAMARD
Add edge ( 7, 10 )

qsyn> zxge -adde 5 10 SIMPLE
Add edge ( 5, 10 )

qsyn> zxge -adde 9 10 SIMPLE
Add edge ( 9, 10 )

qsyn> zxge -adde 0 4 SIMPLE
Add edge ( 0, 4 )

qsyn> zxge -adde 2 5 SIMPLE
Add edge ( 2, 5 )

qsyn> zxge -adde 1 8 SIMPLE
Add edge ( 1, 8 )

qsyn> zxge -adde 3 9 SIMPLE
Add edge ( 3, 9 )

qsyn> zxgs -pivot

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   4 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (6, [1m[34mH[0m[0m) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (2, -) (6, [1m[34mH[0m[0m) (10, -) 
ID:   6 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (6, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (1, -) (7, [1m[34mH[0m[0m) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (3, -) (7, [1m[34mH[0m[0m) (10, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (5, -) (6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (9, -) 
Total #Vertices: 11

Pivot Rule: 

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   4 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (0, -) (6, [1m[34mH[0m[0m) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (2, -) (6, [1m[34mH[0m[0m) (10, -) 
ID:   6 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (6, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (1, -) (7, [1m[34mH[0m[0m) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (3, -) (7, [1m[34mH[0m[0m) (10, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (5, -) (6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (9, -) 
Total #Vertices: 11

Found 1 match(es)
Add vertex ([1m[32mZ[0m[0m)11
Add edge ( 0, 11 )
Add edge ( 11, 4 )
Remove edge ( 0, 4 ), type: -
> rewrite...
vs: 4	vt: 6
Add edge ( 11, 5 )
Add edge ( 11, 7 )
Add edge ( 11, 10 )
Remove ID: 4
Remove ID: 6

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (11, [1m[34mH[0m[0m) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (2, -) (10, -) (11, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (1, -) (7, [1m[34mH[0m[0m) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (3, -) (7, [1m[34mH[0m[0m) (10, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (5, -) (7, [1m[34mH[0m[0m) (9, -) (11, [1m[34mH[0m[0m) 
ID:  11 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (0, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
Total #Vertices: 10

Found 1 match(es)
Add vertex ([1m[32mZ[0m[0m)12
Add edge ( 1, 12 )
Add edge ( 12, 8 )
Remove edge ( 1, 8 ), type: -
> rewrite...
vs: 7	vt: 8
Add edge ( 9, 12 )
Add edge ( 10, 12 )
Add edge ( 11, 12 )
Remove ID: 7
Remove ID: 8

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (11, [1m[34mH[0m[0m) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (12, [1m[34mH[0m[0m) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (2, -) (10, -) (11, [1m[34mH[0m[0m) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (3, -) (10, -) (12, [1m[34mH[0m[0m) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (5, -) (9, -) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:  11 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (0, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:  12 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (1, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
Total #Vertices: 9

2 iterations


ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (11, [1m[34mH[0m[0m) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (12, [1m[34mH[0m[0m) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (2, -) (10, -) (11, [1m[34mH[0m[0m) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (3, -) (10, -) (12, [1m[34mH[0m[0m) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (5, -) (9, -) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:  11 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (0, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:  12 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (1, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
Total #Vertices: 9


qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (11, [1m[34mH[0m[0m) 
ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (12, [1m[34mH[0m[0m) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   5 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (2, -) (10, -) (11, [1m[34mH[0m[0m) 
ID:   9 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   3     (3, -) (10, -) (12, [1m[34mH[0m[0m) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (5, -) (9, -) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:  11 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (0, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:  12 ([1m[32mZ[0m[0m, π)           (Qubit, Col): (0, 0)	  #Neighbors:   4     (1, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
Total #Vertices: 9


qsyn> zxgp -e
( 0, 11 )	Type:	[1m[34mH[0m[0m
( 1, 12 )	Type:	[1m[34mH[0m[0m
( 2, 5 )	Type:	-
( 3, 9 )	Type:	-
( 5, 10 )	Type:	-
( 5, 11 )	Type:	[1m[34mH[0m[0m
( 9, 10 )	Type:	-
( 9, 12 )	Type:	[1m[34mH[0m[0m
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 10, 12 )	Type:	[1m[34mH[0m[0m
( 11, 12 )	Type:	[1m[34mH[0m[0m
Total #Edges: 11

qsyn> qq -f

