qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxmode -on
ZXMODE turn ON!

qsyn> zxnew
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxge -addi 0 0
Add input 0

qsyn> zxge -addo 1 0
Add output 1

qsyn> zxge -addi 2 1
Add input 2

qsyn> zxge -addo 3 1
Add output 3

qsyn> zxge -addv 4 0 Z 0
Add vertex 4

qsyn> zxge -addv 5 0 Z 0
Add vertex 5

qsyn> zxge -addv 6 0 Z 3.14159
Add vertex 6

qsyn> zxge -addv 7 0 Z 3.14159
Add vertex 7

qsyn> zxge -addv 8 0 Z 0
Add vertex 8

qsyn> zxge -addv 9 0 Z 0
Add vertex 9

qsyn> zxge -adde 4 6 HADAMARD
Add edge ( 4, 6 )

qsyn> zxge -adde 5 6 HADAMARD
Add edge ( 5, 6 )

qsyn> zxge -adde 6 7 HADAMARD
Add edge ( 6, 7 )

qsyn> zxge -adde 7 8 HADAMARD
Add edge ( 7, 8 )

qsyn> zxge -adde 7 9 HADAMARD
Add edge ( 7, 9 )

qsyn> zxge -adde 0 4 SIMPLE
Add edge ( 0, 4 )

qsyn> zxge -adde 2 5 SIMPLE
Add edge ( 2, 5 )

qsyn> zxge -adde 1 8 SIMPLE
Add edge ( 1, 8 )

qsyn> zxge -adde 3 9 SIMPLE
Add edge ( 3, 9 )

qsyn> zxgs -pivot
Pivot Rule: 
Found 1 match(es)
Add edge ( 6, 0 )
Remove ID: 4
Found 1 match(es)
Add edge ( 7, 0 )
Add edge ( 5, 8 )
Add edge ( 5, 9 )
Remove ID: 6
2 iterations

qsyn> q -f

