DV Lab, NTUEE, Qsyn 0.3.0
qsyn> // might match (4, 5)

qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxnew
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxge -addi 0
Add vertex (●)0

qsyn> zxge -addo 0
Add vertex (●)1

qsyn> zxge -addi 1
Add vertex (●)2

qsyn> zxge -addo 1
Add vertex (●)3

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)4

qsyn> zxge -addv 0 Z 3.14159
Add vertex ([1m[32mZ[0m[0m)5

qsyn> zxge -adde 4 5 HADAMARD
Add edge ( 4, 5 )

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)6

qsyn> zxge -adde 4 6 HADAMARD
Add edge ( 4, 6 )

qsyn> zxge -addv 0 Z 3.14159
Add vertex ([1m[32mZ[0m[0m)7

qsyn> zxge -addv 0 Z 3.14159
Add vertex ([1m[32mZ[0m[0m)8

qsyn> zxge -addv 0 Z 3.14159
Add vertex ([1m[32mZ[0m[0m)9

qsyn> zxge -adde 5 7 HADAMARD
Add edge ( 5, 7 )

qsyn> zxge -adde 5 8 HADAMARD
Add edge ( 5, 8 )

qsyn> zxge -adde 5 9 HADAMARD
Add edge ( 5, 9 )

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)10

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)11

qsyn> zxge -adde 5 10 HADAMARD
Add edge ( 5, 10 )

qsyn> zxge -adde 5 11 HADAMARD
Add edge ( 5, 11 )

qsyn> zxge -addv 0 Z 3.14159
Add vertex ([1m[32mZ[0m[0m)12

qsyn> zxge -addv 0 Z 3.14159
Add vertex ([1m[32mZ[0m[0m)13

qsyn> zxge -addv 0 Z 3.14159
Add vertex ([1m[32mZ[0m[0m)14

qsyn> zxge -addv 0 Z 3.14159
Add vertex ([1m[32mZ[0m[0m)15

qsyn> zxge -adde 4 12 HADAMARD
Add edge ( 4, 12 )

qsyn> zxge -adde 4 13 HADAMARD
Add edge ( 4, 13 )

qsyn> zxge -adde 4 14 HADAMARD
Add edge ( 4, 14 )

qsyn> zxge -adde 4 15 HADAMARD
Add edge ( 4, 15 )

qsyn> zxge -adde 5 12 HADAMARD
Add edge ( 5, 12 )

qsyn> zxge -adde 5 13 HADAMARD
Add edge ( 5, 13 )

qsyn> zxge -adde 5 14 HADAMARD
Add edge ( 5, 14 )

qsyn> zxge -adde 5 15 HADAMARD
Add edge ( 5, 15 )

qsyn> zxge -adde 0 10 SIMPLE
Add edge ( 0, 10 )

qsyn> zxge -adde 2 7 SIMPLE
Add edge ( 2, 7 )

qsyn> zxge -adde 1 11 SIMPLE
Add edge ( 1, 11 )

qsyn> zxge -adde 3 11 SIMPLE
Add edge ( 3, 11 )

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)16

qsyn> zxge -adde 6 16 SIMPLE
Add edge ( 6, 16 )

qsyn> zxge -addv 0 X 0
Add vertex ([1m[31mX[0m[0m)17

qsyn> zxge -adde 7 17 SIMPLE
Add edge ( 7, 17 )

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)18

qsyn> zxge -adde 8 18 SIMPLE
Add edge ( 8, 18 )

qsyn> zxge -addv 0 X 0
Add vertex ([1m[31mX[0m[0m)19

qsyn> zxge -adde 9 19 SIMPLE
Add edge ( 9, 19 )

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)20

qsyn> zxge -adde 10 20 SIMPLE
Add edge ( 10, 20 )

qsyn> zxge -addv 0 X 0
Add vertex ([1m[31mX[0m[0m)21

qsyn> zxge -adde 11 21 SIMPLE
Add edge ( 11, 21 )

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)22

qsyn> zxge -adde 12 22 SIMPLE
Add edge ( 12, 22 )

qsyn> zxge -addv 0 X 0
Add vertex ([1m[31mX[0m[0m)23

qsyn> zxge -adde 13 23 SIMPLE
Add edge ( 13, 23 )

qsyn> zxge -addv 0 Z 0
Add vertex ([1m[32mZ[0m[0m)24

qsyn> zxge -adde 14 24 SIMPLE
Add edge ( 14, 24 )

qsyn> zxge -addv 0 X 0
Add vertex ([1m[31mX[0m[0m)25

qsyn> zxge -adde 15 25 SIMPLE
Add edge ( 15, 25 )

qsyn> zxgs -pivot

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	6	(5, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	10	(4, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(4, [1m[34mH[0m[0m) (16, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(2, -) (5, [1m[34mH[0m[0m) (17, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(5, [1m[34mH[0m[0m) (18, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(5, [1m[34mH[0m[0m) (19, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (5, [1m[34mH[0m[0m) (20, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(1, -) (3, -) (5, [1m[34mH[0m[0m) (21, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (22, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (23, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (24, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (25, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	19	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(9, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	22	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(12, -) 
ID:	23	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(13, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	25	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(15, -) 
Total #Vertices: 26

Pivot Rule: 

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	6	(5, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	10	(4, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(4, [1m[34mH[0m[0m) (16, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(2, -) (5, [1m[34mH[0m[0m) (17, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(5, [1m[34mH[0m[0m) (18, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(5, [1m[34mH[0m[0m) (19, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (5, [1m[34mH[0m[0m) (20, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(1, -) (3, -) (5, [1m[34mH[0m[0m) (21, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (22, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (23, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (24, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (25, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	19	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(9, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	22	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(12, -) 
ID:	23	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(13, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	25	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(15, -) 
Total #Vertices: 26

Found 1 match(es)
> rewrite...
vs: 4	vt: 5
Add edge ( 6, 7 )
Add edge ( 6, 8 )
Add edge ( 6, 9 )
Add edge ( 6, 10 )
Add edge ( 6, 11 )
Add edge ( 6, 12 )
Add edge ( 6, 13 )
Add edge ( 6, 14 )
Add edge ( 6, 15 )
Add edge ( 7, 12 )
Add edge ( 7, 13 )
Add edge ( 7, 14 )
Add edge ( 7, 15 )
Add edge ( 8, 12 )
Add edge ( 8, 13 )
Add edge ( 8, 14 )
Add edge ( 8, 15 )
Add edge ( 9, 12 )
Add edge ( 9, 13 )
Add edge ( 9, 14 )
Add edge ( 9, 15 )
Add edge ( 10, 12 )
Add edge ( 10, 13 )
Add edge ( 10, 14 )
Add edge ( 10, 15 )
Add edge ( 11, 12 )
Add edge ( 11, 13 )
Add edge ( 11, 14 )
Add edge ( 11, 15 )
Remove ID: 4
Remove ID: 5

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	10	(7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (16, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(2, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (17, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	6	(6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (18, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	6	(6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (19, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	7	(0, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (20, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	8	(1, -) (3, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (21, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (22, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (23, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (24, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (25, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	19	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(9, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	22	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(12, -) 
ID:	23	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(13, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	25	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(15, -) 
Total #Vertices: 24

1 iterations


ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	10	(7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (16, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(2, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (17, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	6	(6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (18, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	6	(6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (19, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	7	(0, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (20, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	8	(1, -) (3, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (21, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (22, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (23, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (24, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (25, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	19	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(9, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	22	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(12, -) 
ID:	23	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(13, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	25	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(15, -) 
Total #Vertices: 24


qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	10	(7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (16, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(2, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (17, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	6	(6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (18, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	6	(6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (19, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	7	(0, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (20, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	8	(1, -) (3, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (21, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (22, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (23, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (24, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (25, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	19	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(9, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	22	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(12, -) 
ID:	23	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(13, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	25	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(15, -) 
Total #Vertices: 24


qsyn> zxgp -e
( 0, 10 )	Type:	-
( 1, 11 )	Type:	-
( 2, 7 )	Type:	-
( 3, 11 )	Type:	-
( 6, 16 )	Type:	-
( 6, 7 )	Type:	[1m[34mH[0m[0m
( 6, 8 )	Type:	[1m[34mH[0m[0m
( 6, 9 )	Type:	[1m[34mH[0m[0m
( 6, 10 )	Type:	[1m[34mH[0m[0m
( 6, 11 )	Type:	[1m[34mH[0m[0m
( 6, 12 )	Type:	[1m[34mH[0m[0m
( 6, 13 )	Type:	[1m[34mH[0m[0m
( 6, 14 )	Type:	[1m[34mH[0m[0m
( 6, 15 )	Type:	[1m[34mH[0m[0m
( 7, 17 )	Type:	-
( 7, 12 )	Type:	[1m[34mH[0m[0m
( 7, 13 )	Type:	[1m[34mH[0m[0m
( 7, 14 )	Type:	[1m[34mH[0m[0m
( 7, 15 )	Type:	[1m[34mH[0m[0m
( 8, 18 )	Type:	-
( 8, 12 )	Type:	[1m[34mH[0m[0m
( 8, 13 )	Type:	[1m[34mH[0m[0m
( 8, 14 )	Type:	[1m[34mH[0m[0m
( 8, 15 )	Type:	[1m[34mH[0m[0m
( 9, 19 )	Type:	-
( 9, 12 )	Type:	[1m[34mH[0m[0m
( 9, 13 )	Type:	[1m[34mH[0m[0m
( 9, 14 )	Type:	[1m[34mH[0m[0m
( 9, 15 )	Type:	[1m[34mH[0m[0m
( 10, 20 )	Type:	-
( 10, 12 )	Type:	[1m[34mH[0m[0m
( 10, 13 )	Type:	[1m[34mH[0m[0m
( 10, 14 )	Type:	[1m[34mH[0m[0m
( 10, 15 )	Type:	[1m[34mH[0m[0m
( 11, 21 )	Type:	-
( 11, 12 )	Type:	[1m[34mH[0m[0m
( 11, 13 )	Type:	[1m[34mH[0m[0m
( 11, 14 )	Type:	[1m[34mH[0m[0m
( 11, 15 )	Type:	[1m[34mH[0m[0m
( 12, 22 )	Type:	-
( 13, 23 )	Type:	-
( 14, 24 )	Type:	-
( 15, 25 )	Type:	-
Total #Edges: 43

qsyn> q -f

