qsyn> // might match (4, 5)

qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxmode -on
ZXMODE turn ON!

qsyn> zxnew
Successfully generate Graph 0
Checkout to Graph 0

qsyn> zxge -addi 0 0
Add input 0

qsyn> zxge -addo 1 0
Add output 1

qsyn> zxge -addi 2 1
Add input 2

qsyn> zxge -addo 3 1
Add output 3

qsyn> zxge -addv 4 0 Z 0
Add vertex 4

qsyn> zxge -addv 5 0 Z 3.14159
Add vertex 5

qsyn> zxge -adde 4 5 HADAMARD
Add edge ( 4, 5 )

qsyn> zxge -addv 6 0 Z 0
Add vertex 6

qsyn> zxge -adde 4 6 HADAMARD
Add edge ( 4, 6 )

qsyn> zxge -addv 7 0 Z 3.14159
Add vertex 7

qsyn> zxge -addv 8 0 Z 3.14159
Add vertex 8

qsyn> zxge -addv 9 0 Z 3.14159
Add vertex 9

qsyn> zxge -adde 5 7 HADAMARD
Add edge ( 5, 7 )

qsyn> zxge -adde 5 8 HADAMARD
Add edge ( 5, 8 )

qsyn> zxge -adde 5 9 HADAMARD
Add edge ( 5, 9 )

qsyn> zxge -addv 10 0 Z 0
Add vertex 10

qsyn> zxge -addv 11 0 Z 0
Add vertex 11

qsyn> zxge -adde 5 10 HADAMARD
Add edge ( 5, 10 )

qsyn> zxge -adde 5 11 HADAMARD
Add edge ( 5, 11 )

qsyn> zxge -addv 12 0 Z 3.14159
Add vertex 12

qsyn> zxge -addv 13 0 Z 3.14159
Add vertex 13

qsyn> zxge -addv 14 0 Z 3.14159
Add vertex 14

qsyn> zxge -addv 15 0 Z 3.14159
Add vertex 15

qsyn> zxge -adde 4 12 HADAMARD
Add edge ( 4, 12 )

qsyn> zxge -adde 4 13 HADAMARD
Add edge ( 4, 13 )

qsyn> zxge -adde 4 14 HADAMARD
Add edge ( 4, 14 )

qsyn> zxge -adde 4 15 HADAMARD
Add edge ( 4, 15 )

qsyn> zxge -adde 5 12 HADAMARD
Add edge ( 5, 12 )

qsyn> zxge -adde 5 13 HADAMARD
Add edge ( 5, 13 )

qsyn> zxge -adde 5 14 HADAMARD
Add edge ( 5, 14 )

qsyn> zxge -adde 5 15 HADAMARD
Add edge ( 5, 15 )

qsyn> zxge -adde 0 10 SIMPLE
Add edge ( 0, 10 )

qsyn> zxge -adde 2 7 SIMPLE
Add edge ( 2, 7 )

qsyn> zxge -adde 1 11 SIMPLE
Add edge ( 1, 11 )

qsyn> zxge -adde 3 11 SIMPLE
Add edge ( 3, 11 )

qsyn> zxge -addv 16 0 Z 0
Add vertex 16

qsyn> zxge -adde 6 16 SIMPLE
Add edge ( 6, 16 )

qsyn> zxge -addv 17 0 X 0
Add vertex 17

qsyn> zxge -adde 7 17 SIMPLE
Add edge ( 7, 17 )

qsyn> zxge -addv 18 0 Z 0
Add vertex 18

qsyn> zxge -adde 8 18 SIMPLE
Add edge ( 8, 18 )

qsyn> zxge -addv 19 0 X 0
Add vertex 19

qsyn> zxge -adde 9 19 SIMPLE
Add edge ( 9, 19 )

qsyn> zxge -addv 20 0 Z 0
Add vertex 20

qsyn> zxge -adde 10 20 SIMPLE
Add edge ( 10, 20 )

qsyn> zxge -addv 21 0 X 0
Add vertex 21

qsyn> zxge -adde 11 21 SIMPLE
Add edge ( 11, 21 )

qsyn> zxge -addv 22 0 Z 0
Add vertex 22

qsyn> zxge -adde 12 22 SIMPLE
Add edge ( 12, 22 )

qsyn> zxge -addv 23 0 X 0
Add vertex 23

qsyn> zxge -adde 13 23 SIMPLE
Add edge ( 13, 23 )

qsyn> zxge -addv 24 0 Z 0
Add vertex 24

qsyn> zxge -adde 14 24 SIMPLE
Add edge ( 14, 24 )

qsyn> zxge -addv 25 0 X 0
Add vertex 25

qsyn> zxge -adde 15 25 SIMPLE
Add edge ( 15, 25 )

qsyn> zxgs -pivot
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	6	(5, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	10	(4, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(4, [1m[34mH[0m[0m) (16, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(2, -) (5, [1m[34mH[0m[0m) (17, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(5, [1m[34mH[0m[0m) (18, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(5, [1m[34mH[0m[0m) (19, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (5, [1m[34mH[0m[0m) (20, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(1, -) (3, -) (5, [1m[34mH[0m[0m) (21, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (22, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (23, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (24, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (25, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	19	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(9, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	22	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(12, -) 
ID:	23	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(13, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	25	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(15, -) 
Total #Vertices: 26
Find match of pivot-rule: 1
Pivot Rule: 1 Add edge ( 6, 7 )
Add edge ( 6, 8 )
Add edge ( 6, 9 )
Add edge ( 6, 10 )
Add edge ( 6, 11 )
Add edge ( 6, 12 )
Add edge ( 6, 13 )
Add edge ( 6, 14 )
Add edge ( 6, 15 )
Add edge ( 7, 12 )
Add edge ( 7, 13 )
Add edge ( 7, 14 )
Add edge ( 7, 15 )
Add edge ( 8, 12 )
Add edge ( 8, 13 )
Add edge ( 8, 14 )
Add edge ( 8, 15 )
Add edge ( 9, 12 )
Add edge ( 9, 13 )
Add edge ( 9, 14 )
Add edge ( 9, 15 )
Add edge ( 10, 12 )
Add edge ( 10, 13 )
Add edge ( 10, 14 )
Add edge ( 10, 15 )
Add edge ( 11, 12 )
Add edge ( 11, 13 )
Add edge ( 11, 14 )
Add edge ( 11, 15 )
Remove ID: 5
Remove ID: 4
. ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	10	(7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (16, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	7	(2, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (17, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	6	(6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (18, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	6	(6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (19, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	7	(0, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (20, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	8	(1, -) (3, -) (6, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) (13, [1m[34mH[0m[0m) (14, [1m[34mH[0m[0m) (15, [1m[34mH[0m[0m) (21, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (22, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (23, -) 
ID:	14	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (24, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	7	(6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (25, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	19	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(9, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
ID:	22	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(12, -) 
ID:	23	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(13, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(14, -) 
ID:	25	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(15, -) 
Total #Vertices: 24
Find match of pivot-rule: 0
1 iterations

qsyn> q -f

