DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/adr4_197.qasm

qsyn> qccp 
QCir 0( 16 qubits, 3439 gates)
Clifford    : 1941
└── 2-qubit : 1498
T-family    : 1498
Others      : 0
Depth       : 3088

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.13 seconds
Total time used  : 0.13 seconds
Total memory used: 25.34 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.06 seconds
Total time used  : 0.19 seconds
Total memory used: 25.34 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 3487 gates)
Clifford    : 3335
└── 2-qubit : 1581
T-family    : 692
Others      : 0
Depth       : 4378

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 2410 gates)
Clifford    : 1812
└── 2-qubit : 1454
T-family    : 692
Others      : 0
Depth       : 3298

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.73 seconds
Total time used  : 0.92 seconds
Total memory used: 42.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

