DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm85a_209.qasm

qsyn> qccp 
QCir 0( 16 qubits, 11414 gates)
Clifford    : 6430
└── 2-qubit : 4986
T-family    : 4984
Others      : 0
Depth       : 10630

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.44 seconds
Total time used  : 2.44 seconds
Total memory used: 231.1 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.5 seconds
Total time used  : 2.94 seconds
Total memory used: 231.1 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 9525 gates)
Clifford    : 9017
└── 2-qubit : 4361
T-family    : 1950
Others      : 0
Depth       : 13283

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 6726 gates)
Clifford    : 5116
└── 2-qubit : 3919
T-family    : 1950
Others      : 0
Depth       : 10071

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 9.54 seconds
Total time used  : 12.48 seconds
Total memory used: 255.1 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

