DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cycle10_2_110.qasm

qsyn> qccp 
QCir 0( 16 qubits, 6050 gates)
Clifford    : 3404
└── 2-qubit : 2648
T-family    : 2646
Others      : 0
Depth       : 5662

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.98 seconds
Total time used  : 0.98 seconds
Total memory used: 112.1 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.08 seconds
Total time used  : 1.06 seconds
Total memory used: 112.1 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 5449 gates)
Clifford    : 5419
└── 2-qubit : 2381
T-family    : 1160
Others      : 0
Depth       : 6996

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 3786 gates)
Clifford    : 2846
└── 2-qubit : 2102
T-family    : 1160
Others      : 0
Depth       : 5172

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.43 seconds
Total time used  : 2.49 seconds
Total memory used: 112.1 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

