DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dist_223.qasm

qsyn> qccp 
QCir 0( 16 qubits, 38046 gates)
Clifford    : 21428
└── 2-qubit : 16624
T-family    : 16618
Others      : 0
Depth       : 19694

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 23.53 seconds
Total time used  : 23.53 seconds
Total memory used: 1288 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.99 seconds
Total time used  : 24.52 seconds
Total memory used: 1288 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 32720 gates)
Clifford    : 32476
└── 2-qubit : 14667
T-family    : 6868
Others      : 0
Depth       : 28231

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 46.09 seconds
Total time used  : 70.61 seconds
Total memory used: 1288 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

