DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/hwb8_113.qasm

qsyn> qccp 
QCir 0( 16 qubits, 69380 gates)
Clifford    : 39042
└── 2-qubit : 30372
T-family    : 30338
Others      : 0
Depth       : 38717

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 11.79 seconds
Total time used  : 11.79 seconds
Total memory used: 748 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.72 seconds
Total time used  : 12.51 seconds
Total memory used: 748 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 65050 gates)
Clifford    : 62364
└── 2-qubit : 25640
T-family    : 14934
Others      : 0
Depth       : 56181

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 197.8 seconds
Total time used  : 210.3 seconds
Total memory used: 748 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

