DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/inc_237.qasm

qsyn> qccp 
QCir 0( 16 qubits, 10619 gates)
Clifford    : 5985
└── 2-qubit : 4636
T-family    : 4634
Others      : 0
Depth       : 9790

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.61 seconds
Total time used  : 2.61 seconds
Total memory used: 286.4 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.32 seconds
Total time used  : 2.93 seconds
Total memory used: 286.4 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 8701 gates)
Clifford    : 8065
└── 2-qubit : 3533
T-family    : 1942
Others      : 0
Depth       : 11216

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 5842 gates)
Clifford    : 4232
└── 2-qubit : 3161
T-family    : 1942
Others      : 0
Depth       : 8265

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 6.38 seconds
Total time used  : 9.31 seconds
Total memory used: 291.8 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

