DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/life_238.qasm

qsyn> qccp 
QCir 0( 16 qubits, 22445 gates)
Clifford    : 12645
└── 2-qubit : 9800
T-family    : 9800
Others      : 0
Depth       : 12511

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 5.24 seconds
Total time used  : 5.24 seconds
Total memory used: 428.8 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.34 seconds
Total time used  : 5.58 seconds
Total memory used: 428.8 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 19558 gates)
Clifford    : 18232
└── 2-qubit : 8567
T-family    : 4152
Others      : 0
Depth       : 18122

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 22.91 seconds
Total time used  : 28.49 seconds
Total memory used: 428.8 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

