DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqn_258.qasm

qsyn> qccp 
QCir 0( 16 qubits, 10223 gates)
Clifford    : 5764
└── 2-qubit : 4459
T-family    : 4459
Others      : 0
Depth       : 5458

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.45 seconds
Total time used  : 1.45 seconds
Total memory used: 207.7 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.13 seconds
Total time used  : 1.58 seconds
Total memory used: 207.7 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 9757 gates)
Clifford    : 9472
└── 2-qubit : 4158
T-family    : 2097
Others      : 0
Depth       : 8317

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 3.68 seconds
Total time used  : 5.26 seconds
Total memory used: 207.7 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

