DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_149.qasm

qsyn> qccp 
QCir 0( 16 qubits, 184864 gates)
Clifford    : 103986
└── 2-qubit : 80878
T-family    : 80878
Others      : 0
Depth       : 99585

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 12.69 seconds
Total time used  : 12.69 seconds
Total memory used: 927.7 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 3.78 seconds
Total time used  : 16.47 seconds
Total memory used: 927.7 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 186335 gates)
Clifford    : 218257
└── 2-qubit : 78613
T-family    : 40380
Others      : 0
Depth       : 121905

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 1248 seconds
Total time used  : 1265 seconds
Total memory used: 927.7 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

