qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxgr benchmark/zx/stcopy.zx
Successfully generate Graph 0
Checkout to Graph 0
Add input 0
Add input 1
Add output 2
Add vertex 3
Add vertex 4
Add vertex 5
Add vertex 6
Add vertex 7
Add vertex 8
Add vertex 9
Add vertex 10
Add edge ( 9, 10 )
Add edge ( 7, 8 )
Add edge ( 7, 9 )
Add edge ( 6, 7 )
Add edge ( 5, 7 )
Add edge ( 4, 6 )
Add edge ( 3, 5 )
Add edge ( 2, 10 )
Add edge ( 1, 4 )
Add edge ( 0, 3 )
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	2	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (5, [1m[34mH[0m[0m) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	3π/4	#Neighbors:	2	(3, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	5π/6	#Neighbors:	2	(4, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(5, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7π/8	#Neighbors:	2	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (9, [1m[34mH[0m[0m) 
Total #Vertices: 11
( 9, 10 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	[1m[34mH[0m[0m
( 7, 9 )	Type:	[1m[34mH[0m[0m
( 6, 7 )	Type:	[1m[34mH[0m[0m
( 5, 7 )	Type:	[1m[34mH[0m[0m
( 4, 6 )	Type:	[1m[34mH[0m[0m
( 3, 5 )	Type:	[1m[34mH[0m[0m
( 2, 10 )	Type:	-
( 1, 4 )	Type:	[1m[34mH[0m[0m
( 0, 3 )	Type:	-
Total #Edges: 10

qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	2	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (5, [1m[34mH[0m[0m) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	3π/4	#Neighbors:	2	(3, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	5π/6	#Neighbors:	2	(4, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(5, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7π/8	#Neighbors:	2	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (9, [1m[34mH[0m[0m) 
Total #Vertices: 11

qsyn> zxgp -e
( 9, 10 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	[1m[34mH[0m[0m
( 7, 9 )	Type:	[1m[34mH[0m[0m
( 6, 7 )	Type:	[1m[34mH[0m[0m
( 5, 7 )	Type:	[1m[34mH[0m[0m
( 4, 6 )	Type:	[1m[34mH[0m[0m
( 3, 5 )	Type:	[1m[34mH[0m[0m
( 2, 10 )	Type:	-
( 1, 4 )	Type:	[1m[34mH[0m[0m
( 0, 3 )	Type:	-
Total #Edges: 10

qsyn> zxgs -stco
Identity Removal Rule: 1 Remove ID: 8
Remove ID: 7
. 1 iterations

qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	2	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (5, [1m[34mH[0m[0m) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7π/4	#Neighbors:	1	(3, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	11π/6	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	15π/8	#Neighbors:	1	(10, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (9, [1m[34mH[0m[0m) 
Total #Vertices: 9

qsyn> zxgp -e
( 9, 10 )	Type:	[1m[34mH[0m[0m
( 4, 6 )	Type:	[1m[34mH[0m[0m
( 3, 5 )	Type:	[1m[34mH[0m[0m
( 2, 10 )	Type:	-
( 1, 4 )	Type:	[1m[34mH[0m[0m
( 0, 3 )	Type:	-
Total #Edges: 6

qsyn> zxgr -r benchmark/zx/stcopy_boundary.zx
Note: original zxGraph is replaced...
Add input 0
Add input 1
Add output 2
Add vertex 3
Add vertex 5
Add vertex 7
Add vertex 8
Add vertex 9
Add vertex 10
Add edge ( 9, 10 )
Add edge ( 7, 8 )
Add edge ( 7, 9 )
Add edge ( 5, 7 )
Add edge ( 3, 5 )
Add edge ( 2, 10 )
Add edge ( 1, 7 )
Add edge ( 0, 3 )
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	2	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (5, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	3π/4	#Neighbors:	2	(3, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(1, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7π/8	#Neighbors:	2	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (9, [1m[34mH[0m[0m) 
Total #Vertices: 9
( 9, 10 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	[1m[34mH[0m[0m
( 7, 9 )	Type:	[1m[34mH[0m[0m
( 5, 7 )	Type:	[1m[34mH[0m[0m
( 3, 5 )	Type:	[1m[34mH[0m[0m
( 2, 10 )	Type:	-
( 1, 7 )	Type:	[1m[34mH[0m[0m
( 0, 3 )	Type:	-
Total #Edges: 8

qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	2	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (5, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	3π/4	#Neighbors:	2	(3, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(1, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7π/8	#Neighbors:	2	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (9, [1m[34mH[0m[0m) 
Total #Vertices: 9

qsyn> zxgp -e
( 9, 10 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	[1m[34mH[0m[0m
( 7, 9 )	Type:	[1m[34mH[0m[0m
( 5, 7 )	Type:	[1m[34mH[0m[0m
( 3, 5 )	Type:	[1m[34mH[0m[0m
( 2, 10 )	Type:	-
( 1, 7 )	Type:	[1m[34mH[0m[0m
( 0, 3 )	Type:	-
Total #Edges: 8

qsyn> zxgs -stco
Identity Removal Rule: 1 Add vertex 11
Add edge ( 11, 1 )
Add edge ( 7, 11 )
Remove ID: 8
Remove ID: 7
. 1 iterations

qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	2	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (5, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7π/4	#Neighbors:	1	(3, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	15π/8	#Neighbors:	1	(10, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (9, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	π	#Neighbors:	1	(1, -) 
Total #Vertices: 8

qsyn> zxgp -e
( 9, 10 )	Type:	[1m[34mH[0m[0m
( 3, 5 )	Type:	[1m[34mH[0m[0m
( 2, 10 )	Type:	-
( 0, 3 )	Type:	-
( 11, 1 )	Type:	-
Total #Edges: 5

qsyn> q -f

