DV Lab, NTUEE, Qsyn 0.3.0
qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxgr benchmark/zx/stcopy.zx
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (5, [1m[34mH[0m[0m) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	3Ï€/4	#Neighbors:	2	(3, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	5Ï€/6	#Neighbors:	2	(4, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(5, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	1	(7, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/8	#Neighbors:	2	(7, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (9, [1m[34mH[0m[0m) 
Total #Vertices: 11


qsyn> zxgp -e
( 0, 3 )	Type:	-
( 1, 4 )	Type:	[1m[34mH[0m[0m
( 2, 10 )	Type:	-
( 3, 5 )	Type:	[1m[34mH[0m[0m
( 4, 6 )	Type:	[1m[34mH[0m[0m
( 5, 7 )	Type:	[1m[34mH[0m[0m
( 6, 7 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	[1m[34mH[0m[0m
( 7, 9 )	Type:	[1m[34mH[0m[0m
( 9, 10 )	Type:	[1m[34mH[0m[0m
Total #Edges: 10

qsyn> zxgs -stco
State Copy Rule: 
1 iterations

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (5, [1m[34mH[0m[0m) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(1, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	1	(3, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	11Ï€/6	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	15Ï€/8	#Neighbors:	1	(10, [1m[34mH[0m[0m) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (9, [1m[34mH[0m[0m) 
Total #Vertices: 9


qsyn> zxgp -e
( 0, 3 )	Type:	-
( 1, 4 )	Type:	[1m[34mH[0m[0m
( 2, 10 )	Type:	-
( 3, 5 )	Type:	[1m[34mH[0m[0m
( 4, 6 )	Type:	[1m[34mH[0m[0m
( 9, 10 )	Type:	[1m[34mH[0m[0m
Total #Edges: 6

qsyn> zxgr -r benchmark/zx/stcopy_boundary.zx
Note: original ZX-graph is replaced...

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(5, [1m[34mH[0m[0m) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (4, [1m[34mH[0m[0m) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	3Ï€/4	#Neighbors:	2	(3, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(1, [1m[34mH[0m[0m) (4, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	1	(5, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/8	#Neighbors:	2	(5, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (7, [1m[34mH[0m[0m) 
Total #Vertices: 9


qsyn> zxgp -e
( 0, 3 )	Type:	-
( 1, 5 )	Type:	[1m[34mH[0m[0m
( 2, 8 )	Type:	-
( 3, 4 )	Type:	[1m[34mH[0m[0m
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 5, 6 )	Type:	[1m[34mH[0m[0m
( 5, 7 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	[1m[34mH[0m[0m
Total #Edges: 8

qsyn> zxgs -stco
State Copy Rule: 
1 iterations

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(9, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (4, [1m[34mH[0m[0m) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7Ï€/4	#Neighbors:	1	(3, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	15Ï€/8	#Neighbors:	1	(8, [1m[34mH[0m[0m) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (7, [1m[34mH[0m[0m) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	1	(1, -) 
Total #Vertices: 8


qsyn> zxgp -e
( 0, 3 )	Type:	-
( 1, 9 )	Type:	-
( 2, 8 )	Type:	-
( 3, 4 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	[1m[34mH[0m[0m
Total #Edges: 5

qsyn> q -f

