DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/hwb8_113.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 39042
└── CX: 30372
T-family: 30338
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 32.43 seconds
Total time used  : 32.43 seconds
Total memory used: 711 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 11.42 seconds
Total time used  : 43.85 seconds
Total memory used: 711 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 67171
└── CX: 38219
T-family: 14934
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 414.9 seconds
Total time used  : 458.8 seconds
Total memory used: 711 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

