DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/life_238.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 12645
└── CX: 9800
T-family: 9800
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 15.63 seconds
Total time used  : 15.63 seconds
Total memory used: 375.8 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 4.24 seconds
Total time used  : 19.87 seconds
Total memory used: 375.8 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 22546
└── CX: 14967
T-family: 4152
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 53.77 seconds
Total time used  : 73.64 seconds
Total memory used: 375.8 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

