DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd53_251.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 731
└── CX: 564
T-family: 560
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.05 seconds
Total time used  : 0.05 seconds
Total memory used: 4.965 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.16 seconds
Total time used  : 0.21 seconds
Total memory used: 4.965 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 1349
└── CX: 739
T-family: 280
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.14 seconds
Total time used  : 0.35 seconds
Total memory used: 6.719 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

