DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd84_253.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 7701
└── CX: 5960
T-family: 5957
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.7 seconds
Total time used  : 8.7 seconds
Total memory used: 277.7 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.47 seconds
Total time used  : 11.17 seconds
Total memory used: 277.7 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 16933
└── CX: 11852
T-family: 2625
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 45.54 seconds
Total time used  : 56.71 seconds
Total memory used: 426 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

