DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/root_255.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 9669
└── CX: 7493
T-family: 7490
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 17.23 seconds
Total time used  : 17.23 seconds
Total memory used: 539.4 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 3.13 seconds
Total time used  : 20.36 seconds
Total memory used: 539.4 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 20871
└── CX: 14809
T-family: 3114
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 24.25 seconds
Total time used  : 44.61 seconds
Total memory used: 539.4 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

