DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf2_277.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 12405
└── CX: 10066
T-family: 7707
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.45 seconds
Total time used  : 1.45 seconds
Total memory used: 75 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.31 seconds
Total time used  : 3.76 seconds
Total memory used: 75 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 30347
└── CX: 17965
T-family: 5063
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 35.09 seconds
Total time used  : 38.85 seconds
Total memory used: 93.32 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

