DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/z4_268.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 1736
└── CX: 1343
T-family: 1337
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.27 seconds
Total time used  : 0.27 seconds
Total memory used: 14.25 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.49 seconds
Total time used  : 0.76 seconds
Total memory used: 14.25 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 3944
└── CX: 2694
T-family: 631
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.88 seconds
Total time used  : 1.64 seconds
Total memory used: 15.05 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

