qsyn> qcir qubit add 1

qsyn> qcir gate add rx -ph 6.28*0.46181601443868003 0 

qsyn> qcir gate add ry -ph 6.28*0.9850727657318968 0

qsyn> qcir gate add rz -ph 6.28*0.9477936955481501 0

qsyn> qcir print --diagram
Q 0  -rx( 0)--ry( 1)--rz( 2)-

qsyn> 
qsyn> qcir print --gate 0
Listed by gate ID
ID:   0 ( rx)      Time:    1     Qubit:   0       Phase: 601Ï€/651

qsyn> qc2ts

qsyn> 
qsyn> tensor print 0 
{{ 0.126496-0.02764i ,  0.169178-0.977043i},
 {-0.169178-0.977043i,  0.126496+0.02764i }}

qsyn> tensor sk-decompose -d 8 -r 4
Trace distance: 0.01842110061118192

qsyn> quit -f

