DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> zxm -on
Illegal command!! (zxm)

qsyn> qccread benchmark/benchmark_SABRE/large/qft_10.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qc2zx

qsyn> zxgp
Graph 0( 16 inputs, 16 outputs, 322 vertices, 396 edges )

qsyn> zxcopy

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgprint
Graph 1( 16 inputs, 16 outputs, 644 vertices, 808 edges )

qsyn> zxgs -fr
Spider Fusion Rule            11 iteration(s)
Identity Removal Rule         3 iteration(s)

qsyn> zxgp 
Graph 1( 16 inputs, 16 outputs, 32 vertices, 16 edges )

qsyn> zxgp -q 

ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(323, -) 
ID:	323	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 


ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(325, -) 
ID:	325	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 


ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(327, -) 
ID:	327	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(5, -) 


ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(329, -) 
ID:	329	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(7, -) 


ID:	9	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(331, -) 
ID:	331	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(9, -) 


ID:	11	VertexType:	●	Qubit:	5	Phase:	0	#Neighbors:	1	(333, -) 
ID:	333	VertexType:	●	Qubit:	5	Phase:	0	#Neighbors:	1	(11, -) 


ID:	13	VertexType:	●	Qubit:	6	Phase:	0	#Neighbors:	1	(335, -) 
ID:	335	VertexType:	●	Qubit:	6	Phase:	0	#Neighbors:	1	(13, -) 


ID:	15	VertexType:	●	Qubit:	7	Phase:	0	#Neighbors:	1	(337, -) 
ID:	337	VertexType:	●	Qubit:	7	Phase:	0	#Neighbors:	1	(15, -) 


ID:	17	VertexType:	●	Qubit:	8	Phase:	0	#Neighbors:	1	(339, -) 
ID:	339	VertexType:	●	Qubit:	8	Phase:	0	#Neighbors:	1	(17, -) 


ID:	19	VertexType:	●	Qubit:	9	Phase:	0	#Neighbors:	1	(341, -) 
ID:	341	VertexType:	●	Qubit:	9	Phase:	0	#Neighbors:	1	(19, -) 


ID:	21	VertexType:	●	Qubit:	10	Phase:	0	#Neighbors:	1	(343, -) 
ID:	343	VertexType:	●	Qubit:	10	Phase:	0	#Neighbors:	1	(21, -) 


ID:	23	VertexType:	●	Qubit:	11	Phase:	0	#Neighbors:	1	(345, -) 
ID:	345	VertexType:	●	Qubit:	11	Phase:	0	#Neighbors:	1	(23, -) 


ID:	25	VertexType:	●	Qubit:	12	Phase:	0	#Neighbors:	1	(347, -) 
ID:	347	VertexType:	●	Qubit:	12	Phase:	0	#Neighbors:	1	(25, -) 


ID:	27	VertexType:	●	Qubit:	13	Phase:	0	#Neighbors:	1	(349, -) 
ID:	349	VertexType:	●	Qubit:	13	Phase:	0	#Neighbors:	1	(27, -) 


ID:	29	VertexType:	●	Qubit:	14	Phase:	0	#Neighbors:	1	(351, -) 
ID:	351	VertexType:	●	Qubit:	14	Phase:	0	#Neighbors:	1	(29, -) 


ID:	31	VertexType:	●	Qubit:	15	Phase:	0	#Neighbors:	1	(353, -) 
ID:	353	VertexType:	●	Qubit:	15	Phase:	0	#Neighbors:	1	(31, -) 


qsyn> usage
Period time used : 0 seconds
Total time used  : 0 seconds
Total memory used: 3.312 M Bytes

qsyn> q -f

