DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 2
Note: verbose level is set to 2

qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxgr -bzx benchmark/demo/simp/ex1_id_2.bzx

qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	2	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(0, -) (3, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(2, -) (4, -) (5, -) 
ID:	4	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (3, -) (6, -) 
ID:	5	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(3, -) (7, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	π	#Neighbors:	2	(4, -) (8, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(5, -) (8, -) (9, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(6, -) (7, -) (10, -) 
ID:	9	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	10	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(8, -) 
Total #Vertices: 11


qsyn> zxgs -fr
Spider Fusion Rule: 
2 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
2 iterations
Local Complementation Rule: 
No matches
Identity Removal Rule: 
2 iterations
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementation Rule: 
No matches
Pivot Gadget Rule: 
No matches

qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(9, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(10, -) 
ID:	9	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(0, -) 
ID:	10	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(1, -) 
Total #Vertices: 4


qsyn> zx2ts
Stored the resulting tensor as tensor id 0

qsyn> zxgr -bzx benchmark/demo/simp/id_2.bzx

qsyn> zx2ts
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> q -f

