DV Lab, NTUEE, Qsyn 0.5.1
qsyn> ver 2
Note: verbose level is set to 2

qsyn> zxgr benchmark/demo/simp/ex1_id_2.bzx

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (4, -) 
ID:   2 (X, π)           (Qubit, Col): (0, 1)	  #Neighbors:   2     (0, -) (3, -) 
ID:   3 (Z, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   3     (2, -) (4, -) (5, -) 
ID:   4 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (3, -) (6, -) 
ID:   5 (X, π)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (3, -) (7, -) 
ID:   6 (X, π)           (Qubit, Col): (1, 2)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 (Z, 0)           (Qubit, Col): (0, 4)	  #Neighbors:   3     (5, -) (8, -) (9, -) 
ID:   8 (X, 0)           (Qubit, Col): (1, 3)	  #Neighbors:   3     (6, -) (7, -) (10, -) 
ID:   9 (●, 0)           (Qubit, Col): (0, 5)	  #Neighbors:   1     (7, -) 
ID:  10 (●, 0)           (Qubit, Col): (1, 5)	  #Neighbors:   1     (8, -) 
Total #Vertices: 11


qsyn> zxgs -fr

All rules applied in order:
Spider Fusion Rule            2 iterations.
Pivot Rule                    2 iterations.
Identity Removal Rule         2 iterations.

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (9, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   9 (●, 0)           (Qubit, Col): (0, 5)	  #Neighbors:   1     (0, -) 
ID:  10 (●, 0)           (Qubit, Col): (1, 5)	  #Neighbors:   1     (1, -) 
Total #Vertices: 4


qsyn> zx2ts

qsyn> zxgr benchmark/demo/simp/id_2.bzx

qsyn> zx2ts

qsyn> tseq 0 1
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

