qsyn> ver 1
Note: verbose level is set to 1

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qccread benchmark/benchmark_SABRE/large/ham15_107.qasm

qsyn> qczxm

qsyn> zxgp
Graph 0
Inputs:        16
Outputs:       16
Vertices:      12653
Edges:         16495

qsyn> zxcopy

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgprint
Graph 1
Inputs:        16
Outputs:       16
Vertices:      25274
Edges:         32974

qsyn> zxgs -fr