DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> qccread benchmark/benchmark_SABRE/large/qft_10.qasm

qsyn> qc2zx

qsyn> zxcopy

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 322 vertices, 396 edges )

qsyn> zxgp -a
#T-gate:                      18
#Non-(Clifford+T)-gate:       72
#Non-Clifford-gate:           90

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Identity Removal Rule

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 32 vertices, 16 edges )

qsyn> zxgp -a
#T-gate:                      0
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           0

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Identity Removal Rule

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 32 vertices, 16 edges )

qsyn> usage
Period time used : 0 seconds
Total time used  : 0 seconds
Total memory used: 3.23 M Bytes

qsyn> qq -f

