DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> qccread benchmark/benchmark_SABRE/large/root_255.qasm

qsyn> qc2zx

qsyn> zxcopy

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 24684 vertices, 32161 edges )

qsyn> zxgp -a
#T-gate:                      7490
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           7490

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Pivot Rule
(4) Pivot Gadget Rule
(5) Identity Removal Rule
(6) Local Complementation Rule
(7) Phase Gadget Rule

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 5117 vertices, 34979 edges )

qsyn> zxgp -a
#T-gate:                      3114
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           3114

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Identity Removal Rule
(4) Pivot Rule
(5) Local Complementation Rule
(6) Pivot Gadget Rule
(7) Phase Gadget Rule

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 5943 vertices, 41545 edges )

qsyn> usage
Period time used : 94.15 seconds
Total time used  : 94.15 seconds
Total memory used: 571.6 M Bytes

qsyn> qq -f

