DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> qccread benchmark/benchmark_SABRE/large/adr4_197.qasm

qsyn> qc2zx

qsyn> zxcopy

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 4969 vertices, 6451 edges )

qsyn> zxgp -a
#T-gate:                      1498
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           1498

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Pivot Rule
(4) Pivot Gadget Rule
(5) Identity Removal Rule
(6) Local Complementation Rule
(7) Phase Gadget Rule

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 1218 vertices, 4953 edges )

qsyn> zxgp -a
#T-gate:                      692
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           692

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Identity Removal Rule
(4) Pivot Rule
(5) Local Complementation Rule
(6) Pivot Gadget Rule
(7) Phase Gadget Rule
(8) Pivot Boundary Rule

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 32 vertices, 16 edges )

qsyn> usage
Period time used : 2.35 seconds
Total time used  : 2.35 seconds
Total memory used: 56.91 M Bytes

qsyn> qq -f

