DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> qccread benchmark/benchmark_SABRE/large/ham15_107.qasm

qsyn> qc2zx

qsyn> zxcopy

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 12653 vertices, 16495 edges )

qsyn> zxgp -a
#T-gate:                      3815
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           3815

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Identity Removal Rule
(4) Pivot Rule
(5) Pivot Gadget Rule
(6) Local Complementation Rule
(7) Phase Gadget Rule

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 3051 vertices, 10941 edges )

qsyn> zxgp -a
#T-gate:                      1805
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           1805

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Identity Removal Rule
(4) Pivot Rule
(5) Local Complementation Rule
(6) Pivot Gadget Rule
(7) Phase Gadget Rule

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 32 vertices, 16 edges )

qsyn> usage
Period time used : 25.12 seconds
Total time used  : 25.12 seconds
Total memory used: 420.1 M Bytes

qsyn> qq -f

