DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> qccread benchmark/benchmark_SABRE/large/dc2_222.qasm

qsyn> qc2zx

qsyn> zxcopy

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 13625 vertices, 17740 edges )

qsyn> zxgp -a
#T-gate:                      4130
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           4130

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Pivot Rule
(4) Pivot Gadget Rule
(5) Identity Removal Rule
(6) Local Complementation Rule
(7) Phase Gadget Rule

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 2933 vertices, 12820 edges )

qsyn> zxgp -a
#T-gate:                      1758
#Non-(Clifford+T)-gate:       0
#Non-Clifford-gate:           1758

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Identity Removal Rule
(4) Pivot Rule
(5) Local Complementation Rule
(6) Pivot Gadget Rule
(7) Phase Gadget Rule
(8) Pivot Boundary Rule

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 32 vertices, 16 edges )

qsyn> usage
Period time used : 26.81 seconds
Total time used  : 26.81 seconds
Total memory used: 242.8 M Bytes

qsyn> qq -f

