DV Lab, NTUEE, Qsyn 0.4.2
qsyn> zxnew
Create and checkout to Graph 0

qsyn> zxgt

qsyn> zxgp
Graph 0( 2 inputs, 2 outputs, 6 vertices, 5 edges )

qsyn> zxcopy
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1

qsyn> zxgp
Graph 1( 2 inputs, 2 outputs, 6 vertices, 5 edges )

qsyn> zxge -rmv 1

qsyn> zxgp
Graph 1( 1 inputs, 2 outputs, 5 vertices, 4 edges )

qsyn> zxch 0
Checkout to Graph 0

qsyn> zxgp
Graph 0( 2 inputs, 2 outputs, 6 vertices, 5 edges )

qsyn> zxr

qsyn> zxnew
Create and checkout to Graph 0

qsyn> zxgt

qsyn> zxgp
Graph 0( 2 inputs, 2 outputs, 6 vertices, 5 edges )

qsyn> zxcopy
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1

qsyn> zxgp
Graph 1( 2 inputs, 2 outputs, 6 vertices, 5 edges )

qsyn> zxge -rmv 1

qsyn> zxgp
Graph 1( 1 inputs, 2 outputs, 5 vertices, 4 edges )

qsyn> zxcop -r 0
Successfully copied Graph 1 to Graph 0
Checkout to Graph 0

qsyn> zxgp
Graph 0( 1 inputs, 2 outputs, 5 vertices, 4 edges )

qsyn> zxr

qsyn> zxnew
Create and checkout to Graph 0

qsyn> zxgt

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (â—, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (â—, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxcopy
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1

qsyn> zxgt
Note: The graph is not empty! Generation failed!

qsyn> zxge -adde 0 5 HADAMARD

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (2, -) (5, [1m[34mH[0m[0m) 
ID:   1 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (â—, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (â—, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   2     (0, [1m[34mH[0m[0m) (3, -) 
Total #Vertices: 6


qsyn> zxcheckout 0
Checkout to Graph 0

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (â—, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (â—, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> qq -f

