DV Lab, NTUEE, Qsyn 0.3.0
qsyn> zxnew
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgt

qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6


qsyn> zxcopy
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1

qsyn> zxgt
Note: The graph is not empty! Generation failed!

qsyn> zxge -adde 0 5 HADAMARD

qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	2	(2, -) (5, [1m[34mH[0m[0m) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	2	(0, [1m[34mH[0m[0m) (3, -) 
Total #Vertices: 6


qsyn> zxcheckout 0
Checkout to Graph 0

qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6


qsyn> qq -f

