qsyn> zxmode -On
ZXMODE turn ON!

qsyn> ZXNew
Successfully generated Graph 0
Checkout to Graph 0

qsyn> ZXGTest
Generate a 2-qubit CNOT graph for testing

qsyn> ZXNew
Successfully generated Graph 1
Checkout to Graph 1

qsyn> ZXGTest
Generate a 2-qubit CNOT graph for testing

qsyn> zxcheckout 0
Checkout to Graph 0

qsyn> zxtensor 1

qsyn> zxgprint -e
( 3, 5 )	Type:	-
( 0, 2 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
( 11, 9 )	Type:	-
( 6, 10 )	Type:	-
( 7, 11 )	Type:	-
( 10, 11 )	Type:	-
( 10, 8 )	Type:	-
Total #Edges: 10

qsyn> zxgprint -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	6	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(10, -) 
ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(11, -) 
ID:	8	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(10, -) 
ID:	9	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(11, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(6, -) (8, -) (11, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(7, -) (9, -) (10, -) 
Total #Vertices: 12

qsyn> zxge -rmv 10

qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	6	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	0	
ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(11, -) 
ID:	8	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	0	
ID:	9	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(11, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	2	(7, -) (9, -) 
Total #Vertices: 11

qsyn> zxcheckout 1
Checkout to Graph 1

qsyn> zxgprint -e
( 3, 5 )	Type:	-
( 0, 2 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
Total #Edges: 5

qsyn> zxgprint -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6

qsyn> q -f

