qsyn> zxmode -On
ZXMODE turn ON!

qsyn> ZXNew
Successfully generate Graph 0
Checkout to Graph 0

qsyn> ZXGTest
Generate a 2-qubit CNOT graph for testing
Add edge ( 3, 5 )
Add edge ( 0, 2 )
Add edge ( 1, 3 )
Add edge ( 2, 3 )
Add edge ( 2, 4 )

qsyn> ZXNew
Successfully generate Graph 1
Checkout to Graph 1

qsyn> ZXGTest
Generate a 2-qubit CNOT graph for testing
Add edge ( 3, 5 )
Add edge ( 0, 2 )
Add edge ( 1, 3 )
Add edge ( 2, 3 )
Add edge ( 2, 4 )

qsyn> zxcheckout 0
Checkout to Graph 0

qsyn> zxcompose 1
Add edge ( 2, 10 )
Add edge ( 3, 11 )
Remove ID: 4
Remove ID: 5
Remove ID: 6
Remove ID: 7

qsyn> zxgprint
Graph 0
Inputs:        2
Outputs:       2
Vertices:      8
Edges:         8

qsyn> zxgprint -e
( 0, 2 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 10 )	Type:	-
( 3, 11 )	Type:	-
( 11, 9 )	Type:	-
( 10, 11 )	Type:	-
( 10, 8 )	Type:	-
Total #Edges: 8

qsyn> zxgprint -i
Input 1:       0
Input 2:       1
Total #Inputs: 2

qsyn> zxgprint -o
Output 1:      8
Output 2:      9
Total #Outputs: 2

qsyn> zxgprint -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (10, -) 
ID:	3	VertexType:	[1;31mX[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (11, -) 
ID:	8	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	9	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	10	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(2, -) (8, -) (11, -) 
ID:	11	VertexType:	[1;31mX[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (9, -) (10, -) 
Total #Vertices: 8

qsyn> zxcheckout 1
Checkout to Graph 1

qsyn> zxgprint -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1;31mX[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6

qsyn> zxgedit -rmv 1
Remove ID: 1

qsyn> zxgprint -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	2	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1;31mX[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(2, -) (5, -) 
ID:	4	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 5

qsyn> zxcheckout 0
Checkout to Graph 0

qsyn> zxgprint -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (10, -) 
ID:	3	VertexType:	[1;31mX[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (11, -) 
ID:	8	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	9	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(11, -) 
ID:	10	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(2, -) (8, -) (11, -) 
ID:	11	VertexType:	[1;31mX[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (9, -) (10, -) 
Total #Vertices: 8

qsyn> q -f

