DV Lab, NTUEE, Qsyn 0.4.2
qsyn> ver 2
Note: verbose level is set to 2

qsyn> qcba
Note: QCir list is empty now. Create a new one.

qsyn> qc2ts
Stored the resulting tensor as tensor id 0

qsyn> qcga -rz -ph 0.001 0

qsyn> qc2ts
Stored the resulting tensor as tensor id 1

qsyn> ver 3
Note: verbose level is set to 3

qsyn> tseq 0 1 -Eps 1e-2
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 0 1 -Eps 1e-4
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 0 1 -Eps 1e-6
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> tseq 0 1 -Eps 1e-8
[1m[31mNot Equivalent[0m[0m

qsyn> tseq 0 1 -Eps 1e-10
[1m[31mNot Equivalent[0m[0m

qsyn> qq -f

