qsyn> qcba
Note: QCir list is empty now. Create a new one.

qsyn> qc2ts

qsyn> qcba

qsyn> qc2ts

qsyn> tensor list
  0                        #Dim: 2   QC2TS
â˜… 1                        #Dim: 2   QC2TS

qsyn> tensor equiv 0 1 
Not Equivalent

qsyn> tensor equiv 0 1 -strict
Not Equivalent

qsyn> quit -f

