DV Lab, NTUEE, Qsyn 0.5.1
qsyn> ver 2
Note: verbose level is set to 2

qsyn> qcba
Note: QCir list is empty now. Create a new one.

qsyn> qc2ts

qsyn> qcba

qsyn> qc2ts

qsyn> ver 3
Note: verbose level is set to 3

qsyn> tsp -l
  0                        QC2TS
â˜… 1                        QC2TS

qsyn> tseq 0 1 
[1m[31mNot Equivalent[0m[0m

qsyn> tseq 0 1 -Strict
[1m[31mNot Equivalent[0m[0m

qsyn> qq -f

