qsyn> qcba
Note: QCir list is empty now. Create a new one.

qsyn> qc2ts

qsyn> qcba

qsyn> qc2ts

qsyn> tsp -l
  0                        #Dim: 2   QC2TS
â˜… 1                        #Dim: 2   QC2TS

qsyn> tseq 0 1 
Not Equivalent

qsyn> tseq 0 1 -strict
Not Equivalent

qsyn> qq -f

