qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxmode -on
ZXMODE turn ON!

qsyn> qcba

qsyn> qcga -h 0

qsyn> qcga -h 0

qsyn> qcga -h 0

qsyn> qccp
Listed by gate ID
Gate 0: h   	 Exec Time: 0 	 Qubit: 0 
Gate 1: h   	 Exec Time: 1 	 Qubit: 0 
Gate 2: h   	 Exec Time: 2 	 Qubit: 0 

qsyn> qczxm
Successfully generated Graph 0
Checkout to Graph 0
----------- ADD BOUNDARIES -----------
Add input 0
Add output 1
Add edge ( 0, 1 )
--------------------------------------

---- TRAVERSE AND BUILD THE GRAPH ----
Gate 0 (h)
**** Generate ZX of Gate 0 (h) ****
Add input 3
Add vertex 2
Add output 4
Add edge ( 3, 2 )
Add edge ( 2, 4 )
***********************************
********** CONCATENATION **********
Remove edge ( 3, 2 )
Add edge ( 0, 2 )
Remove edge ( 4, 2 )
Add edge ( 2, 1 )
***********************************
Gate 1 (h)
**** Generate ZX of Gate 1 (h) ****
Add input 4
Add vertex 3
Add output 5
Add edge ( 4, 3 )
Add edge ( 3, 5 )
***********************************
********** CONCATENATION **********
Remove edge ( 4, 3 )
Add edge ( 2, 3 )
Remove edge ( 5, 3 )
Add edge ( 3, 1 )
***********************************
Gate 2 (h)
**** Generate ZX of Gate 2 (h) ****
Add input 5
Add vertex 4
Add output 6
Add edge ( 5, 4 )
Add edge ( 4, 6 )
***********************************
********** CONCATENATION **********
Remove edge ( 5, 4 )
Add edge ( 3, 4 )
Remove edge ( 6, 4 )
Add edge ( 4, 1 )
***********************************
--------------------------------------

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	2	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(0, -) (3, -) 
ID:	3	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(2, -) (4, -) 
ID:	4	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(1, -) (3, -) 
Total #Vertices: 5

qsyn> zxge -rme 2 3
Remove edge ( 2, 3 )

qsyn> zxge -rme 3 4
Remove edge ( 3, 4 )

qsyn> zxge -adde 2 3 HADAMARD
Add edge ( 2, 3 )

qsyn> zxge -adde 3 4 HADAMARD
Add edge ( 3, 4 )

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	2	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(0, -) (3, [1m[34mH[0m[0m) 
ID:	3	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(2, [1m[34mH[0m[0m) (4, [1m[34mH[0m[0m) 
ID:	4	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(1, -) (3, [1m[34mH[0m[0m) 
Total #Vertices: 5

qsyn> zxgsimp -hf
Hadamard Cancellation Rule: 
Found 1 match(es)
Add edge ( 3, 0 )
Remove ID: 2
Found 1 match(es)
Add edge ( 4, 0 )
Remove ID: 3
2 iterations

qsyn> q -f

