DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 9
Note: verbose level is set to 9

qsyn> qcba
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qcba 

qsyn> qcga -z 0

qsyn> qcga -z 1

qsyn> qccp -l
Listed by gate ID
Gate 0: z   	 Exec Time: 0 	 Qubit: 0 
Gate 1: z   	 Exec Time: 0 	 Qubit: 1 

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 0
Checkout to Graph 0
> Add boundaries
Add vertex (â—)0
Add vertex (â—)1
Add edge ( 0, 1 )
Add vertex (â—)2
Add vertex (â—)3
Add edge ( 2, 3 )
> Gate 1 (z)
**** Generate ZX of Gate 1 (z) ****
Add vertex (â—)0
Add vertex ([1m[32mZ[0m[0m)1
Add vertex (â—)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
Remove edge ( 0, 4 ), type: -
Add edge ( 2, 4 )
Remove edge ( 2, 4 ), type: -
Add edge ( 4, 3 )
> Gate 0 (z)
**** Generate ZX of Gate 0 (z) ****
Add vertex (â—)0
Add vertex ([1m[32mZ[0m[0m)1
Add vertex (â—)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
Remove edge ( 0, 5 ), type: -
Add edge ( 0, 5 )
Remove edge ( 2, 5 ), type: -
Add edge ( 5, 1 )

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	2	(2, -) (3, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(0, -) (1, -) 
Total #Vertices: 6


qsyn> zxge -addv 0 H_BOX 0
Add vertex ([1m[33mH[0m[0m)6

qsyn> zxge -addv 1 H_BOX 0
Add vertex ([1m[33mH[0m[0m)7

qsyn> zxge -adde 4 6 HADAMARD
Add edge ( 4, 6 )

qsyn> zxge -adde 6 7 SIMPLE
Add edge ( 6, 7 )

qsyn> zxge -adde 7 5 HADAMARD
Add edge ( 7, 5 )

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	3	(2, -) (3, -) (6, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(0, -) (1, -) (7, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(4, [1m[34mH[0m[0m) (7, -) 
ID:	7	VertexType:	[1m[33mH[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(5, [1m[34mH[0m[0m) (6, -) 
Total #Vertices: 8


qsyn> zxgsimp -hf

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	3	(2, -) (3, -) (6, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(0, -) (1, -) (7, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(4, [1m[34mH[0m[0m) (7, -) 
ID:	7	VertexType:	[1m[33mH[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(5, [1m[34mH[0m[0m) (6, -) 
Total #Vertices: 8

Hadamard Rule: 1 Add edge ( 4, 7 )
Remove ID: 6
. 
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	3	(2, -) (3, -) (7, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(0, -) (1, -) (7, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[33mH[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(4, -) (5, [1m[34mH[0m[0m) 
Total #Vertices: 7

1 Add edge ( 5, 4 )
Remove ID: 7
. 
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	3	(2, -) (3, -) (5, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(0, -) (1, -) (4, -) 
Total #Vertices: 6

2 iterations
Hadamard Cancellation Rule: 

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	3	(2, -) (3, -) (5, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(0, -) (1, -) (4, -) 
Total #Vertices: 6

No matches


ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	3	(2, -) (3, -) (5, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(0, -) (1, -) (4, -) 
Total #Vertices: 6


qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	Ï€	#Neighbors:	3	(2, -) (3, -) (5, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(0, -) (1, -) (4, -) 
Total #Vertices: 6


qsyn> q -f

