qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxmode -on
ZXMODE turn ON!

qsyn> qcba

qsyn> qcba 

qsyn> qcga -z 0

qsyn> qcga -z 1

qsyn> qccp
Listed by gate ID
Gate 0: z   	 Exec Time: 0 	 Qubit: 0 
Gate 1: z   	 Exec Time: 0 	 Qubit: 1 

qsyn> qczxm
Successfully generated Graph 0
Checkout to Graph 0
----------- ADD BOUNDARIES -----------
Add input 0
Add output 1
Add edge ( 0, 1 )
Add input 2
Add output 3
Add edge ( 2, 3 )
--------------------------------------

---- TRAVERSE AND BUILD THE GRAPH ----
Gate 1 (z)
**** Generate ZX of Gate 1 (z) ****
Add input 5
Add vertex 4
Add output 6
Add edge ( 5, 4 )
Add edge ( 4, 6 )
***********************************
********** CONCATENATION **********
Remove edge ( 5, 4 )
Add edge ( 2, 4 )
Remove edge ( 6, 4 )
Add edge ( 4, 3 )
***********************************
Gate 0 (z)
**** Generate ZX of Gate 0 (z) ****
Add input 6
Add vertex 5
Add output 7
Add edge ( 6, 5 )
Add edge ( 5, 7 )
***********************************
********** CONCATENATION **********
Remove edge ( 6, 5 )
Add edge ( 0, 5 )
Remove edge ( 7, 5 )
Add edge ( 5, 1 )
***********************************
--------------------------------------

qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	π	#Neighbors:	2	(2, -) (3, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(0, -) (1, -) 
Total #Vertices: 6

qsyn> zxge -addv 6 0 H_BOX 0
Add vertex 6

qsyn> zxge -addv 7 1 H_BOX 0
Add vertex 7

qsyn> zxge -adde 4 6 HADAMARD
Add edge ( 4, 6 )

qsyn> zxge -adde 6 7 SIMPLE
Add edge ( 6, 7 )

qsyn> zxge -adde 7 5 HADAMARD
Add edge ( 7, 5 )

qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	π	#Neighbors:	3	(2, -) (3, -) (6, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(0, -) (1, -) (7, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(4, [1m[34mH[0m[0m) (7, -) 
ID:	7	VertexType:	[1m[33mH[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	2	(5, [1m[34mH[0m[0m) (6, -) 
Total #Vertices: 8

qsyn> zxgsimp -hf
Hadamard Rule: 1 Add edge ( 7, 4 )
Remove ID: 6
. 1 Add edge ( 4, 5 )
Remove ID: 7
. 2 iterations
Hadamard Cancellation Rule: 
No matches

qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	2	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	π	#Neighbors:	3	(2, -) (3, -) (5, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	3	(0, -) (1, -) (4, -) 
Total #Vertices: 6

qsyn> q -f

