DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 9
Note: verbose level is set to 9

qsyn> qcba
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qcga -h 0

qsyn> qcga -h 0

qsyn> qcga -z 0

qsyn> qcga -h 0

qsyn> qcga -h 0

qsyn> qcga -z 0

qsyn> qccp -l
Listed by gate ID
ID:   0 (  h)      Time:    0     Qubit:   0 
ID:   1 (  h)      Time:    1     Qubit:   0 
ID:   2 (  z)      Time:    2     Qubit:   0 
ID:   3 (  h)      Time:    3     Qubit:   0 
ID:   4 (  h)      Time:    4     Qubit:   0 
ID:   5 (  z)      Time:    5     Qubit:   0 

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 0
Checkout to Graph 0
> Add boundaries
Add vertex (â—)0
Add vertex (â—)1
Add edge ( 0, 1 )
> Gate 0 (h)
**** Generate ZX of Gate 0 (h) ****
Add vertex (â—)0
Add vertex ([1m[33mH[0m[0m)1
Add vertex (â—)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
Remove edge ( 0, 2 ), type: -
Add edge ( 0, 2 )
Remove edge ( 2, 2 ), type: -
Add edge ( 2, 1 )
> Gate 1 (h)
**** Generate ZX of Gate 1 (h) ****
Add vertex (â—)0
Add vertex ([1m[33mH[0m[0m)1
Add vertex (â—)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
Remove edge ( 0, 3 ), type: -
Add edge ( 2, 3 )
Remove edge ( 2, 3 ), type: -
Add edge ( 3, 1 )
> Gate 2 (z)
**** Generate ZX of Gate 2 (z) ****
Add vertex (â—)0
Add vertex ([1m[32mZ[0m[0m)1
Add vertex (â—)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
Remove edge ( 0, 4 ), type: -
Add edge ( 3, 4 )
Remove edge ( 2, 4 ), type: -
Add edge ( 4, 1 )
> Gate 3 (h)
**** Generate ZX of Gate 3 (h) ****
Add vertex (â—)0
Add vertex ([1m[33mH[0m[0m)1
Add vertex (â—)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
Remove edge ( 0, 5 ), type: -
Add edge ( 4, 5 )
Remove edge ( 2, 5 ), type: -
Add edge ( 5, 1 )
> Gate 4 (h)
**** Generate ZX of Gate 4 (h) ****
Add vertex (â—)0
Add vertex ([1m[33mH[0m[0m)1
Add vertex (â—)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
Remove edge ( 0, 6 ), type: -
Add edge ( 5, 6 )
Remove edge ( 2, 6 ), type: -
Add edge ( 6, 1 )
> Gate 5 (z)
**** Generate ZX of Gate 5 (z) ****
Add vertex (â—)0
Add vertex ([1m[32mZ[0m[0m)1
Add vertex (â—)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
Remove edge ( 0, 7 ), type: -
Add edge ( 6, 7 )
Remove edge ( 2, 7 ), type: -
Add edge ( 7, 1 )

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   1     (7, -) 
ID:   2 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 1)	  #Neighbors:   2     (0, -) (3, -) 
ID:   3 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 2)	  #Neighbors:   2     (2, -) (4, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (3, -) (5, -) 
ID:   5 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 4)	  #Neighbors:   2     (4, -) (6, -) 
ID:   6 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 5)	  #Neighbors:   2     (5, -) (7, -) 
ID:   7 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 6)	  #Neighbors:   2     (1, -) (6, -) 
Total #Vertices: 8


qsyn> zxge -rme 2 3 SIMPLE
Remove edge ( 2, 3 ), type: -

qsyn> zxge -adde 2 3 HADAMARD
Add edge ( 2, 3 )

qsyn> zxge -rme 4 5 SIMPLE
Remove edge ( 4, 5 ), type: -

qsyn> zxge -adde 4 5 HADAMARD
Add edge ( 4, 5 )

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   1     (7, -) 
ID:   2 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 1)	  #Neighbors:   2     (0, -) (3, [1m[34mH[0m[0m) 
ID:   3 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 2)	  #Neighbors:   2     (2, [1m[34mH[0m[0m) (4, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (3, -) (5, [1m[34mH[0m[0m) 
ID:   5 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 4)	  #Neighbors:   2     (4, [1m[34mH[0m[0m) (6, -) 
ID:   6 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 5)	  #Neighbors:   2     (5, -) (7, -) 
ID:   7 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 6)	  #Neighbors:   2     (1, -) (6, -) 
Total #Vertices: 8


qsyn> zxgsimp -hf

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   1     (7, -) 
ID:   2 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 1)	  #Neighbors:   2     (0, -) (3, [1m[34mH[0m[0m) 
ID:   3 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 2)	  #Neighbors:   2     (2, [1m[34mH[0m[0m) (4, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (3, -) (5, [1m[34mH[0m[0m) 
ID:   5 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 4)	  #Neighbors:   2     (4, [1m[34mH[0m[0m) (6, -) 
ID:   6 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 5)	  #Neighbors:   2     (5, -) (7, -) 
ID:   7 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 6)	  #Neighbors:   2     (1, -) (6, -) 
Total #Vertices: 8

Hadamard Rule: 2 Add edge ( 0, 3 )
Add edge ( 4, 6 )
Remove ID: 2
Remove ID: 5
. 
ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (3, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   1     (7, -) 
ID:   3 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 2)	  #Neighbors:   2     (0, -) (4, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (3, -) (6, -) 
ID:   6 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 5)	  #Neighbors:   2     (4, -) (7, -) 
ID:   7 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 6)	  #Neighbors:   2     (1, -) (6, -) 
Total #Vertices: 6

1 Add edge ( 0, 4 )
Remove ID: 3
. 
ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, [1m[34mH[0m[0m) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   1     (7, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (0, [1m[34mH[0m[0m) (6, -) 
ID:   6 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (0, 5)	  #Neighbors:   2     (4, -) (7, -) 
ID:   7 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 6)	  #Neighbors:   2     (1, -) (6, -) 
Total #Vertices: 5

1 Add edge ( 4, 7 )
Remove ID: 6
. 
ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, [1m[34mH[0m[0m) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   1     (7, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (0, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 6)	  #Neighbors:   2     (1, -) (4, [1m[34mH[0m[0m) 
Total #Vertices: 4

3 iterations
Hadamard Cancellation Rule: 

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, [1m[34mH[0m[0m) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   1     (7, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (0, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 6)	  #Neighbors:   2     (1, -) (4, [1m[34mH[0m[0m) 
Total #Vertices: 4

No matches


ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, [1m[34mH[0m[0m) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   1     (7, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (0, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 6)	  #Neighbors:   2     (1, -) (4, [1m[34mH[0m[0m) 
Total #Vertices: 4


qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, [1m[34mH[0m[0m) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   1     (7, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (0, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, Ï€)           (Qubit, Col): (0, 6)	  #Neighbors:   2     (1, -) (4, [1m[34mH[0m[0m) 
Total #Vertices: 4


qsyn> qq -f

