DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxmode -on
ZXMODE turn ON!

qsyn> qcba

qsyn> qcga -h 0

qsyn> qcga -h 0

qsyn> qccp
Listed by gate ID
Gate 0: h   	 Exec Time: 0 	 Qubit: 0 
Gate 1: h   	 Exec Time: 1 	 Qubit: 0 

qsyn> qc2zx
Successfully generated Graph 0
Checkout to Graph 0
----------- ADD BOUNDARIES -----------
Add vertex (â—)0
Add vertex (â—)1
Add edge ( 0, 1 )
--------------------------------------

---- TRAVERSE AND BUILD THE GRAPH ----
Gate 0 (h)
**** Generate ZX of Gate 0 (h) ****
Add vertex (â—)0
Add vertex ([1m[33mH[0m[0m)1
Add vertex (â—)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
********** CONCATENATION **********
Remove edge ( 0, 2 ), type: -
Add edge ( 0, 2 )
Remove edge ( 2, 2 ), type: -
Add edge ( 2, 1 )
***********************************
Gate 1 (h)
**** Generate ZX of Gate 1 (h) ****
Add vertex (â—)0
Add vertex ([1m[33mH[0m[0m)1
Add vertex (â—)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
********** CONCATENATION **********
Remove edge ( 0, 3 ), type: -
Add edge ( 2, 3 )
Remove edge ( 2, 3 ), type: -
Add edge ( 3, 1 )
***********************************
--------------------------------------

qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(0, -) (3, -) 
ID:	3	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(2, -) (1, -) 
Total #Vertices: 4


qsyn> zxgsimp -hr

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(0, -) (3, -) 
ID:	3	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(2, -) (1, -) 
Total #Vertices: 4

Hadamard Rule: 1 Add edge ( 0, 3 )
Remove ID: 2
. 
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, [1m[34mH[0m[0m) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	3	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(1, -) (0, [1m[34mH[0m[0m) 
Total #Vertices: 3

1 Add edge ( 1, 0 )
Remove ID: 3
. 
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(0, -) 
Total #Vertices: 2

2 iterations

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(0, -) 
Total #Vertices: 2


qsyn> zxgp -v

ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(0, -) 
Total #Vertices: 2


qsyn> q -f

