DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxmode -on
ZXMODE turn ON!

qsyn> qcba

qsyn> qcga -h 0

qsyn> qcga -h 0

qsyn> qcga -z 0

qsyn> qcga -h 0

qsyn> qcga -h 0

qsyn> qcga -z 0

qsyn> qccp
Listed by gate ID
Gate 0: h   	 Exec Time: 0 	 Qubit: 0 
Gate 1: h   	 Exec Time: 1 	 Qubit: 0 
Gate 2: z   	 Exec Time: 2 	 Qubit: 0 
Gate 3: h   	 Exec Time: 3 	 Qubit: 0 
Gate 4: h   	 Exec Time: 4 	 Qubit: 0 
Gate 5: z   	 Exec Time: 5 	 Qubit: 0 

qsyn> qc2zx
Successfully generated Graph 0
Checkout to Graph 0
----------- ADD BOUNDARIES -----------
Add vertex (●)0
Add vertex (●)1
Add edge ( 0, 1 )
--------------------------------------

---- TRAVERSE AND BUILD THE GRAPH ----
Gate 0 (h)
**** Generate ZX of Gate 0 (h) ****
Add vertex (●)0
Add vertex ([1m[33mH[0m[0m)1
Add vertex (●)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
********** CONCATENATION **********
Remove edge ( 0, 2 ), type: -
Add edge ( 0, 2 )
Remove edge ( 2, 2 ), type: -
Add edge ( 2, 1 )
***********************************
Gate 1 (h)
**** Generate ZX of Gate 1 (h) ****
Add vertex (●)0
Add vertex ([1m[33mH[0m[0m)1
Add vertex (●)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
********** CONCATENATION **********
Remove edge ( 0, 3 ), type: -
Add edge ( 2, 3 )
Remove edge ( 2, 3 ), type: -
Add edge ( 3, 1 )
***********************************
Gate 2 (z)
**** Generate ZX of Gate 2 (z) ****
Add vertex (●)0
Add vertex ([1m[32mZ[0m[0m)1
Add vertex (●)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
********** CONCATENATION **********
Remove edge ( 0, 4 ), type: -
Add edge ( 3, 4 )
Remove edge ( 2, 4 ), type: -
Add edge ( 4, 1 )
***********************************
Gate 3 (h)
**** Generate ZX of Gate 3 (h) ****
Add vertex (●)0
Add vertex ([1m[33mH[0m[0m)1
Add vertex (●)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
********** CONCATENATION **********
Remove edge ( 0, 5 ), type: -
Add edge ( 4, 5 )
Remove edge ( 2, 5 ), type: -
Add edge ( 5, 1 )
***********************************
Gate 4 (h)
**** Generate ZX of Gate 4 (h) ****
Add vertex (●)0
Add vertex ([1m[33mH[0m[0m)1
Add vertex (●)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
********** CONCATENATION **********
Remove edge ( 0, 6 ), type: -
Add edge ( 5, 6 )
Remove edge ( 2, 6 ), type: -
Add edge ( 6, 1 )
***********************************
Gate 5 (z)
**** Generate ZX of Gate 5 (z) ****
Add vertex (●)0
Add vertex ([1m[32mZ[0m[0m)1
Add vertex (●)2
Add edge ( 0, 1 )
Add edge ( 1, 2 )
***********************************
********** CONCATENATION **********
Remove edge ( 0, 7 ), type: -
Add edge ( 6, 7 )
Remove edge ( 2, 7 ), type: -
Add edge ( 7, 1 )
***********************************
--------------------------------------

qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(0, -) (3, -) 
ID:	3	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(2, -) (4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(3, -) (5, -) 
ID:	5	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(4, -) (6, -) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(5, -) (7, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(6, -) (1, -) 
Total #Vertices: 8


qsyn> zxge -rme 2 3 SIMPLE
Remove edge ( 2, 3 ), type: -

qsyn> zxge -adde 2 3 HADAMARD
Add edge ( 2, 3 )

qsyn> zxge -rme 4 5 SIMPLE
Remove edge ( 4, 5 ), type: -

qsyn> zxge -adde 4 5 HADAMARD
Add edge ( 4, 5 )

qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(0, -) (3, [1m[34mH[0m[0m) 
ID:	3	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(4, -) (2, [1m[34mH[0m[0m) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(3, -) (5, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(6, -) (4, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(5, -) (7, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(6, -) (1, -) 
Total #Vertices: 8


qsyn> zxgsimp -hf

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(0, -) (3, [1m[34mH[0m[0m) 
ID:	3	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(4, -) (2, [1m[34mH[0m[0m) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(3, -) (5, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(6, -) (4, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(5, -) (7, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(6, -) (1, -) 
Total #Vertices: 8

Hadamard Rule: 2 Add edge ( 0, 3 )
Add edge ( 6, 4 )
Remove ID: 2
Remove ID: 5
. 
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(4, -) (0, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(3, -) (6, -) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(7, -) (4, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(6, -) (1, -) 
Total #Vertices: 6

1 Add edge ( 4, 0 )
Remove ID: 3
. 
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(6, -) (0, [1m[34mH[0m[0m) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(7, -) (4, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(6, -) (1, -) 
Total #Vertices: 5

1 Add edge ( 7, 4 )
Remove ID: 6
. 
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(0, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(1, -) (4, [1m[34mH[0m[0m) 
Total #Vertices: 4

3 iterations
Hadamard Cancellation Rule: 

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(0, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(1, -) (4, [1m[34mH[0m[0m) 
Total #Vertices: 4

No matches


ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(0, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(1, -) (4, [1m[34mH[0m[0m) 
Total #Vertices: 4


qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(4, [1m[34mH[0m[0m) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(0, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(1, -) (4, [1m[34mH[0m[0m) 
Total #Vertices: 4


qsyn> q -f

