DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 9
Note: verbose level is set to 9

qsyn> qcba
Note: QCir list is empty now. Create a new one.
Create and checkout to QCir 0

qsyn> qcga -h 0

qsyn> qcga -h 0

qsyn> qcga -h 0

qsyn> qccp -l
Listed by gate ID
ID:   0 (  h)      Time:    0     Qubit:   0 
ID:   1 (  h)      Time:    1     Qubit:   0 
ID:   2 (  h)      Time:    2     Qubit:   0 

qsyn> qc2zx
Create and checkout to Graph 0
Traverse and build the graph... 

> Add boundaries
Add vertex (●) 0
Add vertex (●) 1
Add edge (0, 1)

> Gate 0 (h)
Add vertex (●) 0
Add vertex ([1m[33mH[0m[0m) 1
Add vertex (●) 2
Add edge (0, 1)
Add edge (1, 2)
Remove edge (0, 2), type: -
Add edge (0, 2)
Remove edge (2, 2), type: -
Add edge (2, 1)

> Gate 1 (h)
Add vertex (●) 0
Add vertex ([1m[33mH[0m[0m) 1
Add vertex (●) 2
Add edge (0, 1)
Add edge (1, 2)
Remove edge (0, 3), type: -
Add edge (2, 3)
Remove edge (2, 3), type: -
Add edge (3, 1)

> Gate 2 (h)
Add vertex (●) 0
Add vertex ([1m[33mH[0m[0m) 1
Add vertex (●) 2
Add edge (0, 1)
Add edge (1, 2)
Remove edge (0, 4), type: -
Add edge (3, 4)
Remove edge (2, 4), type: -
Add edge (4, 1)

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 4)	  #Neighbors:   1     (4, -) 
ID:   2 ([1m[33mH[0m[0m, π)           (Qubit, Col): (0, 1)	  #Neighbors:   2     (0, -) (3, -) 
ID:   3 ([1m[33mH[0m[0m, π)           (Qubit, Col): (0, 2)	  #Neighbors:   2     (2, -) (4, -) 
ID:   4 ([1m[33mH[0m[0m, π)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (1, -) (3, -) 
Total #Vertices: 5


qsyn> zxge -rme 0 2 SIMPLE
Remove edge (0, 2), type: -

qsyn> zxge -rme 2 3 SIMPLE
Remove edge (2, 3), type: -

qsyn> zxge -rme 3 4 SIMPLE
Remove edge (3, 4), type: -

qsyn> zxge -rme 4 1 SIMPLE
Remove edge (4, 1), type: -

qsyn> zxge -adde 0 2 HADAMARD
Add edge (0, 2)

qsyn> zxge -adde 2 3 HADAMARD
Add edge (2, 3)

qsyn> zxge -adde 3 4 HADAMARD
Add edge (3, 4)

qsyn> zxge -adde 4 1 HADAMARD
Add edge (4, 1)

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, [1m[34mH[0m[0m) 
ID:   1 (●, 0)           (Qubit, Col): (0, 4)	  #Neighbors:   1     (4, [1m[34mH[0m[0m) 
ID:   2 ([1m[33mH[0m[0m, π)           (Qubit, Col): (0, 1)	  #Neighbors:   2     (0, [1m[34mH[0m[0m) (3, [1m[34mH[0m[0m) 
ID:   3 ([1m[33mH[0m[0m, π)           (Qubit, Col): (0, 2)	  #Neighbors:   2     (2, [1m[34mH[0m[0m) (4, [1m[34mH[0m[0m) 
ID:   4 ([1m[33mH[0m[0m, π)           (Qubit, Col): (0, 3)	  #Neighbors:   2     (1, [1m[34mH[0m[0m) (3, [1m[34mH[0m[0m) 
Total #Vertices: 5


qsyn> zxgsimp -hf
Hadamard Rule                 

Iteration 1:
>>>
Add edge (0, 3)
Remove ID: 2
<<<

Iteration 2:
>>>
Add edge (0, 4)
Remove ID: 3
<<<

Iteration 3:
>>>
Add edge (0, 1)
Remove ID: 4
<<<
=> 3 iterations.
  1) 1 matches
  2) 1 matches
  3) 1 matches

Hadamard Cancellation Rule    
=> 0 iterations.


qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (1, [1m[34mH[0m[0m) 
ID:   1 (●, 0)           (Qubit, Col): (0, 4)	  #Neighbors:   1     (0, [1m[34mH[0m[0m) 
Total #Vertices: 2


qsyn> qq -f

