qsyn> ver 9
Note: verbose level is set to 9

qsyn> zxmode -on
ZXMODE turn ON!

qsyn> qcba

qsyn> qcga -h 0

qsyn> qcga -h 0

qsyn> qccp
Listed by gate ID
Gate 0: h   	 Exec Time: 0 	 Qubit: 0 
Gate 1: h   	 Exec Time: 1 	 Qubit: 0 

qsyn> qczxm
Successfully generated Graph 0
Checkout to Graph 0
----------- ADD BOUNDARIES -----------
Add input 0
Add output 1
Add edge ( 0, 1 )
--------------------------------------

---- TRAVERSE AND BUILD THE GRAPH ----
Gate 0 (h)
**** Generate ZX of Gate 0 (h) ****
Add input 3
Add vertex 2
Add output 4
Add edge ( 3, 2 )
Add edge ( 2, 4 )
***********************************
********** CONCATENATION **********
Remove edge ( 3, 2 )
Add edge ( 0, 2 )
Remove edge ( 4, 2 )
Add edge ( 2, 1 )
***********************************
Gate 1 (h)
**** Generate ZX of Gate 1 (h) ****
Add input 4
Add vertex 3
Add output 5
Add edge ( 4, 3 )
Add edge ( 3, 5 )
***********************************
********** CONCATENATION **********
Remove edge ( 4, 3 )
Add edge ( 2, 3 )
Remove edge ( 5, 3 )
Add edge ( 3, 1 )
***********************************
--------------------------------------

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(0, -) (3, -) 
ID:	3	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	2	(1, -) (2, -) 
Total #Vertices: 4

qsyn> zxgsimp -hr
Hadamard Rule: 1 Add edge ( 3, 0 )
Remove ID: 2
. 1 Add edge ( 0, 1 )
Remove ID: 3
. 2 iterations

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(0, -) 
Total #Vertices: 2

qsyn> zxge -addv 2 0 H_BOX 0
Add vertex 2

qsyn> zxge -adde 0 2 HADAMARD
Add edge ( 0, 2 )

qsyn> zxge -adde 1 2 SIMPLE
Add edge ( 1, 2 )

qsyn> zxge -rme 0 1
Remove edge ( 0, 1 )

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, [1m[34mH[0m[0m) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	2	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, [1m[34mH[0m[0m) (1, -) 
Total #Vertices: 3

qsyn> zxgsimp -hf
Hadamard Rule: 1 Add edge ( 1, 0 )
Remove ID: 2
. 1 iterations
Hadamard Cancellation Rule: 
No matches

qsyn> q -f

