DV Lab, NTUEE, Qsyn 0.4.2
qsyn> zxgr benchmark/zx/tof2_opt.zx
Create and checkout to Graph 0

qsyn> zxcopy 1
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgsimp -fr

All rules applied in order:
Hadamard Rule                 2 iterations.
  1) 2 matches
  2) 2 matches
Spider Fusion Rule            2 iterations.
  1) 5 matches
  2) 2 matches
Identity Removal Rule         1 iterations.
  1) 1 matches
Spider Fusion Rule            1 iterations.
  1) 1 matches
Phase Gadget Rule             1 iterations.
  1) 4 matches
Pivot Rule                    1 iterations.
  1) 4 matches
Identity Removal Rule         1 iterations.
  1) 3 matches

qsyn> zxgp -v

ID:   1 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (20, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (22, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (24, -) 
ID:  20 (●, 0)           (Qubit, Col): (0, 17)	  #Neighbors:   1     (1, -) 
ID:  22 (●, 0)           (Qubit, Col): (1, 17)	  #Neighbors:   1     (3, -) 
ID:  24 (●, 0)           (Qubit, Col): (2, 17)	  #Neighbors:   1     (5, -) 
Total #Vertices: 6


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> qcba 3
Note: QCir list is empty now. Create a new one.
Create and checkout to QCir 0

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1 -Strict
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

