DV Lab, NTUEE, Qsyn 0.3.0
qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxgr benchmark/zx/tof2_opt.zx
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxcopy 1
Successfully copied Graph 0 to Graph 1
Checkout to Graph 1

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgsimp -fr
Hadamard Rule: 2 . 1 . 1 . 3 iterations
Spider Fusion Rule: 
1 iterations
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
No matches
Hopf Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Phase Gadget Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
1 iterations
Local Complementary Rule: 
No matches
Identity Removal Rule: 
1 iterations
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
No matches
Hopf Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Phase Gadget Rule: 
No matches
Spider Fusion Rule: 
No matches
Identity Removal Rule: 
No matches
Spider Fusion Rule: 
No matches
Pivot Rule: 
No matches
Local Complementary Rule: 
No matches
Pivot Gadget Rule: 
No matches
Hopf Rule: 
No matches

qsyn> zxgp -v
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(22, -) 
ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(23, -) 
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(24, -) 
ID:	22	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	23	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	24	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(5, -) 
Total #Vertices: 6

qsyn> zxgtsm
---- TRAVERSE AND BUILD THE TENSOR ----
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> qcba 3

qsyn> qctsm
----------- ADD BOUNDARIES -----------
Successfully added Tensor 1
---- TRAVERSE AND BUILD THE TENSOR ----
---------------------------------------
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1 -Strict
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> q -f

