DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/pseudoSimp/tof2.qasm
Create and checkout to QCir 0

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i}}
#Dim:    2	Info: QC

qsyn> qc2zx
Created and checked out to ZXGraph 0

qsyn> zxgp -v

ID:   0 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   1 (‚óè, 0)           (Qubit, Col): (0, 11)	  #Neighbors:   1     (26, -) 
ID:   2 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (‚óè, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   1     (25, -) 
ID:   4 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (‚óè, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (0, -) (8, -) (13, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (2, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (0, 10)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (1, 10)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (1, 10)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (3, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (1, -) (24, -) (25, -) 
Total #Vertices: 27


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tsp 1
{{ 1.      -3.140185e-16i,  0.      +3.140185e-16i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +3.140185e-16i,  1.      -3.140185e-16i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   1.      -5.263328e-16i,  0.      -1.338097e-16i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      -1.338097e-16i,  1.      -5.263328e-16i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   1.      -6.193298e-16i,  0.      +8.707160e-18i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +8.707160e-18i,  1.      -6.193298e-16i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      -1.338097e-16i,  1.      -5.263328e-16i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   1.      -5.263328e-16i,  0.      -1.338097e-16i}}
#Dim:    2	Info: ZX 0

qsyn> zxgp -v

ID:   0 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   1 (‚óè, 0)           (Qubit, Col): (0, 11)	  #Neighbors:   1     (26, -) 
ID:   2 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (‚óè, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   1     (25, -) 
ID:   4 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (‚óè, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (0, -) (8, -) (13, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (2, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (0, 10)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (1, 10)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (1, 10)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (3, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (1, -) (24, -) (25, -) 
Total #Vertices: 27


qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> zxgp -v

ID:   2 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (‚óè, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   1     (25, -) 
ID:   4 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (‚óè, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (8, -) (13, -) (27, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (2, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (0, 10)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (1, 10)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (1, 10)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (3, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (24, -) (25, -) (28, -) 
ID:  27 ([1m[31mX[0m[0m, œÄ)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:  28 ([1m[31mX[0m[0m, œÄ)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (26, -) 
Total #Vertices: 27


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 2
Stored the resulting tensor as tensor id 2

qsyn> tsp 2
{{ 1.414214e+00-1.012105e-15i, -5.222227e-33-8.528544e-17i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 {-5.222227e-33-8.528544e-17i,  1.414214e+00-1.012105e-15i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.320285e-16-3.161367e-16i,  1.414214e+00-8.695236e-16i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.414214e+00-8.695236e-16i,  1.320285e-16-3.161367e-16i}}
#Dim:    2	Info: ZX 0

qsyn> qq -f

