DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/pseudoSimp/tof2.qasm
Create and checkout to QCir 0

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 11)	  #Neighbors:   1     (26, -) 
ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   1     (25, -) 
ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (0, -) (8, -) (13, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (2, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (0, 10)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (1, 10)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (1, 10)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (3, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (1, -) (24, -) (25, -) 
Total #Vertices: 27


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 11)	  #Neighbors:   1     (26, -) 
ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   1     (25, -) 
ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (0, -) (8, -) (13, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (2, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (0, 10)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (1, 10)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (1, 10)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (3, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (1, -) (24, -) (25, -) 
Total #Vertices: 27


qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> zxgp -v

ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   1     (25, -) 
ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (8, -) (13, -) (27, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (2, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (0, 10)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, Ï€)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (1, 10)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (1, 10)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (3, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (24, -) (25, -) (28, -) 
ID:  27 ([1m[31mX[0m[0m, Ï€)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:  28 ([1m[31mX[0m[0m, Ï€)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (26, -) 
Total #Vertices: 27


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 2
Stored the resulting tensor as tensor id 2

qsyn> qcnew
Create and checkout to QCir 1

qsyn> qcba 2

qsyn> qcga -cx 0 1

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 3
Stored the resulting tensor as tensor id 3

qsyn> tseq 2 3
[1m[32mEquivalent[0m[0m
- Global Norm : 0.707107
- Global Phase: 0

qsyn> qq -f

