DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/pseudoSimp/tof2.qasm
Create and checkout to QCir 0

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i}}
#Dim:    2	Info: QC

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgp -v

ID:   0 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   1 (‚óè, 0)           (Qubit, Col): (0, 11)	  #Neighbors:   1     (26, -) 
ID:   2 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (‚óè, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   1     (25, -) 
ID:   4 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (‚óè, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (0, -) (8, -) (13, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (2, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (0, 10)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (1, 10)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (1, 10)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (3, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (1, -) (24, -) (25, -) 
Total #Vertices: 27


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tsp 1
{{ 1.000000e+00-3.140185e-16i, -1.665335e-16+3.140185e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 {-1.665335e-16+3.140185e-16i,  1.000000e+00-3.140185e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.000000e+00-6.280370e-16i, -5.551115e-17+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
  -5.551115e-17+0.000000e+00i,  1.000000e+00-6.280370e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.000000e+00-6.672893e-16i, -5.551115e-17-3.925231e-17i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
  -5.551115e-17-3.925231e-17i,  1.000000e+00-6.672893e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.665335e-16-2.355139e-16i,  1.000000e+00-5.495324e-16i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.000000e+00-5.495324e-16i,  1.665335e-16-2.355139e-16i}}
#Dim:    2	Info: ZX 0

qsyn> zxgp -v

ID:   0 (‚óè, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:   1 (‚óè, 0)           (Qubit, Col): (0, 11)	  #Neighbors:   1     (26, -) 
ID:   2 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (‚óè, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   1     (25, -) 
ID:   4 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (‚óè, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (0, -) (8, -) (13, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (2, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (0, 10)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (1, 10)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (1, 10)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (3, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (1, -) (24, -) (25, -) 
Total #Vertices: 27


qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> zxgp -v

ID:   2 (‚óè, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (10, -) 
ID:   3 (‚óè, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   1     (25, -) 
ID:   4 (‚óè, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, -) 
ID:   5 (‚óè, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   1     (22, -) 
ID:   6 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (4, -) (8, -) 
ID:   7 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (8, -) (13, -) (27, -) 
ID:   8 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (6, -) (7, -) (9, -) 
ID:   9 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (8, -) (11, -) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (2, -) (11, -) (16, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (9, -) (10, -) (12, -) 
ID:  12 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (11, -) (14, -) 
ID:  13 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (7, -) (14, -) (18, -) 
ID:  14 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (12, -) (13, -) (15, -) 
ID:  15 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (2, 10)	  #Neighbors:   2     (14, -) (17, -) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (10, -) (17, -) (20, -) 
ID:  17 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 10)	  #Neighbors:   3     (15, -) (16, -) (19, -) 
ID:  18 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (0, 10)	  #Neighbors:   2     (13, -) (21, -) 
ID:  19 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (2, 10)	  #Neighbors:   2     (17, -) (22, -) 
ID:  20 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (16, -) (21, -) (23, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  22 ([1m[33mH[0m[0m, œÄ)           (Qubit, Col): (2, 10)	  #Neighbors:   2     (5, -) (19, -) 
ID:  23 ([1m[32mZ[0m[0m, œÄ/4)         (Qubit, Col): (1, 10)	  #Neighbors:   2     (20, -) (25, -) 
ID:  24 ([1m[32mZ[0m[0m, 7œÄ/4)        (Qubit, Col): (1, 10)	  #Neighbors:   2     (21, -) (26, -) 
ID:  25 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 10)	  #Neighbors:   3     (3, -) (23, -) (26, -) 
ID:  26 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (0, 10)	  #Neighbors:   3     (24, -) (25, -) (28, -) 
ID:  27 ([1m[31mX[0m[0m, œÄ)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (7, -) 
ID:  28 ([1m[31mX[0m[0m, œÄ)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (26, -) 
Total #Vertices: 27


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 2
Stored the resulting tensor as tensor id 2

qsyn> tsp 2
{{ 1.414214e+00-9.420555e-16i,  1.110223e-16+7.850462e-17i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 1.110223e-16+7.850462e-17i,  1.414214e+00-9.420555e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.110223e-16-1.177569e-16i,  1.414214e+00-7.457939e-16i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.414214e+00-7.457939e-16i,  1.110223e-16-1.177569e-16i}}
#Dim:    2	Info: ZX 0

qsyn> qq -f

