DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/pseudoSimp/tof2.qasm
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,
   0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  1.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,
   0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  1.      +0.i,  0.      +0.i,  0.      +0.i,
   0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  1.      +0.i,  0.      +0.i,
   0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,  1.      +0.i,
   0.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,
   1.      +0.i,  0.      +0.i,  0.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,
   0.      +0.i,  0.      +0.i,  1.      +0.i},
 { 0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,  0.      +0.i,
   0.      +0.i,  1.      +0.i,  0.      +0.i}}
#Dim:    2	Info: QC

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgp -v

ID:	0	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(25, -) 
ID:	2	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(26, -) 
ID:	4	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(6, -) 
ID:	5	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(22, -) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	2	(4, -) (8, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(2, -) (8, -) (13, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(6, -) (7, -) (9, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7œÄ/4	#Neighbors:	2	(8, -) (11, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (11, -) (16, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(9, -) (10, -) (12, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	œÄ/4	#Neighbors:	2	(11, -) (14, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(7, -) (14, -) (18, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(12, -) (13, -) (15, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7œÄ/4	#Neighbors:	2	(14, -) (17, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(10, -) (17, -) (20, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(15, -) (16, -) (19, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	œÄ/4	#Neighbors:	2	(13, -) (21, -) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	œÄ/4	#Neighbors:	2	(17, -) (22, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(16, -) (21, -) (23, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(18, -) (20, -) (24, -) 
ID:	22	VertexType:	[1m[33mH[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	2	(5, -) (19, -) 
ID:	23	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	œÄ/4	#Neighbors:	2	(20, -) (25, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7œÄ/4	#Neighbors:	2	(21, -) (26, -) 
ID:	25	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (23, -) (26, -) 
ID:	26	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (24, -) (25, -) 
Total #Vertices: 27


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tsp 1
{{1.000000e+00 -3.925231e-16i, 1.110223e-16 +3.925231e-16i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {1.110223e-16 +3.925231e-16i, 1.000000e+00 -3.925231e-16i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  1.000000e+00 -7.457939e-16i, 0.000000e+00 -1.177569e-16i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 -1.177569e-16i, 1.000000e+00 -7.457939e-16i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  1.000000e+00 -7.850462e-16i, 1.110223e-16 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  1.110223e-16 +0.000000e+00i, 1.000000e+00 -7.850462e-16i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  1.665335e-16 -2.747662e-16i, 1.000000e+00 -5.102800e-16i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  1.000000e+00 -5.102800e-16i, 1.665335e-16 -2.747662e-16i}}
#Dim:    2	Info: ZX 0

qsyn> zxgp -v

ID:	0	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(10, -) 
ID:	1	VertexType:	‚óè	Qubit:	0	Phase:	0	#Neighbors:	1	(25, -) 
ID:	2	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(26, -) 
ID:	4	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(6, -) 
ID:	5	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(22, -) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	2	(4, -) (8, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(2, -) (8, -) (13, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(6, -) (7, -) (9, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7œÄ/4	#Neighbors:	2	(8, -) (11, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (11, -) (16, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(9, -) (10, -) (12, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	œÄ/4	#Neighbors:	2	(11, -) (14, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(7, -) (14, -) (18, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(12, -) (13, -) (15, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7œÄ/4	#Neighbors:	2	(14, -) (17, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(10, -) (17, -) (20, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(15, -) (16, -) (19, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	œÄ/4	#Neighbors:	2	(13, -) (21, -) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	œÄ/4	#Neighbors:	2	(17, -) (22, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(16, -) (21, -) (23, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(18, -) (20, -) (24, -) 
ID:	22	VertexType:	[1m[33mH[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	2	(5, -) (19, -) 
ID:	23	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	œÄ/4	#Neighbors:	2	(20, -) (25, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7œÄ/4	#Neighbors:	2	(21, -) (26, -) 
ID:	25	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (23, -) (26, -) 
ID:	26	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (24, -) (25, -) 
Total #Vertices: 27


qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> zxgp -v

ID:	2	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	3	VertexType:	‚óè	Qubit:	1	Phase:	0	#Neighbors:	1	(26, -) 
ID:	4	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(6, -) 
ID:	5	VertexType:	‚óè	Qubit:	2	Phase:	0	#Neighbors:	1	(22, -) 
ID:	6	VertexType:	[1m[33mH[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	2	(4, -) (8, -) 
ID:	7	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(2, -) (8, -) (13, -) 
ID:	8	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(6, -) (7, -) (9, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7œÄ/4	#Neighbors:	2	(8, -) (11, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(11, -) (16, -) (27, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(9, -) (10, -) (12, -) 
ID:	12	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	œÄ/4	#Neighbors:	2	(11, -) (14, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(7, -) (14, -) (18, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(12, -) (13, -) (15, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	7œÄ/4	#Neighbors:	2	(14, -) (17, -) 
ID:	16	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(10, -) (17, -) (20, -) 
ID:	17	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(15, -) (16, -) (19, -) 
ID:	18	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	œÄ/4	#Neighbors:	2	(13, -) (21, -) 
ID:	19	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	œÄ/4	#Neighbors:	2	(17, -) (22, -) 
ID:	20	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(16, -) (21, -) (23, -) 
ID:	21	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(18, -) (20, -) (24, -) 
ID:	22	VertexType:	[1m[33mH[0m[0m	Qubit:	2	Phase:	œÄ	#Neighbors:	2	(5, -) (19, -) 
ID:	23	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	œÄ/4	#Neighbors:	2	(20, -) (25, -) 
ID:	24	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	7œÄ/4	#Neighbors:	2	(21, -) (26, -) 
ID:	25	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(23, -) (26, -) (28, -) 
ID:	26	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(3, -) (24, -) (25, -) 
ID:	27	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	œÄ	#Neighbors:	1	(10, -) 
ID:	28	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	œÄ	#Neighbors:	1	(25, -) 
Total #Vertices: 27


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 2
Stored the resulting tensor as tensor id 2

qsyn> tsp 2
{{1.414214e+00 -1.059812e-15i, -3.330669e-16-3.925231e-17i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {-3.330669e-16-3.925231e-17i, 1.414214e+00 -1.059812e-15i,
  0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  1.110223e-16 -2.820020e-16i, 1.414214e+00 -8.315344e-16i},
 {0.000000e+00 +0.000000e+00i, 0.000000e+00 +0.000000e+00i,
  1.414214e+00 -8.315344e-16i, 1.110223e-16 -2.820020e-16i}}
#Dim:    2	Info: ZX 0

qsyn> q -f

