DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qccr benchmark/pseudoSimp/tof2.qasm
Create and checkout to QCir 0

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i,  0.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i},
 { 0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  0.+0.i,  1.+0.i,  0.+0.i}}
#Dim:    2	Info: QC

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (22, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 22)	  #Neighbors:   1     (26, -) 
ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (16, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 22)	  #Neighbors:   1     (21, -) 
ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, [1m[34mH[0m[0m) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 22)	  #Neighbors:   1     (15, -) 
ID:   6 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   2     (4, [1m[34mH[0m[0m) (7, -) 
ID:   7 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 12)	  #Neighbors:   3     (6, -) (8, -) (16, -) 
ID:   8 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (2, 13)	  #Neighbors:   2     (7, -) (9, -) 
ID:   9 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 14)	  #Neighbors:   3     (8, -) (10, -) (22, -) 
ID:  10 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 15)	  #Neighbors:   2     (9, -) (11, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 16)	  #Neighbors:   3     (10, -) (12, -) (17, -) 
ID:  12 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (2, 17)	  #Neighbors:   2     (11, -) (13, -) 
ID:  13 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 18)	  #Neighbors:   3     (12, -) (14, -) (23, -) 
ID:  14 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 19)	  #Neighbors:   2     (13, -) (15, [1m[34mH[0m[0m) 
ID:  15 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 20)	  #Neighbors:   2     (5, -) (14, [1m[34mH[0m[0m) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 12)	  #Neighbors:   3     (2, -) (7, -) (17, -) 
ID:  17 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 16)	  #Neighbors:   3     (11, -) (16, -) (18, -) 
ID:  18 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (1, 17)	  #Neighbors:   2     (17, -) (19, -) 
ID:  19 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 19)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  20 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (1, 20)	  #Neighbors:   2     (19, -) (21, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 21)	  #Neighbors:   3     (3, -) (20, -) (26, -) 
ID:  22 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 14)	  #Neighbors:   3     (0, -) (9, -) (23, -) 
ID:  23 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 18)	  #Neighbors:   3     (13, -) (22, -) (24, -) 
ID:  24 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 19)	  #Neighbors:   3     (19, -) (23, -) (25, -) 
ID:  25 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (0, 20)	  #Neighbors:   2     (24, -) (26, -) 
ID:  26 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 21)	  #Neighbors:   3     (1, -) (21, -) (25, -) 
Total #Vertices: 27


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tsp 1
{{ 1.000000e+00-3.925231e-16i,  8.701706e-17+3.925231e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 8.701706e-17+3.925231e-16i,  1.000000e+00-3.925231e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.000000e+00-7.457939e-16i,  8.512441e-18-1.177569e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   8.512441e-18-1.177569e-16i,  1.000000e+00-7.457939e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.000000e+00-7.850462e-16i,  8.701706e-17+1.232595e-32i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   8.701706e-17+1.232595e-32i,  1.000000e+00-7.850462e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.655217e-16-2.747662e-16i,  1.000000e+00-5.102800e-16i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.000000e+00-5.102800e-16i,  1.655217e-16-2.747662e-16i}}
#Dim:    2	Info: ZX 0

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (22, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 22)	  #Neighbors:   1     (26, -) 
ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (16, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 22)	  #Neighbors:   1     (21, -) 
ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, [1m[34mH[0m[0m) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 22)	  #Neighbors:   1     (15, -) 
ID:   6 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   2     (4, [1m[34mH[0m[0m) (7, -) 
ID:   7 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 12)	  #Neighbors:   3     (6, -) (8, -) (16, -) 
ID:   8 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (2, 13)	  #Neighbors:   2     (7, -) (9, -) 
ID:   9 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 14)	  #Neighbors:   3     (8, -) (10, -) (22, -) 
ID:  10 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 15)	  #Neighbors:   2     (9, -) (11, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 16)	  #Neighbors:   3     (10, -) (12, -) (17, -) 
ID:  12 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (2, 17)	  #Neighbors:   2     (11, -) (13, -) 
ID:  13 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 18)	  #Neighbors:   3     (12, -) (14, -) (23, -) 
ID:  14 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 19)	  #Neighbors:   2     (13, -) (15, [1m[34mH[0m[0m) 
ID:  15 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 20)	  #Neighbors:   2     (5, -) (14, [1m[34mH[0m[0m) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 12)	  #Neighbors:   3     (2, -) (7, -) (17, -) 
ID:  17 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 16)	  #Neighbors:   3     (11, -) (16, -) (18, -) 
ID:  18 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (1, 17)	  #Neighbors:   2     (17, -) (19, -) 
ID:  19 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 19)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  20 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (1, 20)	  #Neighbors:   2     (19, -) (21, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 21)	  #Neighbors:   3     (3, -) (20, -) (26, -) 
ID:  22 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 14)	  #Neighbors:   3     (0, -) (9, -) (23, -) 
ID:  23 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 18)	  #Neighbors:   3     (13, -) (22, -) (24, -) 
ID:  24 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 19)	  #Neighbors:   3     (19, -) (23, -) (25, -) 
ID:  25 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (0, 20)	  #Neighbors:   2     (24, -) (26, -) 
ID:  26 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 21)	  #Neighbors:   3     (1, -) (21, -) (25, -) 
Total #Vertices: 27


qsyn> zxgas 0 I X pi

qsyn> zxgas 0 O X pi

qsyn> zxgp -v

ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (16, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 22)	  #Neighbors:   1     (21, -) 
ID:   4 (â—, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (6, [1m[34mH[0m[0m) 
ID:   5 (â—, 0)           (Qubit, Col): (2, 22)	  #Neighbors:   1     (15, -) 
ID:   6 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 11)	  #Neighbors:   2     (4, [1m[34mH[0m[0m) (7, -) 
ID:   7 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 12)	  #Neighbors:   3     (6, -) (8, -) (16, -) 
ID:   8 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (2, 13)	  #Neighbors:   2     (7, -) (9, -) 
ID:   9 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 14)	  #Neighbors:   3     (8, -) (10, -) (22, -) 
ID:  10 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 15)	  #Neighbors:   2     (9, -) (11, -) 
ID:  11 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 16)	  #Neighbors:   3     (10, -) (12, -) (17, -) 
ID:  12 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (2, 17)	  #Neighbors:   2     (11, -) (13, -) 
ID:  13 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (2, 18)	  #Neighbors:   3     (12, -) (14, -) (23, -) 
ID:  14 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (2, 19)	  #Neighbors:   2     (13, -) (15, [1m[34mH[0m[0m) 
ID:  15 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (2, 20)	  #Neighbors:   2     (5, -) (14, [1m[34mH[0m[0m) 
ID:  16 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 12)	  #Neighbors:   3     (2, -) (7, -) (17, -) 
ID:  17 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (1, 16)	  #Neighbors:   3     (11, -) (16, -) (18, -) 
ID:  18 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (1, 17)	  #Neighbors:   2     (17, -) (19, -) 
ID:  19 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 19)	  #Neighbors:   3     (18, -) (20, -) (24, -) 
ID:  20 ([1m[32mZ[0m[0m, 7Ï€/4)        (Qubit, Col): (1, 20)	  #Neighbors:   2     (19, -) (21, -) 
ID:  21 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 21)	  #Neighbors:   3     (3, -) (20, -) (26, -) 
ID:  22 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 14)	  #Neighbors:   3     (9, -) (23, -) (27, -) 
ID:  23 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 18)	  #Neighbors:   3     (13, -) (22, -) (24, -) 
ID:  24 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 19)	  #Neighbors:   3     (19, -) (23, -) (25, -) 
ID:  25 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (0, 20)	  #Neighbors:   2     (24, -) (26, -) 
ID:  26 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 21)	  #Neighbors:   3     (21, -) (25, -) (28, -) 
ID:  27 ([1m[31mX[0m[0m, Ï€)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (22, -) 
ID:  28 ([1m[31mX[0m[0m, Ï€)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (26, -) 
Total #Vertices: 27


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 2
Stored the resulting tensor as tensor id 2

qsyn> tsp 2
{{ 1.414214e+00-1.059812e-15i, -2.847690e-16-3.925231e-17i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 {-2.847690e-16-3.925231e-17i,  1.414214e+00-1.059812e-15i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.077541e-16-2.820020e-16i,  1.414214e+00-8.315344e-16i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.414214e+00-8.315344e-16i,  1.077541e-16-2.820020e-16i}}
#Dim:    2	Info: ZX 0

qsyn> qq -f

