qsyn> zxm -on
ZXMODE turn ON!

qsyn> qcba 2

qsyn> qcga -x 0

qsyn> qczxm
Successfully generated Graph 0
Checkout to Graph 0
---- TRAVERSE AND BUILD THE GRAPH ----
--------------------------------------
--------------------------------------

qsyn> qcga -cx -pr 0 1
Note: Graph 0 is deleted due to modification(s) !!
Successfully removed Graph 0
Note: The graph list is empty now

qsyn> qczxm
Successfully generated Graph 1
Checkout to Graph 1
---- TRAVERSE AND BUILD THE GRAPH ----
--------------------------------------
--------------------------------------
--------------------------------------

qsyn> qccr -r benchmark/benchmark_SABRE/small/3_17_13.qasm
Note: original quantum circuit is replaced...

qsyn> qczxm
Successfully generated Graph 2
Checkout to Graph 2
---- TRAVERSE AND BUILD THE GRAPH ----
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------
--------------------------------------

qsyn> qccp -q
Q 0  ---------cx( 1)-- h( 3)-- t( 6)----------cx( 8)--cx( 9)-- t(14)----------cx(15)--cx(16)-- h(18)-- t(20)--cx(23)----------cx(25)--cx(27)--td(28)----------cx(32)--cx(33)-
Q 1  -----------------cx( 2)-- t( 4)--cx( 7)----------cx( 9)--cx(11)--td(12)----------cx(16)--cx(17)-- t(21)--cx(23)--cx(24)--td(26)--cx(27)--td(29)--cx(31)----------cx(33)--cx(35)-
Q 2  - x( 0)--cx( 1)--cx( 2)-- t( 5)--cx( 7)--cx( 8)--td(10)--cx(11)--td(13)--cx(15)----------cx(17)-- h(19)-- t(22)--cx(24)--cx(25)-- t(30)----------cx(31)--cx(32)-- h(34)--cx(35)-

qsyn> q -f

