DV Lab, NTUEE, Qsyn 0.5.1
qsyn> ver 1
Note: verbose level is set to 1

qsyn> color off
Note: color mode is set to off

qsyn> qccread ./benchmark/benchmark_SABRE/small/rd32-v1_68.qasm
Error: file must have one of the following extension: ".qasm" ".qc" ".qsim" ".quipper" ""!!

qsyn> qc2zx
Error: QCir list is empty now. Please QCNEW/QCCRead/QCBAdd before QC2ZX.

qsyn> zxgp -Q
Error: ZXGraph list is empty now. Please ZXNew before ZXGPrint.

qsyn> zxgs -FR
Error: ZXGraph list is empty now. Please ZXNew before ZXGSimp.

qsyn> zxgp -Q
Error: ZXGraph list is empty now. Please ZXNew before ZXGPrint.

qsyn> qq -f

