DV Lab, NTUEE, Qsyn 0.4.2
qsyn> ver 1
Note: verbose level is set to 1

qsyn> color off
Note: color mode is set to off

qsyn> qccread ./benchmark/benchmark_SABRE/small/rd32-v1_68.qasm

qsyn> qc2zx

qsyn> zxgp -Q

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 39)	  #Neighbors:   1     (35, -) 
ID:   8 (Z, π/4)         (Qubit, Col): (0, 2)	  #Neighbors:   2     (0, -) (10, -) 
ID:  10 (Z, 0)           (Qubit, Col): (0, 5)	  #Neighbors:   3     (8, -) (11, -) (17, -) 
ID:  17 (X, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   3     (10, -) (16, -) (21, -) 
ID:  21 (Z, -π/4)        (Qubit, Col): (0, 7)	  #Neighbors:   2     (17, -) (23, -) 
ID:  23 (X, 0)           (Qubit, Col): (0, 11)	  #Neighbors:   3     (21, -) (22, -) (25, -) 
ID:  25 (Z, -π/4)        (Qubit, Col): (0, 11)	  #Neighbors:   2     (23, -) (27, -) 
ID:  27 (X, 0)           (Qubit, Col): (0, 14)	  #Neighbors:   3     (25, -) (26, -) (33, -) 
ID:  33 (Z, 0)           (Qubit, Col): (0, 18)	  #Neighbors:   3     (27, -) (34, -) (35, -) 
ID:  35 (Z, 0)           (Qubit, Col): (0, 20)	  #Neighbors:   3     (1, -) (33, -) (36, -) 


ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (9, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 39)	  #Neighbors:   1     (58, -) 
ID:   9 (Z, π/4)         (Qubit, Col): (1, 2)	  #Neighbors:   2     (2, -) (11, -) 
ID:  11 (X, 0)           (Qubit, Col): (1, 5)	  #Neighbors:   3     (9, -) (10, -) (18, -) 
ID:  18 (Z, 0)           (Qubit, Col): (1, 9)	  #Neighbors:   3     (11, -) (19, -) (22, -) 
ID:  22 (Z, 0)           (Qubit, Col): (1, 11)	  #Neighbors:   3     (18, -) (23, -) (24, -) 
ID:  24 (Z, -π/4)        (Qubit, Col): (1, 11)	  #Neighbors:   2     (22, -) (28, -) 
ID:  28 (Z, 0)           (Qubit, Col): (1, 16)	  #Neighbors:   3     (24, -) (29, -) (34, -) 
ID:  34 (X, 0)           (Qubit, Col): (1, 18)	  #Neighbors:   3     (28, -) (33, -) (36, -) 
ID:  36 (X, 0)           (Qubit, Col): (1, 20)	  #Neighbors:   3     (34, -) (35, -) (37, -) 
ID:  37 (Z, π/4)         (Qubit, Col): (1, 20)	  #Neighbors:   2     (36, -) (38, -) 
ID:  38 (Z, 0)           (Qubit, Col): (1, 23)	  #Neighbors:   3     (37, -) (39, -) (41, -) 
ID:  41 (X, 0)           (Qubit, Col): (1, 25)	  #Neighbors:   3     (38, -) (40, -) (42, -) 
ID:  42 (Z, -π/4)        (Qubit, Col): (1, 25)	  #Neighbors:   2     (41, -) (46, -) 
ID:  46 (X, 0)           (Qubit, Col): (1, 29)	  #Neighbors:   3     (42, -) (45, -) (48, -) 
ID:  48 (Z, -π/4)        (Qubit, Col): (1, 29)	  #Neighbors:   2     (46, -) (51, -) 
ID:  51 (X, 0)           (Qubit, Col): (1, 32)	  #Neighbors:   3     (48, -) (50, -) (56, -) 
ID:  56 (Z, 0)           (Qubit, Col): (1, 36)	  #Neighbors:   3     (51, -) (57, -) (58, -) 
ID:  58 (Z, 0)           (Qubit, Col): (1, 38)	  #Neighbors:   3     (3, -) (56, -) (59, -) 


ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (12, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 39)	  #Neighbors:   1     (59, -) 
ID:  12 (Z, π/4)         (Qubit, Col): (2, 2)	  #Neighbors:   2     (4, -) (39, -) 
ID:  39 (X, 0)           (Qubit, Col): (2, 23)	  #Neighbors:   3     (12, -) (38, -) (43, -) 
ID:  43 (Z, 0)           (Qubit, Col): (2, 27)	  #Neighbors:   3     (39, -) (44, -) (45, -) 
ID:  45 (Z, 0)           (Qubit, Col): (2, 29)	  #Neighbors:   3     (43, -) (46, -) (47, -) 
ID:  47 (Z, -π/4)        (Qubit, Col): (2, 29)	  #Neighbors:   2     (45, -) (52, -) 
ID:  52 (Z, 0)           (Qubit, Col): (2, 34)	  #Neighbors:   3     (47, -) (53, -) (57, -) 
ID:  57 (X, 0)           (Qubit, Col): (2, 36)	  #Neighbors:   3     (52, -) (56, -) (59, -) 
ID:  59 (X, 0)           (Qubit, Col): (2, 38)	  #Neighbors:   3     (5, -) (57, -) (58, -) 


ID:   6 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (13, -) 
ID:   7 (●, 0)           (Qubit, Col): (3, 39)	  #Neighbors:   1     (55, -) 
ID:  13 (X, π)           (Qubit, Col): (3, 2)	  #Neighbors:   2     (6, -) (14, -) 
ID:  14 (H, π)           (Qubit, Col): (3, 3)	  #Neighbors:   2     (13, -) (15, -) 
ID:  15 (Z, π/4)         (Qubit, Col): (3, 4)	  #Neighbors:   2     (14, -) (16, -) 
ID:  16 (Z, 0)           (Qubit, Col): (3, 7)	  #Neighbors:   3     (15, -) (17, -) (19, -) 
ID:  19 (X, 0)           (Qubit, Col): (3, 9)	  #Neighbors:   3     (16, -) (18, -) (20, -) 
ID:  20 (Z, π/4)         (Qubit, Col): (3, 9)	  #Neighbors:   2     (19, -) (26, -) 
ID:  26 (Z, 0)           (Qubit, Col): (3, 14)	  #Neighbors:   3     (20, -) (27, -) (29, -) 
ID:  29 (X, 0)           (Qubit, Col): (3, 16)	  #Neighbors:   3     (26, -) (28, -) (30, -) 
ID:  30 (H, π)           (Qubit, Col): (3, 16)	  #Neighbors:   2     (29, -) (31, -) 
ID:  31 (H, π)           (Qubit, Col): (3, 17)	  #Neighbors:   2     (30, -) (32, -) 
ID:  32 (Z, π/4)         (Qubit, Col): (3, 18)	  #Neighbors:   2     (31, -) (40, -) 
ID:  40 (Z, 0)           (Qubit, Col): (3, 25)	  #Neighbors:   3     (32, -) (41, -) (44, -) 
ID:  44 (X, 0)           (Qubit, Col): (3, 27)	  #Neighbors:   3     (40, -) (43, -) (49, -) 
ID:  49 (Z, π/4)         (Qubit, Col): (3, 27)	  #Neighbors:   2     (44, -) (50, -) 
ID:  50 (Z, 0)           (Qubit, Col): (3, 32)	  #Neighbors:   3     (49, -) (51, -) (53, -) 
ID:  53 (X, 0)           (Qubit, Col): (3, 34)	  #Neighbors:   3     (50, -) (52, -) (54, -) 
ID:  54 (H, π)           (Qubit, Col): (3, 34)	  #Neighbors:   2     (53, -) (55, -) 
ID:  55 (X, π)           (Qubit, Col): (3, 35)	  #Neighbors:   2     (7, -) (54, -) 


qsyn> zxgs -FR

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Identity Removal Rule
(4) Pivot Rule
(5) Pivot Gadget Rule
(6) Pivot Boundary Rule
(7) Phase Gadget Rule

qsyn> zxgp -Q

ID:  61 (Z, -π/4)        (Qubit, Col): (-2, 7)	  #Neighbors:   1     (62, H) 
ID:  67 (Z, -π/4)        (Qubit, Col): (-2, 29)	  #Neighbors:   1     (68, H) 
ID:  69 (Z, -π/4)        (Qubit, Col): (-2, 11)	  #Neighbors:   1     (70, H) 
ID:  73 (Z, -3π/4)       (Qubit, Col): (-2, 27)	  #Neighbors:   1     (74, H) 
ID:  76 (Z, π/4)         (Qubit, Col): (-2, 2)	  #Neighbors:   1     (77, H) 


ID:  62 (Z, 0)           (Qubit, Col): (-1, 7)	  #Neighbors:   3     (8, H) (13, H) (61, H) 
ID:  68 (Z, 0)           (Qubit, Col): (-1, 29)	  #Neighbors:   3     (12, H) (13, H) (67, H) 
ID:  70 (Z, 0)           (Qubit, Col): (-1, 11)	  #Neighbors:   5     (8, H) (12, H) (13, H) (43, H) (69, H) 
ID:  74 (Z, 0)           (Qubit, Col): (-1, 27)	  #Neighbors:   3     (13, H) (43, H) (73, H) 
ID:  77 (Z, 0)           (Qubit, Col): (-1, 2)	  #Neighbors:   4     (8, H) (12, H) (43, H) (76, H) 


ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (8, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 39)	  #Neighbors:   1     (8, -) 
ID:   8 (Z, π/4)         (Qubit, Col): (0, 2)	  #Neighbors:   6     (0, -) (1, -) (62, H) (70, H) (75, H) (77, H) 


ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (75, H) 
ID:   3 (●, 0)           (Qubit, Col): (1, 39)	  #Neighbors:   1     (51, H) 
ID:  51 (Z, 0)           (Qubit, Col): (1, 32)	  #Neighbors:   3     (3, H) (12, H) (43, H) 
ID:  75 (Z, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   4     (2, H) (8, H) (12, H) (43, H) 


ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (12, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 39)	  #Neighbors:   1     (43, -) 
ID:  12 (Z, π/4)         (Qubit, Col): (2, 2)	  #Neighbors:   6     (4, -) (51, H) (68, H) (70, H) (75, H) (77, H) 
ID:  43 (Z, 3π/4)        (Qubit, Col): (2, 27)	  #Neighbors:   6     (5, -) (51, H) (70, H) (74, H) (75, H) (77, H) 


ID:   6 (●, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   1     (13, H) 
ID:   7 (●, 0)           (Qubit, Col): (3, 39)	  #Neighbors:   1     (13, H) 
ID:  13 (Z, -π/2)        (Qubit, Col): (3, 2)	  #Neighbors:   6     (6, H) (7, H) (62, H) (68, H) (70, H) (74, H) 


qsyn> qq -f

