qsyn> zxm -on
ZXMODE turn ON!

qsyn> ver 1
Note: verbose level is set to 1

qsyn> zxgr benchmark/zx/hopf_adv.zx

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(9, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	9	(0, -) (5, [1m[34mH[0m[0m) (5, -) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (7, -) (7, -) (8, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	8	(4, [1m[34mH[0m[0m) (4, -) (4, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) (6, -) (6, [1m[34mH[0m[0m) (8, -) (8, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	7	(2, -) (5, [1m[34mH[0m[0m) (5, -) (5, [1m[34mH[0m[0m) (8, -) (8, -) (9, -) 
ID:	7	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	7	(1, -) (4, [1m[34mH[0m[0m) (4, -) (4, -) (8, -) (10, -) (10, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	10	(4, [1m[34mH[0m[0m) (4, [1m[34mH[0m[0m) (5, -) (5, -) (6, -) (6, -) (7, -) (9, -) (11, -) (11, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(3, -) (6, -) (8, -) (12, -) (12, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	6	(7, -) (7, -) (11, -) (11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (11, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	9	(8, -) (8, -) (10, -) (10, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (10, -) (12, -) (12, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:	12	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(9, -) (9, -) (11, -) (11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
Total #Vertices: 13

qsyn> zxgp -e
( 11, 12 )	Type:	[1m[34mH[0m[0m
( 11, 12 )	Type:	[1m[34mH[0m[0m
( 11, 12 )	Type:	-
( 10, 11 )	Type:	-
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 10, 11 )	Type:	-
( 9, 12 )	Type:	-
( 9, 12 )	Type:	-
( 8, 9 )	Type:	-
( 8, 11 )	Type:	-
( 8, 11 )	Type:	-
( 7, 8 )	Type:	-
( 7, 10 )	Type:	-
( 7, 10 )	Type:	-
( 6, 8 )	Type:	-
( 6, 8 )	Type:	-
( 6, 9 )	Type:	-
( 5, 6 )	Type:	[1m[34mH[0m[0m
( 5, 6 )	Type:	-
( 5, 6 )	Type:	[1m[34mH[0m[0m
( 5, 8 )	Type:	-
( 5, 8 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 5 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 7 )	Type:	-
( 4, 7 )	Type:	-
( 4, 7 )	Type:	[1m[34mH[0m[0m
( 4, 8 )	Type:	[1m[34mH[0m[0m
( 4, 8 )	Type:	[1m[34mH[0m[0m
( 3, 9 )	Type:	-
( 2, 6 )	Type:	-
( 1, 7 )	Type:	-
( 0, 4 )	Type:	-
Total #Edges: 35

qsyn> zxgs -hopf

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(9, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(0, -) (5, [1m[34mH[0m[0m) (5, -) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(4, [1m[34mH[0m[0m) (4, -) (4, [1m[34mH[0m[0m) (6, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(2, -) (5, -) (9, -) 
ID:	7	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (4, [1m[34mH[0m[0m) (8, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(7, -) (9, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(3, -) (6, -) (8, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(10, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (12, -) 
ID:	12	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	1	(11, -) 
Total #Vertices: 13

qsyn> zxgp -e
( 11, 12 )	Type:	-
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 8, 9 )	Type:	-
( 7, 8 )	Type:	-
( 6, 9 )	Type:	-
( 5, 6 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 5 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 7 )	Type:	[1m[34mH[0m[0m
( 3, 9 )	Type:	-
( 2, 6 )	Type:	-
( 1, 7 )	Type:	-
( 0, 4 )	Type:	-
Total #Edges: 15

qsyn> zxgs -spi

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(8, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(0, -) (5, [1m[34mH[0m[0m) (5, -) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(2, -) (4, [1m[34mH[0m[0m) (4, -) (4, [1m[34mH[0m[0m) (8, -) 
ID:	7	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (4, [1m[34mH[0m[0m) (8, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(3, -) (5, -) (7, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(10, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
Total #Vertices: 10

qsyn> zxgp -e
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 5 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 7 )	Type:	[1m[34mH[0m[0m
( 1, 7 )	Type:	-
( 0, 4 )	Type:	-
( 8, 3 )	Type:	-
( 5, 8 )	Type:	-
( 5, 2 )	Type:	-
Total #Edges: 12

qsyn> // The result should be same after swapping orders of two rules

qsyn> zxgr -R benchmark/zx/hopf_adv.zx
Note: original zxGraph is replaced...

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(9, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	9	(0, -) (5, [1m[34mH[0m[0m) (5, -) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (7, -) (7, -) (8, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	8	(4, [1m[34mH[0m[0m) (4, -) (4, [1m[34mH[0m[0m) (6, [1m[34mH[0m[0m) (6, -) (6, [1m[34mH[0m[0m) (8, -) (8, -) 
ID:	6	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	7	(2, -) (5, [1m[34mH[0m[0m) (5, -) (5, [1m[34mH[0m[0m) (8, -) (8, -) (9, -) 
ID:	7	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	7	(1, -) (4, [1m[34mH[0m[0m) (4, -) (4, -) (8, -) (10, -) (10, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	10	(4, [1m[34mH[0m[0m) (4, [1m[34mH[0m[0m) (5, -) (5, -) (6, -) (6, -) (7, -) (9, -) (11, -) (11, -) 
ID:	9	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(3, -) (6, -) (8, -) (12, -) (12, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	6	(7, -) (7, -) (11, -) (11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (11, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	9	(8, -) (8, -) (10, -) (10, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (10, -) (12, -) (12, [1m[34mH[0m[0m) (12, [1m[34mH[0m[0m) 
ID:	12	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(9, -) (9, -) (11, -) (11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
Total #Vertices: 13

qsyn> zxgp -e
( 11, 12 )	Type:	[1m[34mH[0m[0m
( 11, 12 )	Type:	[1m[34mH[0m[0m
( 11, 12 )	Type:	-
( 10, 11 )	Type:	-
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 10, 11 )	Type:	-
( 9, 12 )	Type:	-
( 9, 12 )	Type:	-
( 8, 9 )	Type:	-
( 8, 11 )	Type:	-
( 8, 11 )	Type:	-
( 7, 8 )	Type:	-
( 7, 10 )	Type:	-
( 7, 10 )	Type:	-
( 6, 8 )	Type:	-
( 6, 8 )	Type:	-
( 6, 9 )	Type:	-
( 5, 6 )	Type:	[1m[34mH[0m[0m
( 5, 6 )	Type:	-
( 5, 6 )	Type:	[1m[34mH[0m[0m
( 5, 8 )	Type:	-
( 5, 8 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 5 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 7 )	Type:	-
( 4, 7 )	Type:	-
( 4, 7 )	Type:	[1m[34mH[0m[0m
( 4, 8 )	Type:	[1m[34mH[0m[0m
( 4, 8 )	Type:	[1m[34mH[0m[0m
( 3, 9 )	Type:	-
( 2, 6 )	Type:	-
( 1, 7 )	Type:	-
( 0, 4 )	Type:	-
Total #Edges: 35

qsyn> zxgs -spi

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(8, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	9	(0, -) (5, [1m[34mH[0m[0m) (5, -) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) (7, -) (7, -) (8, [1m[34mH[0m[0m) (8, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	13	(2, -) (4, [1m[34mH[0m[0m) (4, -) (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (8, -) (8, -) (8, -) (8, -) (8, -) 
ID:	7	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	7	(1, -) (4, [1m[34mH[0m[0m) (4, -) (4, -) (8, -) (10, -) (10, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	13	(3, -) (4, [1m[34mH[0m[0m) (4, [1m[34mH[0m[0m) (5, -) (5, -) (5, -) (5, -) (5, -) (7, -) (11, -) (11, -) (11, -) (11, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	6	(7, -) (7, -) (11, -) (11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (11, -) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	12	(8, -) (8, -) (8, -) (8, -) (10, -) (10, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) (10, -) (11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
Total #Vertices: 10

qsyn> zxgp -e
( 10, 11 )	Type:	-
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 10, 11 )	Type:	-
( 8, 11 )	Type:	-
( 8, 11 )	Type:	-
( 7, 8 )	Type:	-
( 7, 10 )	Type:	-
( 7, 10 )	Type:	-
( 5, 8 )	Type:	-
( 5, 8 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 5 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 7 )	Type:	-
( 4, 7 )	Type:	-
( 4, 7 )	Type:	[1m[34mH[0m[0m
( 4, 8 )	Type:	[1m[34mH[0m[0m
( 4, 8 )	Type:	[1m[34mH[0m[0m
( 1, 7 )	Type:	-
( 0, 4 )	Type:	-
( 11, 11 )	Type:	[1m[34mH[0m[0m
( 11, 11 )	Type:	[1m[34mH[0m[0m
( 5, 2 )	Type:	-
( 5, 5 )	Type:	[1m[34mH[0m[0m
( 5, 5 )	Type:	[1m[34mH[0m[0m
( 5, 8 )	Type:	-
( 5, 8 )	Type:	-
( 8, 5 )	Type:	-
( 8, 11 )	Type:	-
( 8, 11 )	Type:	-
( 8, 3 )	Type:	-
Total #Edges: 32

qsyn> zxgs -hopf

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(4, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(7, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	3	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(8, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(0, -) (5, [1m[34mH[0m[0m) (5, -) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:	5	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(2, -) (4, [1m[34mH[0m[0m) (4, -) (4, [1m[34mH[0m[0m) (8, -) 
ID:	7	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (4, [1m[34mH[0m[0m) (8, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(3, -) (5, -) (7, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(11, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
ID:	11	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(10, [1m[34mH[0m[0m) (10, [1m[34mH[0m[0m) 
Total #Vertices: 10

qsyn> zxgp -e
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 10, 11 )	Type:	[1m[34mH[0m[0m
( 7, 8 )	Type:	-
( 5, 8 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 5 )	Type:	-
( 4, 5 )	Type:	[1m[34mH[0m[0m
( 4, 7 )	Type:	[1m[34mH[0m[0m
( 1, 7 )	Type:	-
( 0, 4 )	Type:	-
( 5, 2 )	Type:	-
( 8, 3 )	Type:	-
Total #Edges: 12

qsyn> q -f

