DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 5
Note: verbose level is set to 5

qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxgr benchmark/zx/hopf.zx
Successfully generated Graph 0
Checkout to Graph 0
Add input 0
Add output 1
Add vertex 2
Add vertex 3
Add edge ( 2, 3 )
Add edge ( 2, 3 )
Add edge ( 2, 3 )
Add edge ( 2, 3 )
Add edge ( 1, 3 )
Add edge ( 0, 2 )

qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(0, -) (3, -) (3, [1m[34mH[0m[0m) (3, [1m[34mH[0m[0m) (3, [1m[34mH[0m[0m) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(1, -) (2, -) (2, [1m[34mH[0m[0m) (2, [1m[34mH[0m[0m) (2, [1m[34mH[0m[0m) 
Total #Vertices: 4

qsyn> zxgp -e
( 2, 3 )	Type:	[1m[34mH[0m[0m
( 2, 3 )	Type:	[1m[34mH[0m[0m
( 2, 3 )	Type:	[1m[34mH[0m[0m
( 2, 3 )	Type:	-
( 1, 3 )	Type:	-
( 0, 2 )	Type:	-
Total #Edges: 6

qsyn> zxgs -hopf
Hopf Rule: 
Found 1 match(es)
Remove (2, 3 )
Remove (2, 3 )
1 iterations

qsyn> zxgp -v
ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (3, [1m[34mH[0m[0m) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (2, -) (2, [1m[34mH[0m[0m) 
Total #Vertices: 4

qsyn> zxgp -e
( 2, 3 )	Type:	[1m[34mH[0m[0m
( 2, 3 )	Type:	-
( 1, 3 )	Type:	-
( 0, 2 )	Type:	-
Total #Edges: 4

qsyn> q -f

