DV Lab, NTUEE, Qsyn 0.5.1
qsyn> zxgr benchmark/zx/cnot.zx

qsyn> zxgp
Graph 0( 2 inputs, 2 outputs, 6 vertices, 5 edges )

qsyn> zxcopy

qsyn> zxgp
Graph 1( 2 inputs, 2 outputs, 6 vertices, 5 edges )

qsyn> zxge -rmv 1

qsyn> zxgp
Graph 1( 1 inputs, 2 outputs, 5 vertices, 4 edges )

qsyn> zxch 0

qsyn> zxgp
Graph 0( 2 inputs, 2 outputs, 6 vertices, 5 edges )

qsyn> zxr

qsyn> zxgr benchmark/zx/cnot.zx

qsyn> zxgp
Graph 0( 2 inputs, 2 outputs, 6 vertices, 5 edges )

qsyn> zxcopy

qsyn> zxgp
Graph 1( 2 inputs, 2 outputs, 6 vertices, 5 edges )

qsyn> zxge -rmv 1

qsyn> zxgp
Graph 1( 1 inputs, 2 outputs, 5 vertices, 4 edges )

qsyn> zxcop -r 0

qsyn> zxgp
Graph 0( 1 inputs, 2 outputs, 5 vertices, 4 edges )

qsyn> zxr

qsyn> zxgr benchmark/zx/cnot.zx

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxcopy

qsyn> zxge -adde 0 5 HADAMARD

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   2     (2, -) (5, H) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   2     (0, H) (3, -) 
Total #Vertices: 6


qsyn> zxcheckout 0

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> qq -f

