DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/mlp4_245.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 10620
└── CX: 8232
T-family: 8232
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 33.16 seconds
Total time used  : 33.16 seconds
Total memory used: 836.2 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 5.41 seconds
Total time used  : 38.57 seconds
Total memory used: 836.2 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 26494
└── CX: 20437
T-family: 3324
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 40.75 seconds
Total time used  : 79.32 seconds
Total memory used: 836.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

