DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_278.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 33234
└── CX: 26692
T-family: 21532
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 10.28 seconds
Total time used  : 10.28 seconds
Total memory used: 378.1 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 8.78 seconds
Total time used  : 19.06 seconds
Total memory used: 378.1 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 82513
└── CX: 52956
T-family: 12772
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 299.7 seconds
Total time used  : 318.8 seconds
Total memory used: 379.7 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

