DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf2_277.qasm

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 12405
└── CX: 10066
T-family: 7707
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.48 seconds
Total time used  : 1.48 seconds
Total memory used: 73.49 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.38 seconds
Total time used  : 3.86 seconds
Total memory used: 73.49 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 30347
└── CX: 17965
T-family: 5063
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 35.26 seconds
Total time used  : 39.12 seconds
Total memory used: 93.08 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

