qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generate Graph 0
Checkout to Graph 0

qsyn> zxgedit -addi 0 0
Add input 0

qsyn> zxgedit -addi 1 1
Add input 1

qsyn> zxgedit -addo 2 0
Add output 2

qsyn> zxgedit -addv 3 0 Z 0
Add vertice 3

qsyn> zxgedit -addv 4 0 Z 0
Add vertice 4

qsyn> zxgedit -addv 5 0 Z 0
Add vertice 5

qsyn> zxgedit -addv 6 0 X 0
Add vertice 6

qsyn> zxgedit -addv 7 0 X 0
Add vertice 7

qsyn> zxgedit -adde 0 3 SIMPLE
Add edge ( 0, 3 )

qsyn> zxgedit -adde 1 3 SIMPLE
Add edge ( 1, 3 )

qsyn> zxgedit -adde 3 4 SIMPLE
Add edge ( 3, 4 )

qsyn> zxgedit -adde 3 4 HADAMARD
Add edge ( 3, 4 )

qsyn> zxgedit -adde 3 6 HADAMARD
Add edge ( 3, 6 )

qsyn> zxgedit -adde 4 5 SIMPLE
Add edge ( 4, 5 )

qsyn> zxgedit -adde 4 5 SIMPLE
Add edge ( 4, 5 )

qsyn> zxgedit -adde 4 6 SIMPLE
Add edge ( 4, 6 )

qsyn> zxgedit -adde 5 7 HADAMARD
Add edge ( 5, 7 )

qsyn> zxgedit -adde 6 7 SIMPLE
Add edge ( 6, 7 )

qsyn> zxgedit -adde 5 2 SIMPLE
Add edge ( 5, 2 )

qsyn> zxgedit -adde 7 2 SIMPLE
Add edge ( 7, 2 )

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	2	(5, -) (7, -) 
ID:	3	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(0, -) (1, -) (4, [1;34mH[0m) (4, -) (6, [1;34mH[0m) 
ID:	4	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	5	(3, [1;34mH[0m) (3, -) (5, -) (5, -) (6, -) 
ID:	5	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(2, -) (4, -) (4, -) (7, [1;34mH[0m) 
ID:	6	VertexType:	[1;31mX[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(3, [1;34mH[0m) (4, -) (7, -) 
ID:	7	VertexType:	[1;31mX[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(2, -) (5, [1;34mH[0m) (6, -) 
Total #Vertices: 8

qsyn> zxgp -e
( 0, 3 )	Type:	-
( 1, 3 )	Type:	-
( 3, 4 )	Type:	-
( 3, 4 )	Type:	[1;34mH[0m
( 3, 6 )	Type:	[1;34mH[0m
( 4, 5 )	Type:	-
( 4, 5 )	Type:	-
( 4, 6 )	Type:	-
( 5, 7 )	Type:	[1;34mH[0m
( 6, 7 )	Type:	-
( 5, 2 )	Type:	-
( 7, 2 )	Type:	-
Total #Edges: 12

qsyn> zxgsimp -spi
Spider Fusion: 2 Add edge ( 3, 6 )
Add edge ( 3, 5 )
Add edge ( 3, 5 )
Add edge ( 3, 3 )
Add edge ( 6, 2 )
Add edge ( 6, 5 )
Remove ID: 4
Remove ID: 7
. 1 Add edge ( 3, 6 )
Add edge ( 3, 2 )
Remove ID: 5
. 2 iterations

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	2	(3, -) (6, -) 
ID:	3	VertexType:	[1;32mZ[0m	Qubit:	0	Phase:	0	#Neighbors:	8	(0, -) (1, -) (2, -) (3, [1;34mH[0m) (3, [1;34mH[0m) (6, [1;34mH[0m) (6, -) (6, [1;34mH[0m) 
ID:	6	VertexType:	[1;31mX[0m	Qubit:	0	Phase:	0	#Neighbors:	4	(2, -) (3, [1;34mH[0m) (3, -) (3, [1;34mH[0m) 
Total #Vertices: 5

qsyn> zxgp -e
( 0, 3 )	Type:	-
( 1, 3 )	Type:	-
( 3, 6 )	Type:	[1;34mH[0m
( 3, 6 )	Type:	-
( 3, 3 )	Type:	[1;34mH[0m
( 6, 2 )	Type:	-
( 3, 6 )	Type:	[1;34mH[0m
( 3, 2 )	Type:	-
Total #Edges: 8

qsyn> q -f

