qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxn
Successfully generate Graph 0
Checkout to Graph 0

qsyn> zxgedit -addi 0 0
Add input 0

qsyn> zxgedit -addi 1 1
Add input 1

qsyn> zxgedit -addo 2 0
Add output 2

qsyn> zxgedit -addv 3 0 Z 0
Add vertex 3

qsyn> zxgedit -adde 0 3 SIMPLE
Add edge ( 0, 3 )

qsyn> zxgedit -adde 1 3 SIMPLE
Add edge ( 1, 3 )

qsyn> zxgedit -adde 2 3 SIMPLE
Add edge ( 2, 3 )

qsyn> zxgedit -adde 3 3 SIMPLE
Add edge ( 3, 3 )

qsyn> zxgedit -adde 3 3 SIMPLE
Add edge ( 3, 3 )

qsyn> zxgedit -adde 3 3 HADAMARD
Add edge ( 3, 3 )

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	9	(0, -) (1, -) (2, -) (3, [1m[34mH[0m[0m) (3, [1m[34mH[0m[0m) (3, -) (3, -) (3, -) (3, -) 
Total #Vertices: 4

qsyn> zxgp -e
( 0, 3 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 3, 3 )	Type:	-
( 3, 3 )	Type:	-
( 3, 3 )	Type:	[1m[34mH[0m[0m
Total #Edges: 6

qsyn> zxgsimp -spi
Spider Fusion: 1 Remove (3, 3 )
Remove (3, 3 )
Remove (3, 3 )
. 1 iterations

qsyn> zxgp -v
ID:	0	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	1	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	3	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	Ï€	#Neighbors:	3	(0, -) (1, -) (2, -) 
Total #Vertices: 4

qsyn> zxgp -e
( 0, 3 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
Total #Edges: 3

qsyn> q -f

