DV Lab, NTUEE, Qsyn 0.4.1
qsyn> ver 1
Note: verbose level is set to 1

qsyn> zxm -on
Illegal command!! (zxm)

qsyn> qccread benchmark/benchmark_SABRE/large/rd84_253.qasm

qsyn> qc2zx

qsyn> zxgp
Graph 0( 16 inputs, 16 outputs, 19650 vertices, 25594 edges )

qsyn> zxcopy

qsyn> zxgadjoint

qsyn> // zxgs -fr
qsyn> zxch 0

qsyn> zxcompose 1

qsyn> zxgprint
Graph 0( 16 inputs, 16 outputs, 39300 vertices, 51204 edges )

qsyn> zxgs -fr

All rules applied:
(1) Hadamard Rule
(2) Spider Fusion Rule
(3) Identity Removal Rule
(4) Pivot Rule
(5) Pivot Gadget Rule
(6) Local Complementation Rule
(7) Phase Gadget Rule
(8) Pivot Boundary Rule

qsyn> zxgp
Graph 0( 16 inputs, 16 outputs, 32 vertices, 16 edges )

qsyn> zxgt -id
The graph is an identity!

qsyn> usage
Period time used : 50.57 seconds
Total time used  : 50.57 seconds
Total memory used: 577.5 M Bytes

qsyn> qq -f

