DV Lab, NTUEE, Qsyn 0.5.1
qsyn> zxgr benchmark/zx/cnot.zx
Created and checked out to ZXGraph 0

qsyn> zxgp -v 1 0

ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 


qsyn> zxgp -v 1 0 d 9
Error: invalid size_t value "d" for argument "-vertices"!!

qsyn> zxgp -q 1 2

ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 



qsyn> zxgr benchmark/zx/cnot.zx
Created and checked out to ZXGraph 1

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxprint
-> #ZXGraph: 2
-> Now focused on: ZXGraph 1

qsyn> zxgr benchmark/zx/cnot.zx
Created and checked out to ZXGraph 2

qsyn> zxgprint -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 (Z, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 (X, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxgprint -e
( 0, 2 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
( 3, 5 )	Type:	-
Total #Edges: 5

qsyn> qq -f

