DV Lab, NTUEE, Qsyn 0.4.2
qsyn> zxnew
Create and checkout to Graph 0

qsyn> zxgt

qsyn> zxgp -v 1 0

ID:   1 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 


qsyn> zxgp -v 1 0 d 9

ID:   1 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 


qsyn> zxgp -q 1 2

ID:   1 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   3 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   5 (â—, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 



qsyn> zxnew
Create and checkout to Graph 1

qsyn> zxgt

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (â—, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (â—, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxprint
-> #Graph: 2
-> Now focus on: 1

qsyn> zxnew
Create and checkout to Graph 2

qsyn> zxgtest -gcx

qsyn> zxgprint -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (â—, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (â—, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxgprint -e
( 0, 2 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
( 3, 5 )	Type:	-
Total #Edges: 5

qsyn> qq -f

