DV Lab, NTUEE, Qsyn 0.3.0
qsyn> zxm -on
ZXMODE turn ON!

qsyn> zxnew
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgt

qsyn> zxnew
Successfully generated Graph 1
Checkout to Graph 1

qsyn> zxgt

qsyn> zxten 0

qsyn> zxgp -v

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	6	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(9, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(6, -) (9, -) (10, -) 
ID:	9	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(7, -) (8, -) (11, -) 
ID:	10	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(8, -) 
ID:	11	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(9, -) 
Total #Vertices: 12


qsyn> q -f

