DV Lab, NTUEE, Qsyn 0.3.0
qsyn> zxprint
ZXMode: ON
-> #Graph: 0

qsyn> zxnew
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgtest -gcx

qsyn> zxgprint -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (3, -) 
ID:   2 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 1)	  #Neighbors:   3     (0, -) (3, -) (4, -) 
ID:   3 ([1m[31mX[0m[0m, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (1, -) (2, -) (5, -) 
ID:   4 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (2, -) 
ID:   5 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (3, -) 
Total #Vertices: 6


qsyn> zxgprint -e
( 0, 2 )	Type:	-
( 1, 3 )	Type:	-
( 2, 3 )	Type:	-
( 2, 4 )	Type:	-
( 3, 5 )	Type:	-
Total #Edges: 5

qsyn> zxnew
Successfully generated Graph 1
Checkout to Graph 1

qsyn> zxcheckout 0
Checkout to Graph 0

qsyn> ZXGEdit -rmv 1

qsyn> zxgprint
Graph 0( 1 inputs, 2 outputs, 5 vertices, 4 edges )

qsyn> qq -f

