qsyn> zxmode -on
ZXMODE turn ON!

qsyn> zxnew
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxge -addi 1 1

qsyn> zxge -addi 3 0

qsyn> zxge -addi 2 2

qsyn> zxge -addo 4 0

qsyn> zxge -addo 5 2

qsyn> zxge -addo 6 1

qsyn> zxgp -i
Input 1:       1
Input 2:       3
Input 3:       2
Total #Inputs: 3

qsyn> zxgp -o
Output 1:      4
Output 2:      5
Output 3:      6
Total #Outputs: 3

qsyn> zxgp -v
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	0	
ID:	3	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	0	
ID:	2	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	0	
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	0	
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	0	
ID:	6	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	0	
Total #Vertices: 6

qsyn> q -f

