DV Lab, NTUEE, Qsyn 0.3.0
qsyn> zxnew
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgt

qsyn> zxgp -v

ID:	0	VertexType:	●	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6


qsyn> zxge -rmv 0

qsyn> zxgp -v

ID:	1	VertexType:	●	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	2	(3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 5


qsyn> zxge -rme 2 3 SIMPLE

qsyn> zxgp -v 

ID:	1	VertexType:	●	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	2	(1, -) (5, -) 
ID:	4	VertexType:	●	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 5


qsyn> zxge -addi 0

qsyn> zxgp -v

ID:	1	VertexType:	●	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	1	(4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	2	(1, -) (5, -) 
ID:	4	VertexType:	●	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	1	(3, -) 
ID:	6	VertexType:	●	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	0	
Total #Vertices: 6


qsyn> zxge -adde 6 2 SIMPLE

qsyn> zxge -adde 2 3 SIMPLE

qsyn> zxgp -v

ID:	1	VertexType:	●	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	3	(3, -) (4, -) (6, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	(Qubit,Col):	(1, 0)	Phase:	0	#Neighbors:	1	(3, -) 
ID:	6	VertexType:	●	(Qubit,Col):	(0, 0)	Phase:	0	#Neighbors:	1	(2, -) 
Total #Vertices: 6


qsyn> qq -f

