DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/9symml_195.qasm

qsyn> qccp 
QCir 0( 16 qubits, 34881 gates)
Clifford    : 19649
└── 2-qubit : 15232
T-family    : 15232
Others      : 0
Depth       : 32084

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 14.65 seconds
Total time used  : 14.65 seconds
Total memory used: 1040 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 4.27 seconds
Total time used  : 18.92 seconds
Total memory used: 1040 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp
QCir 1( 16 qubits, 31393 gates)
Clifford    : 29517
└── 2-qubit : 14399
T-family    : 6450
Others      : 0
Depth       : 41527

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 22057 gates)
Clifford    : 16059
└── 2-qubit : 12822
T-family    : 6450
Others      : 0
Depth       : 31429

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 84.18 seconds
Total time used  : 103.1 seconds
Total memory used: 1040 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

