DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/adr4_197.qasm

qsyn> qccp 
QCir 0( 16 qubits, 3439 gates)
Clifford    : 1941
└── 2-qubit : 1498
T-family    : 1498
Others      : 0
Depth       : 3088

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.12 seconds
Total time used  : 0.12 seconds
Total memory used: 25.38 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.4 seconds
Total time used  : 0.52 seconds
Total memory used: 25.38 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 3484 gates)
Clifford    : 3270
└── 2-qubit : 1580
T-family    : 692
Others      : 0
Depth       : 4381

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 2421 gates)
Clifford    : 1815
└── 2-qubit : 1465
T-family    : 692
Others      : 0
Depth       : 3320

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.52 seconds
Total time used  : 1.04 seconds
Total memory used: 34.79 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

