DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm82a_208.qasm

qsyn> qccp 
QCir 0( 16 qubits, 650 gates)
Clifford    : 370
└── 2-qubit : 283
T-family    : 280
Others      : 0
Depth       : 571

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0 seconds
Total time used  : 0 seconds
Total memory used: 2.629 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.03 seconds
Total time used  : 0.03 seconds
Total memory used: 2.629 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 613 gates)
Clifford    : 653
└── 2-qubit : 261
T-family    : 122
Others      : 0
Depth       : 672

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 408 gates)
Clifford    : 322
└── 2-qubit : 229
T-family    : 122
Others      : 0
Depth       : 502

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.02 seconds
Total time used  : 0.05 seconds
Total memory used: 5.148 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

