DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/pm1_249.qasm

qsyn> qccp 
QCir 0( 16 qubits, 1776 gates)
Clifford    : 1006
└── 2-qubit : 771
T-family    : 770
Others      : 0
Depth       : 1574

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.05 seconds
Total time used  : 0.05 seconds
Total memory used: 17.78 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.21 seconds
Total time used  : 0.26 seconds
Total memory used: 17.78 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 1708 gates)
Clifford    : 1572
└── 2-qubit : 659
T-family    : 370
Others      : 0
Depth       : 1947

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 1108 gates)
Clifford    : 806
└── 2-qubit : 604
T-family    : 370
Others      : 0
Depth       : 1398

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.13 seconds
Total time used  : 0.39 seconds
Total memory used: 17.78 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

