DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd84_253.qasm

qsyn> qccp 
QCir 0( 16 qubits, 13658 gates)
Clifford    : 7701
└── 2-qubit : 5960
T-family    : 5957
Others      : 0
Depth       : 12176

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.67 seconds
Total time used  : 2.67 seconds
Total memory used: 287 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.83 seconds
Total time used  : 4.5 seconds
Total memory used: 287.5 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 12573 gates)
Clifford    : 12218
└── 2-qubit : 5579
T-family    : 2625
Others      : 0
Depth       : 15953

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 8687 gates)
Clifford    : 6382
└── 2-qubit : 4971
T-family    : 2625
Others      : 0
Depth       : 11721

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 34.87 seconds
Total time used  : 39.37 seconds
Total memory used: 546.3 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

