DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/root_255.qasm

qsyn> qccp 
QCir 0( 16 qubits, 17159 gates)
Clifford    : 9669
└── 2-qubit : 7493
T-family    : 7490
Others      : 0
Depth       : 14799

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 6.09 seconds
Total time used  : 6.09 seconds
Total memory used: 605.9 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.66 seconds
Total time used  : 8.75 seconds
Total memory used: 605.9 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 15093 gates)
Clifford    : 14733
└── 2-qubit : 6881
T-family    : 3114
Others      : 0
Depth       : 18793

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 10627 gates)
Clifford    : 8049
└── 2-qubit : 6097
T-family    : 3114
Others      : 0
Depth       : 13991

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 15.89 seconds
Total time used  : 24.64 seconds
Total memory used: 605.9 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

