DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqn_258.qasm

qsyn> qccp 
QCir 0( 16 qubits, 10223 gates)
Clifford    : 5764
└── 2-qubit : 4459
T-family    : 4459
Others      : 0
Depth       : 9176

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.43 seconds
Total time used  : 1.43 seconds
Total memory used: 207.8 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.22 seconds
Total time used  : 2.65 seconds
Total memory used: 207.8 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 9775 gates)
Clifford    : 9454
└── 2-qubit : 4176
T-family    : 2097
Others      : 0
Depth       : 12003

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 6686 gates)
Clifford    : 4819
└── 2-qubit : 3738
T-family    : 2097
Others      : 0
Depth       : 8753

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 10.31 seconds
Total time used  : 12.96 seconds
Total memory used: 278.5 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

