DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/z4_268.qasm

qsyn> qccp 
QCir 0( 16 qubits, 3073 gates)
Clifford    : 1736
└── 2-qubit : 1343
T-family    : 1337
Others      : 0
Depth       : 2756

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.06 seconds
Total time used  : 0.06 seconds
Total memory used: 13.75 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.3 seconds
Total time used  : 0.36 seconds
Total memory used: 13.75 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp 
QCir 1( 16 qubits, 2882 gates)
Clifford    : 2601
└── 2-qubit : 1157
T-family    : 631
Others      : 0
Depth       : 3493

qsyn> optimize

qsyn> qccp 
QCir 1( 16 qubits, 1917 gates)
Clifford    : 1358
└── 2-qubit : 1047
T-family    : 631
Others      : 0
Depth       : 2557

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.37 seconds
Total time used  : 0.73 seconds
Total memory used: 21.16 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

