DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/9symml_195.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 19649
└── CX: 15232
T-family: 15232
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 31.29 seconds
Total time used  : 31.29 seconds
Total memory used: 633.6 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 6.34 seconds
Total time used  : 37.63 seconds
Total memory used: 633.6 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 33978
└── CX: 22196
T-family: 6450
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 143.6 seconds
Total time used  : 181.3 seconds
Total memory used: 633.6 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

