DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/adr4_197.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 1941
└── CX: 1498
T-family: 1498
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.35 seconds
Total time used  : 0.35 seconds
Total memory used: 17.18 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.63 seconds
Total time used  : 0.98 seconds
Total memory used: 17.18 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 5485
└── CX: 4059
T-family: 692
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.22 seconds
Total time used  : 2.2 seconds
Total memory used: 19.36 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

