DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cycle10_2_110.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 3404
└── CX: 2648
T-family: 2646
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.5 seconds
Total time used  : 1.5 seconds
Total memory used: 77.6 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.09 seconds
Total time used  : 2.59 seconds
Total memory used: 77.6 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 7783
└── CX: 5493
T-family: 1160
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.97 seconds
Total time used  : 5.56 seconds
Total memory used: 77.6 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

