DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dc2_222.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 5332
└── CX: 4131
T-family: 4130
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 5.01 seconds
Total time used  : 5.01 seconds
Total memory used: 167.1 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.19 seconds
Total time used  : 7.2 seconds
Total memory used: 167.1 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 12409
└── CX: 9052
T-family: 1758
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 7.44 seconds
Total time used  : 14.64 seconds
Total memory used: 167.1 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

