DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/hwb8_113.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 39042
└── CX: 30372
T-family: 30338
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 33.79 seconds
Total time used  : 33.79 seconds
Total memory used: 726.9 M Bytes

qsyn> zxgw ../../hwb8_113_fr.bzx -bzx

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 11.49 seconds
Total time used  : 45.28 seconds
Total memory used: 726.9 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 69722
└── CX: 40008
T-family: 14934
Others  : 0


qsyn> qc2zx

qsyn> zxgw ../../hwb8_113_extract.bzx -bzx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr
119047, 133486
123030, 133515
123058, 139878
123050, 133561

qsyn> usage
Period time used : 426.2 seconds
Total time used  : 471.5 seconds
Total memory used: 726.9 M Bytes

qsyn> zxgw ../../hwb8_113_compose.bzx -bzx

qsyn> zxgp -q

ID:133563 (Z, π/4)         (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133564, H) 
ID:133565 (Z, π/4)         (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133566, H) 
ID:133567 (Z, 7π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133568, H) 
ID:133569 (Z, 7π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   5     (123046, H) (133568, H) (142694, H) (170138, H) (170142, H) 
ID:133571 (Z, π/4)         (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133572, H) 
ID:133575 (Z, 7π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133576, H) 
ID:133577 (Z, π/4)         (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133578, H) 
ID:133579 (Z, 7π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133580, H) 
ID:133581 (Z, 3π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:  38     (119152, H) (119276, H) (119289, H) (119310, H) (119379, H) (119437, H) (119438, H) (119463, -) (123046, H) (123048, H) (123060, H) (123064, H) (133564, H) (133568, H) (133576, H) (133583, H) (133585, H) (139888, H) (141755, H) (141757, H) (142694, H) (143951, H) (149857, H) (149865, H) (149875, H) (149879, H) (149881, H) (149883, H) (149885, H) (154189, H) (157169, H) (159197, H) (159199, H) (159201, H) (160571, H) (160573, H) (170144, H) (170145, H) 
ID:133582 (Z, 7π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133583, H) 
ID:133584 (Z, π/4)         (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133585, H) 
ID:133586 (Z, 3π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:  48     (119276, H) (119289, H) (119310, H) (119379, H) (119437, H) (123048, H) (123052, H) (123054, H) (123056, H) (123059, H) (123061, H) (133564, H) (133566, H) (133576, H) (133583, H) (139888, H) (139893, H) (139895, H) (139897, H) (139899, H) (141757, H) (141759, H) (141761, H) (142694, H) (143951, H) (143953, H) (149865, H) (149875, H) (149879, H) (149881, H) (149883, H) (149885, H) (154181, H) (154189, H) (157167, H) (157169, H) (159197, H) (159199, H) (159201, H) (160573, H) (170119, H) (170124, H) (170137, H) (170138, H) (170140, H) (170142, H) (170144, H) (170145, H) 
ID:133588 (Z, π/4)         (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133589, H) 
ID:133590 (Z, 7π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (133591, H) 
ID:139888 (Z, 3π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:  15     (119152, H) (119248, H) (119283, H) (119451, H) (123045, H) (123046, H) (123049, H) (123052, H) (123053, H) (123055, H) (133581, H) (133586, H) (149863, H) (159195, H) (170134, H) 
ID:139890 (Z, 7π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (139891, H) 
ID:139892 (Z, 3π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (139893, H) 
ID:139894 (Z, π/4)         (Qubit, Col): (-2, 1)	  #Neighbors:   1     (139895, H) 
ID:139896 (Z, 7π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (139897, H) 
ID:139898 (Z, π/4)         (Qubit, Col): (-2, 1)	  #Neighbors:   1     (139899, H) 
ID:141754 (Z, 7π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (141755, H) 
ID:141756 (Z, 7π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (141757, H) 
ID:141758 (Z, 5π/4)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (141759, H) 
ID:141760 (Z, π/4)         (Qubit, Col): (-2, 1)	  #Neighbors:   1     (141761, H) 
ID:142693 (Z, π/4)         (Qubit, Col): (-2, 1)	  #Neighbors:   1     (142694, H) 
ID:149856 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149857, H) 
ID:149862 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149863, H) 
ID:149864 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149865, H) 
ID:149868 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149869, H) 
ID:149870 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149871, H) 
ID:149872 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149873, H) 
ID:149874 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149875, H) 
ID:149876 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149877, H) 
ID:149878 (Z, 5π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149879, H) 
ID:149880 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149881, H) 
ID:149882 (Z, 5π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149883, H) 
ID:149884 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (149885, H) 
ID:154180 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (154181, H) 
ID:154186 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (154187, H) 
ID:154188 (Z, 5π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (154189, H) 
ID:154190 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (154191, H) 
ID:154192 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (154193, H) 
ID:157166 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (157167, H) 
ID:157168 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (157169, H) 
ID:159194 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (159195, H) 
ID:159196 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (159197, H) 
ID:159198 (Z, 3π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (159199, H) 
ID:159200 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (159201, H) 
ID:160570 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (160571, H) 
ID:160572 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (160573, H) 
ID:170131 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (170132, H) 
ID:170133 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (170134, H) 
ID:170139 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (170140, H) 
ID:170141 (Z, π/4)         (Qubit, Col): (-2, 0)	  #Neighbors:   1     (170142, H) 
ID:170143 (Z, 5π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (170144, H) 
ID:170146 (Z, 7π/4)        (Qubit, Col): (-2, 0)	  #Neighbors:   1     (170147, H) 


ID:133564 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   5     (123045, H) (123055, H) (133563, H) (133581, H) (133586, H) 
ID:133566 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   5     (119115, H) (123055, H) (123059, H) (133565, H) (133586, H) 
ID:133568 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   6     (119115, H) (123045, H) (123059, H) (133567, H) (133569, H) (133581, H) 
ID:133572 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (123052, H) (123053, H) (133571, H) 
ID:133576 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   5     (123051, H) (123055, H) (133575, H) (133581, H) (133586, H) 
ID:133578 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (123053, H) (123054, H) (133577, H) 
ID:133580 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (123052, H) (123054, H) (133579, H) 
ID:133583 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   5     (123055, H) (123056, H) (133581, H) (133582, H) (133586, H) 
ID:133585 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (123056, H) (133581, H) (133584, H) 
ID:133589 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (123055, H) (123057, H) (133588, H) 
ID:133591 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (123059, H) (123060, H) (133590, H) 
ID:139891 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   4     (123052, H) (123053, H) (123054, H) (139890, H) 
ID:139893 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (123055, H) (133586, H) (139892, H) 
ID:139895 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   4     (123055, H) (123057, H) (133586, H) (139894, H) 
ID:139897 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (123057, H) (133586, H) (139896, H) 
ID:139899 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   4     (123055, H) (123060, H) (133586, H) (139898, H) 
ID:141755 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   4     (119115, H) (123059, H) (133581, H) (141754, H) 
ID:141757 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   5     (123049, H) (123055, H) (133581, H) (133586, H) (141756, H) 
ID:141759 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   4     (123055, H) (123056, H) (133586, H) (141758, H) 
ID:141761 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   5     (123055, H) (123059, H) (123060, H) (133586, H) (141760, H) 
ID:142694 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   5     (123055, H) (133569, H) (133581, H) (133586, H) (142693, H) 
ID:149857 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   4     (123045, H) (123059, H) (133581, H) (149856, H) 
ID:149863 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   4     (119152, H) (123046, H) (139888, H) (149862, H) 
ID:149865 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   7     (119248, H) (123049, H) (123051, H) (123055, H) (133581, H) (133586, H) (149864, H) 
ID:149869 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   3     (119276, H) (119289, H) (149868, H) 
ID:149871 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   3     (119283, H) (119289, H) (149870, H) 
ID:149873 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   3     (119276, H) (119283, H) (149872, H) 
ID:149875 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   5     (119310, H) (123055, H) (133581, H) (133586, H) (149874, H) 
ID:149877 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   3     (119310, H) (119438, H) (149876, H) 
ID:149879 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   5     (119438, H) (123055, H) (133581, H) (133586, H) (149878, H) 
ID:149881 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   7     (119368, H) (119379, H) (119438, H) (123055, H) (133581, H) (133586, H) (149880, H) 
ID:149883 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   6     (119379, H) (119438, H) (123055, H) (133581, H) (133586, H) (149882, H) 
ID:149885 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   7     (119399, H) (119437, H) (119438, H) (123055, H) (133581, H) (133586, H) (149884, H) 
ID:154181 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   7     (119115, H) (119451, H) (123045, H) (123055, H) (123059, H) (133586, H) (154180, H) 
ID:154187 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   4     (119276, H) (119283, H) (119289, H) (154186, H) 
ID:154189 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   6     (119310, H) (119438, H) (123055, H) (133581, H) (133586, H) (154188, H) 
ID:154191 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   3     (119368, H) (119379, H) (154190, H) 
ID:154193 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   3     (119399, H) (119437, H) (154192, H) 
ID:157167 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   5     (123045, H) (123055, H) (123059, H) (133586, H) (157166, H) 
ID:157169 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   5     (119451, H) (123055, H) (133581, H) (133586, H) (157168, H) 
ID:159195 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   4     (119152, H) (123048, H) (139888, H) (159194, H) 
ID:159197 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   5     (119248, H) (123055, H) (133581, H) (133586, H) (159196, H) 
ID:159199 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   6     (119368, H) (119438, H) (123055, H) (133581, H) (133586, H) (159198, H) 
ID:159201 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   6     (119437, H) (119438, H) (123055, H) (133581, H) (133586, H) (159200, H) 
ID:160571 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   6     (119115, H) (119451, H) (123045, H) (123059, H) (133581, H) (160570, H) 
ID:160573 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   6     (119399, H) (119438, H) (123055, H) (133581, H) (133586, H) (160572, H) 
ID:170132 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   4     (119152, H) (123046, H) (123048, H) (170131, H) 
ID:170134 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   4     (123046, H) (123048, H) (139888, H) (170133, H) 
ID:170140 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   4     (123055, H) (123059, H) (133586, H) (170139, H) 
ID:170142 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   7     (119115, H) (123045, H) (123055, H) (123059, H) (133569, H) (133586, H) (170141, H) 
ID:170144 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   5     (119115, H) (123055, H) (133581, H) (133586, H) (170143, H) 
ID:170147 (Z, 0)           (Qubit, Col): (-1, 0)	  #Neighbors:   4     (119248, H) (123049, H) (123051, H) (170146, H) 


ID:   1 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (143951, H) 
ID:119455 (●, 0)           (Qubit, Col): (0, 38719)	  #Neighbors:   1     (170145, H) 
ID:123053 (Z, 7π/4)        (Qubit, Col): (0, 38679)	  #Neighbors:   9     (123046, H) (123049, H) (123051, H) (123056, H) (133572, H) (133578, H) (139888, H) (139891, H) (170124, H) 
ID:123057 (Z, 7π/4)        (Qubit, Col): (0, 38701)	  #Neighbors:   5     (123056, H) (123060, H) (133589, H) (139895, H) (139897, H) 
ID:143951 (Z, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   6     (1, H) (119438, H) (123055, H) (133581, H) (133586, H) (143953, H) 
ID:170145 (Z, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   6     (119438, H) (119455, H) (123055, H) (133581, H) (133586, H) (143953, H) 


ID:   3 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (119430, -) 
ID:119115 (Z, 3π/4)        (Qubit, Col): (1, 1)	  #Neighbors:  11     (123046, H) (133566, H) (133568, H) (141755, H) (154181, H) (160571, H) (170119, H) (170124, H) (170138, H) (170142, H) (170144, H) 
ID:119152 (Z, 7π/4)        (Qubit, Col): (1, 1)	  #Neighbors:   9     (119451, H) (123045, H) (123048, H) (123059, H) (133581, H) (139888, H) (149863, H) (159195, H) (170132, H) 
ID:119283 (Z, 7π/4)        (Qubit, Col): (1, 1)	  #Neighbors:   9     (119248, H) (119310, H) (119379, H) (123046, H) (139888, H) (149871, H) (149873, H) (154187, H) (170119, H) 
ID:119368 (Z, 5π/4)        (Qubit, Col): (1, 1)	  #Neighbors:   6     (119310, H) (119399, H) (119437, H) (149881, H) (154191, H) (159199, H) 
ID:119430 (Z, 0)           (Qubit, Col): (1, 1)	  #Neighbors:   3     (3, -) (119399, H) (119437, H) 
ID:119457 (●, 0)           (Qubit, Col): (1, 38719)	  #Neighbors:   1     (123061, -) 
ID:123045 (Z, 7π/4)        (Qubit, Col): (1, 38643)	  #Neighbors:  13     (119152, H) (123048, H) (133564, H) (133568, H) (139888, H) (149857, H) (154181, H) (157167, H) (160571, H) (170119, H) (170124, H) (170138, H) (170142, H) 
ID:123059 (Z, π/4)         (Qubit, Col): (1, 38710)	  #Neighbors:  18     (119152, H) (123046, H) (133566, H) (133568, H) (133586, H) (133591, H) (141755, H) (141761, H) (149857, H) (154181, H) (157167, H) (160571, H) (170119, H) (170124, H) (170137, H) (170138, H) (170140, H) (170142, H) 
ID:123061 (Z, 0)           (Qubit, Col): (1, 38718)	  #Neighbors:   4     (119457, -) (123055, H) (123060, H) (133586, H) 


ID:   5 (●, 0)           (Qubit, Col): (2, 2)	  #Neighbors:   1     (143953, -) 
ID:119289 (Z, 7π/4)        (Qubit, Col): (2, 1)	  #Neighbors:   9     (119438, H) (123049, H) (123051, H) (123055, H) (133581, H) (133586, H) (149869, H) (149871, H) (154187, H) 
ID:119310 (Z, 3π/4)        (Qubit, Col): (2, 1)	  #Neighbors:   9     (119283, H) (119368, H) (119438, H) (123055, H) (133581, H) (133586, H) (149875, H) (149877, H) (154189, H) 
ID:119379 (Z, 3π/4)        (Qubit, Col): (2, 1)	  #Neighbors:  10     (119276, H) (119283, H) (119437, H) (123055, H) (133581, H) (133586, H) (143953, H) (149881, H) (149883, H) (154191, H) 
ID:119399 (Z, π/4)         (Qubit, Col): (2, 1)	  #Neighbors:   6     (119368, H) (119430, H) (143953, H) (149885, H) (154193, H) (160573, H) 
ID:119459 (●, 0)           (Qubit, Col): (2, 38719)	  #Neighbors:   1     (123064, H) 
ID:123049 (Z, π/4)         (Qubit, Col): (2, 38657)	  #Neighbors:  10     (119276, H) (119289, H) (123048, H) (123052, H) (123053, H) (123054, H) (139888, H) (141757, H) (149865, H) (170147, H) 
ID:123051 (Z, π/4)         (Qubit, Col): (2, 38671)	  #Neighbors:   7     (119276, H) (119289, H) (123053, H) (123054, H) (133576, H) (149865, H) (170147, H) 
ID:123052 (Z, π/4)         (Qubit, Col): (2, 38674)	  #Neighbors:   9     (123046, H) (123049, H) (123056, H) (133572, H) (133580, H) (133586, H) (139888, H) (139891, H) (170124, H) 
ID:123064 (Z, 0)           (Qubit, Col): (2, 1)	  #Neighbors:   4     (119438, H) (119459, H) (133581, H) (143953, H) 
ID:143953 (Z, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   9     (5, -) (119379, H) (119399, H) (119437, H) (123060, H) (123064, H) (133586, H) (143951, H) (170145, H) 


ID:   7 (●, 0)           (Qubit, Col): (3, 2)	  #Neighbors:   1     (119437, -) 
ID:119437 (Z, π/4)         (Qubit, Col): (3, 1)	  #Neighbors:  12     (7, -) (119368, H) (119379, H) (119430, H) (119438, H) (123055, H) (133581, H) (133586, H) (143953, H) (149885, H) (154193, H) (159201, H) 
ID:119461 (●, 0)           (Qubit, Col): (3, 38719)	  #Neighbors:   1     (170137, H) 
ID:123055 (Z, 5π/4)        (Qubit, Col): (3, 38691)	  #Neighbors:  46     (119276, H) (119289, H) (119310, H) (119379, H) (119437, H) (119438, H) (123048, H) (123054, H) (123056, H) (123061, H) (133564, H) (133566, H) (133576, H) (133583, H) (133589, H) (139888, H) (139893, H) (139895, H) (139899, H) (141757, H) (141759, H) (141761, H) (142694, H) (143951, H) (149865, H) (149875, H) (149879, H) (149881, H) (149883, H) (149885, H) (154181, H) (154189, H) (157167, H) (157169, H) (159197, H) (159199, H) (159201, H) (160573, H) (170119, H) (170124, H) (170137, H) (170138, H) (170140, H) (170142, H) (170144, H) (170145, H) 
ID:123060 (Z, 7π/4)        (Qubit, Col): (3, 38712)	  #Neighbors:   8     (119438, H) (123057, H) (123061, H) (133581, H) (133591, H) (139899, H) (141761, H) (143953, H) 
ID:170137 (Z, 0)           (Qubit, Col): (3, 0)	  #Neighbors:   4     (119461, H) (123055, H) (123059, H) (133586, H) 


ID:   9 (●, 0)           (Qubit, Col): (4, 2)	  #Neighbors:   1     (119438, -) 
ID:119438 (Z, 5π/4)        (Qubit, Col): (4, 1)	  #Neighbors:  20     (9, -) (119276, H) (119289, H) (119310, H) (119437, H) (123055, H) (123060, H) (123064, H) (133581, H) (143951, H) (149877, H) (149879, H) (149881, H) (149883, H) (149885, H) (154189, H) (159199, H) (159201, H) (160573, H) (170145, H) 
ID:119463 (●, 0)           (Qubit, Col): (4, 38719)	  #Neighbors:   1     (133581, -) 
ID:123054 (Z, π/4)         (Qubit, Col): (4, 38680)	  #Neighbors:   7     (123049, H) (123051, H) (123055, H) (133578, H) (133580, H) (133586, H) (139891, H) 
ID:123056 (Z, 3π/4)        (Qubit, Col): (4, 38694)	  #Neighbors:   8     (123052, H) (123053, H) (123055, H) (123057, H) (133583, H) (133585, H) (133586, H) (141759, H) 


ID:  11 (●, 0)           (Qubit, Col): (5, 2)	  #Neighbors:   1     (170119, H) 
ID:119248 (Z, 7π/4)        (Qubit, Col): (5, 1)	  #Neighbors:   7     (119276, H) (119283, H) (123048, H) (139888, H) (149865, H) (159197, H) (170147, H) 
ID:119276 (Z, π/4)         (Qubit, Col): (5, 1)	  #Neighbors:  11     (119248, H) (119379, H) (119438, H) (123049, H) (123051, H) (123055, H) (133581, H) (133586, H) (149869, H) (149873, H) (154187, H) 
ID:119465 (●, 0)           (Qubit, Col): (5, 38719)	  #Neighbors:   1     (170124, H) 
ID:123048 (Z, 5π/4)        (Qubit, Col): (5, 38653)	  #Neighbors:  12     (119152, H) (119248, H) (119451, H) (123045, H) (123046, H) (123049, H) (123055, H) (133581, H) (133586, H) (159195, H) (170132, H) (170134, H) 
ID:170119 (Z, 0)           (Qubit, Col): (5, 0)	  #Neighbors:   7     (11, H) (119115, H) (119283, H) (123045, H) (123055, H) (123059, H) (133586, H) 
ID:170124 (Z, 0)           (Qubit, Col): (5, 0)	  #Neighbors:   8     (119115, H) (119465, H) (123045, H) (123052, H) (123053, H) (123055, H) (123059, H) (133586, H) 


ID:  13 (●, 0)           (Qubit, Col): (6, 2)	  #Neighbors:   1     (119467, -) 
ID:119467 (●, 0)           (Qubit, Col): (6, 38719)	  #Neighbors:   1     (13, -) 


ID:  15 (●, 0)           (Qubit, Col): (7, 2)	  #Neighbors:   1     (119469, -) 
ID:119469 (●, 0)           (Qubit, Col): (7, 38719)	  #Neighbors:   1     (15, -) 


ID:  17 (●, 0)           (Qubit, Col): (8, 2)	  #Neighbors:   1     (119451, H) 
ID:119451 (Z, 7π/4)        (Qubit, Col): (8, 1)	  #Neighbors:   7     (17, H) (119152, H) (123048, H) (139888, H) (154181, H) (157169, H) (160571, H) 
ID:119471 (●, 0)           (Qubit, Col): (8, 38719)	  #Neighbors:   1     (170138, -) 
ID:123046 (Z, 7π/4)        (Qubit, Col): (8, 38647)	  #Neighbors:  12     (119115, H) (119283, H) (123048, H) (123052, H) (123053, H) (123059, H) (133569, H) (133581, H) (139888, H) (149863, H) (170132, H) (170134, H) 
ID:170138 (Z, 0)           (Qubit, Col): (8, 0)	  #Neighbors:   7     (119115, H) (119471, -) (123045, H) (123055, H) (123059, H) (133569, H) (133586, H) 


ID:  19 (●, 0)           (Qubit, Col): (9, 2)	  #Neighbors:   1     (119473, -) 
ID:119473 (●, 0)           (Qubit, Col): (9, 38719)	  #Neighbors:   1     (19, -) 


ID:  21 (●, 0)           (Qubit, Col): (10, 2)	  #Neighbors:   1     (119475, -) 
ID:119475 (●, 0)           (Qubit, Col): (10, 38719)	  #Neighbors:   1     (21, -) 


ID:  23 (●, 0)           (Qubit, Col): (11, 2)	  #Neighbors:   1     (119477, -) 
ID:119477 (●, 0)           (Qubit, Col): (11, 38719)	  #Neighbors:   1     (23, -) 


ID:  25 (●, 0)           (Qubit, Col): (12, 2)	  #Neighbors:   1     (119479, -) 
ID:119479 (●, 0)           (Qubit, Col): (12, 38719)	  #Neighbors:   1     (25, -) 


ID:  27 (●, 0)           (Qubit, Col): (13, 2)	  #Neighbors:   1     (119481, -) 
ID:119481 (●, 0)           (Qubit, Col): (13, 38719)	  #Neighbors:   1     (27, -) 


ID:  29 (●, 0)           (Qubit, Col): (14, 2)	  #Neighbors:   1     (119483, -) 
ID:119483 (●, 0)           (Qubit, Col): (14, 38719)	  #Neighbors:   1     (29, -) 


ID:  31 (●, 0)           (Qubit, Col): (15, 2)	  #Neighbors:   1     (119485, -) 
ID:119485 (●, 0)           (Qubit, Col): (15, 38719)	  #Neighbors:   1     (31, -) 


qsyn> zxgt -id 
The graph is not an identity!

qsyn> qq -f

