DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/inc_237.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 5985
└── CX: 4636
T-family: 4634
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 4.57 seconds
Total time used  : 4.57 seconds
Total memory used: 180 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.55 seconds
Total time used  : 7.12 seconds
Total memory used: 180 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 11471
└── CX: 7879
T-family: 1940
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.96 seconds
Total time used  : 16.08 seconds
Total memory used: 180 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

