DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/mlp4_245.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 10620
└── CX: 8232
T-family: 8232
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 30.93 seconds
Total time used  : 30.93 seconds
Total memory used: 880 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 4.9 seconds
Total time used  : 35.83 seconds
Total memory used: 880 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 25998
└── CX: 19903
T-family: 3324
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 29.63 seconds
Total time used  : 65.46 seconds
Total memory used: 880 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

