DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/qft_n20.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 463
└── CX: 380
T-family: 57
Others  : 450


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.04 seconds
Total time used  : 0.04 seconds
Total memory used: 1.359 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.08 seconds
Total time used  : 0.12 seconds
Total memory used: 1.359 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 1190
└── CX: 684
T-family: 21
Others  : 186


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.1 seconds
Total time used  : 0.22 seconds
Total memory used: 3.426 M Bytes

qsyn> zxgt -id 
The graph is not an identity!

qsyn> qq -f

