DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqn_258.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 5764
└── CX: 4459
T-family: 4459
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 7.84 seconds
Total time used  : 7.84 seconds
Total memory used: 261.9 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.67 seconds
Total time used  : 9.51 seconds
Total memory used: 261.9 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 13223
└── CX: 9098
T-family: 2097
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 9.49 seconds
Total time used  : 19 seconds
Total memory used: 261.9 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

