DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_278.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 33234
└── CX: 26692
T-family: 21532
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 12.26 seconds
Total time used  : 12.26 seconds
Total memory used: 370.2 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 8.2 seconds
Total time used  : 20.46 seconds
Total memory used: 370.2 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 81709
└── CX: 51502
T-family: 12772
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 316.9 seconds
Total time used  : 337.4 seconds
Total memory used: 373.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

