DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_149.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 103986
└── CX: 80878
T-family: 80878
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 21 seconds
Total time used  : 21 seconds
Total memory used: 603.5 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 27.38 seconds
Total time used  : 48.38 seconds
Total memory used: 603.5 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 225911
└── CX: 122427
T-family: 40380
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

