DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/z4_268.qasm
Note: QCir list is empty now. Create a new one.

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 1736
└── CX: 1343
T-family: 1337
Others  : 0


qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.26 seconds
Total time used  : 0.26 seconds
Total memory used: 15.34 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.48 seconds
Total time used  : 0.74 seconds
Total memory used: 15.34 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
───── Quantum Circuit Analysis ─────

> Decompose into basic gate set

Clifford: 4272
└── CX: 3027
T-family: 629
Others  : 0


qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.27 seconds
Total time used  : 2.01 seconds
Total memory used: 15.34 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

