DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/9symml_195.qasm

qsyn> qccp -a
Clifford: 19649
└── CX: 15232
T-family: 15232
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 44.62 seconds
Total time used  : 44.62 seconds
Total memory used: 968.2 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 9.59 seconds
Total time used  : 54.21 seconds
Total memory used: 968.2 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 26887
└── CX: 15103
T-family: 6450
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 184.4 seconds
Total time used  : 238.7 seconds
Total memory used: 968.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

