DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/dist_223.qasm

qsyn> qccp -a
Clifford: 21428
└── CX: 16624
T-family: 16618
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 69.56 seconds
Total time used  : 69.56 seconds
Total memory used: 1101 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 11.33 seconds
Total time used  : 80.89 seconds
Total memory used: 1101 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 29689
└── CX: 16502
T-family: 6868
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 123.4 seconds
Total time used  : 204.3 seconds
Total memory used: 1101 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

