DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/ham15_107.qasm

qsyn> qccp -a
Clifford: 4948
└── CX: 3858
T-family: 3815
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.07 seconds
Total time used  : 1.07 seconds
Total memory used: 47.67 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.81 seconds
Total time used  : 3.88 seconds
Total memory used: 47.67 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 7503
└── CX: 3891
T-family: 1805
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 6.04 seconds
Total time used  : 9.92 seconds
Total memory used: 47.67 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

