DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/hwb8_113.qasm

qsyn> qccp -a
Clifford: 39042
└── CX: 30372
T-family: 30338
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 35.58 seconds
Total time used  : 35.58 seconds
Total memory used: 707.7 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 14.34 seconds
Total time used  : 49.92 seconds
Total memory used: 707.7 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 56569
└── CX: 27535
T-family: 14934
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 509.9 seconds
Total time used  : 559.8 seconds
Total memory used: 707.7 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

