DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/inc_237.qasm

qsyn> qccp -a
Clifford: 5985
└── CX: 4636
T-family: 4634
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.19 seconds
Total time used  : 8.19 seconds
Total memory used: 278.6 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 3.71 seconds
Total time used  : 11.9 seconds
Total memory used: 278.6 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 7225
└── CX: 3625
T-family: 1942
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.44 seconds
Total time used  : 20.34 seconds
Total memory used: 278.6 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

