DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/pm1_249.qasm

qsyn> qccp -a
Clifford: 1006
└── CX: 771
T-family: 770
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.29 seconds
Total time used  : 0.29 seconds
Total memory used: 17.62 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.42 seconds
Total time used  : 0.71 seconds
Total memory used: 17.62 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 1481
└── CX: 722
T-family: 370
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.29 seconds
Total time used  : 1 seconds
Total memory used: 17.62 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

