DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd73_252.qasm

qsyn> qccp -a
Clifford: 3004
└── CX: 2319
T-family: 2317
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.53 seconds
Total time used  : 0.53 seconds
Total memory used: 25.56 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.12 seconds
Total time used  : 1.65 seconds
Total memory used: 25.56 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 4810
└── CX: 2662
T-family: 1045
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.69 seconds
Total time used  : 4.34 seconds
Total memory used: 25.56 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

