DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/square_root_7.qasm

qsyn> qccp -a
Clifford: 4711
└── CX: 3089
T-family: 2919
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.33 seconds
Total time used  : 0.33 seconds
Total memory used: 17.45 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.16 seconds
Total time used  : 1.49 seconds
Total memory used: 17.45 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 5368
└── CX: 2760
T-family: 1109
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.1 seconds
Total time used  : 3.59 seconds
Total memory used: 21.5 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

