DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_278.qasm

qsyn> qccp -a
Clifford: 33234
└── CX: 26692
T-family: 21532
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 12.34 seconds
Total time used  : 12.34 seconds
Total memory used: 377 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 10.65 seconds
Total time used  : 22.99 seconds
Total memory used: 377 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 64034
└── CX: 34527
T-family: 12772
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 355.7 seconds
Total time used  : 378.7 seconds
Total memory used: 377 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

