DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_149.qasm

qsyn> qccp -a
Clifford: 103986
└── CX: 80878
T-family: 80878
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 33.31 seconds
Total time used  : 33.31 seconds
Total memory used: 850.6 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 31.29 seconds
Total time used  : 64.6 seconds
Total memory used: 850.6 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 191868
└── CX: 92440
T-family: 40380
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2587 seconds
Total time used  : 2652 seconds
Total memory used: 853.4 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

