DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf2_277.qasm

qsyn> qccp -a
Clifford: 12405
└── CX: 10066
T-family: 7707
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.71 seconds
Total time used  : 1.71 seconds
Total memory used: 73.1 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.86 seconds
Total time used  : 4.57 seconds
Total memory used: 73.1 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 26297
└── CX: 13659
T-family: 5063
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 38.79 seconds
Total time used  : 43.36 seconds
Total memory used: 86.65 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

