DV Lab, NTUEE, Qsyn 0.4.1
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/z4_268.qasm

qsyn> qccp -a
Clifford: 1736
└── CX: 1343
T-family: 1337
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.25 seconds
Total time used  : 0.25 seconds
Total memory used: 12.5 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.69 seconds
Total time used  : 0.94 seconds
Total memory used: 12.5 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 2543
└── CX: 1299
T-family: 631
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.95 seconds
Total time used  : 1.89 seconds
Total memory used: 12.84 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

