DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qccread benchmark/benchmark_SABRE/large/cm82a_208.qasm

qsyn> qc2zx

qsyn> zxgp
Graph 0( 16 inputs, 16 outputs, 965 vertices, 1232 edges )

qsyn> zxcopy

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgprint
Graph 1( 16 inputs, 16 outputs, 1930 vertices, 2480 edges )

qsyn> zxgs -fr
Spider Fusion Rule            4 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    3 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Pivot Gadget Rule             8 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            5 iteration(s)
Pivot Rule                    1 iteration(s)
Local Complementation Rule    12 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            3 iteration(s)
Pivot Rule                    3 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            13 iteration(s)
Pivot Rule                    1 iteration(s)
Local Complementation Rule    6 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Local Complementation Rule    2 iteration(s)
Phase Gadget Rule             1 iteration(s)
Pivot Rule                    1 iteration(s)
Local Complementation Rule    8 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    4 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         2 iteration(s)
Phase Gadget Rule             1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)

qsyn> zxgp
Graph 1( 16 inputs, 16 outputs, 32 vertices, 16 edges )

qsyn> zxgp -q

ID:	31	VertexType:	●	Qubit:	15	Phase:	0	#Neighbors:	1	(996, -) 
ID:	996	VertexType:	●	Qubit:	15	Phase:	0	#Neighbors:	1	(31, -) 


ID:	29	VertexType:	●	Qubit:	14	Phase:	0	#Neighbors:	1	(994, -) 
ID:	994	VertexType:	●	Qubit:	14	Phase:	0	#Neighbors:	1	(29, -) 


ID:	27	VertexType:	●	Qubit:	13	Phase:	0	#Neighbors:	1	(992, -) 
ID:	992	VertexType:	●	Qubit:	13	Phase:	0	#Neighbors:	1	(27, -) 


ID:	1	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(966, -) 
ID:	966	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 


ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(968, -) 
ID:	968	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 


ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(970, -) 
ID:	970	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(5, -) 


ID:	7	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(972, -) 
ID:	972	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(7, -) 


ID:	9	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(974, -) 
ID:	974	VertexType:	●	Qubit:	4	Phase:	0	#Neighbors:	1	(9, -) 


ID:	11	VertexType:	●	Qubit:	5	Phase:	0	#Neighbors:	1	(976, -) 
ID:	976	VertexType:	●	Qubit:	5	Phase:	0	#Neighbors:	1	(11, -) 


ID:	13	VertexType:	●	Qubit:	6	Phase:	0	#Neighbors:	1	(978, -) 
ID:	978	VertexType:	●	Qubit:	6	Phase:	0	#Neighbors:	1	(13, -) 


ID:	15	VertexType:	●	Qubit:	7	Phase:	0	#Neighbors:	1	(980, -) 
ID:	980	VertexType:	●	Qubit:	7	Phase:	0	#Neighbors:	1	(15, -) 


ID:	17	VertexType:	●	Qubit:	8	Phase:	0	#Neighbors:	1	(982, -) 
ID:	982	VertexType:	●	Qubit:	8	Phase:	0	#Neighbors:	1	(17, -) 


ID:	19	VertexType:	●	Qubit:	9	Phase:	0	#Neighbors:	1	(984, -) 
ID:	984	VertexType:	●	Qubit:	9	Phase:	0	#Neighbors:	1	(19, -) 


ID:	21	VertexType:	●	Qubit:	10	Phase:	0	#Neighbors:	1	(986, -) 
ID:	986	VertexType:	●	Qubit:	10	Phase:	0	#Neighbors:	1	(21, -) 


ID:	23	VertexType:	●	Qubit:	11	Phase:	0	#Neighbors:	1	(988, -) 
ID:	988	VertexType:	●	Qubit:	11	Phase:	0	#Neighbors:	1	(23, -) 


ID:	25	VertexType:	●	Qubit:	12	Phase:	0	#Neighbors:	1	(990, -) 
ID:	990	VertexType:	●	Qubit:	12	Phase:	0	#Neighbors:	1	(25, -) 


qsyn> usage
Period time used : 0.26 seconds
Total time used  : 0.26 seconds
Total memory used: 5.742 M Bytes

qsyn> q -f

