DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qccread benchmark/benchmark_SABRE/large/rd84_253.qasm

qsyn> qc2zx

qsyn> zxgp
Graph 0( 16 inputs, 16 outputs, 19650 vertices, 25594 edges )

qsyn> zxcopy

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgprint
Graph 1( 16 inputs, 16 outputs, 39300 vertices, 51204 edges )

qsyn> zxgs -fr
Spider Fusion Rule            4 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Pivot Gadget Rule             16 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            102 iteration(s)
Pivot Rule                    3 iteration(s)
Local Complementation Rule    113 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            16 iteration(s)
Pivot Rule                    5 iteration(s)
Local Complementation Rule    24 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            33 iteration(s)
Pivot Rule                    3 iteration(s)
Local Complementation Rule    18 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            3 iteration(s)
Pivot Rule                    2 iteration(s)
Local Complementation Rule    4 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            7 iteration(s)
Pivot Rule                    1 iteration(s)
Local Complementation Rule    2 iteration(s)
Phase Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Local Complementation Rule    160 iteration(s)
Pivot Rule                    2 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            3 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Local Complementation Rule    2 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Local Complementation Rule    4 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Local Complementation Rule    4 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Gadget Rule             2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Phase Gadget Rule             1 iteration(s)
Pivot Rule                    1 iteration(s)
Pivot Gadget Rule             1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Local Complementation Rule    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule   