DV Lab, NTUEE, Qsyn 0.3.0
qsyn> ver 1
Note: verbose level is set to 1

qsyn> zxm -on
ZXMODE turn ON!

qsyn> qccread benchmark/benchmark_SABRE/large/sqn_258.qasm

qsyn> qc2zx

qsyn> zxgp
Graph 0( 16 inputs, 16 outputs, 14714 vertices, 19157 edges )

qsyn> zxcopy

qsyn> zxgadjoint

qsyn> zxcompose 0

qsyn> zxgprint
Graph 1( 16 inputs, 16 outputs, 29428 vertices, 38330 edges )

qsyn> zxgs -fr
Spider Fusion Rule            4 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            2 iteration(s)
Pivot Rule                    2 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Identity Removal Rule         1 iteration(s)
Spider Fusion Rule            1 iteration(s)
Pivot Rule                    1Segmentation fault (core dumped)
