DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/9symml_195.qasm

qsyn> qccp -a
Clifford: 19649
└── CX: 15232
T-family: 15232
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 71.41 seconds
Total time used  : 71.41 seconds
Total memory used: 1281 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 10.77 seconds
Total time used  : 82.18 seconds
Total memory used: 1281 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 28011
└── CX: 16060
T-family: 6450
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 857.8 seconds
Total time used  : 939.9 seconds
Total memory used: 1281 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

