DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm82a_208.qasm

qsyn> qccp -a
Clifford: 370
└── CX: 283
T-family: 280
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.03 seconds
Total time used  : 0.03 seconds
Total memory used: 3.074 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.04 seconds
Total time used  : 0.07 seconds
Total memory used: 3.508 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 558
└── CX: 259
T-family: 122
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.09 seconds
Total time used  : 0.16 seconds
Total memory used: 4.391 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

