DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cm85a_209.qasm

qsyn> qccp -a
Clifford: 6430
└── CX: 4986
T-family: 4984
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.32 seconds
Total time used  : 8.32 seconds
Total memory used: 155.8 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 3.93 seconds
Total time used  : 12.25 seconds
Total memory used: 155.8 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 8299
└── CX: 4628
T-family: 1950
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 25.9 seconds
Total time used  : 38.15 seconds
Total memory used: 155.8 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

