DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/cycle10_2_110.qasm

qsyn> qccp -a
Clifford: 3404
└── CX: 2648
T-family: 2646
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.51 seconds
Total time used  : 2.51 seconds
Total memory used: 78.09 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.22 seconds
Total time used  : 3.73 seconds
Total memory used: 78.09 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 5068
└── CX: 2746
T-family: 1160
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 6.67 seconds
Total time used  : 10.4 seconds
Total memory used: 78.09 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

