DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/ham15_107.qasm

qsyn> qccp -a
Clifford: 4948
└── CX: 3858
T-family: 3815
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 1.6 seconds
Total time used  : 1.6 seconds
Total memory used: 26.01 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 2.19 seconds
Total time used  : 3.79 seconds
Total memory used: 26.01 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 7638
└── CX: 3964
T-family: 1805
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 13.64 seconds
Total time used  : 17.43 seconds
Total memory used: 29.68 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

