DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/hwb8_113.qasm

qsyn> qccp -a
Clifford: 39042
└── CX: 30372
T-family: 30338
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 28.83 seconds
Total time used  : 28.83 seconds
Total memory used: 449 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 11.62 seconds
Total time used  : 40.45 seconds
Total memory used: 449 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 57839
└── CX: 28118
T-family: 14934
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 835.8 seconds
Total time used  : 876.2 seconds
Total memory used: 449 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

