DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/life_238.qasm

qsyn> qccp -a
Clifford: 12645
└── CX: 9800
T-family: 9800
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 22.03 seconds
Total time used  : 22.03 seconds
Total memory used: 380.2 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 4.93 seconds
Total time used  : 26.96 seconds
Total memory used: 380.2 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 17610
└── CX: 9840
T-family: 4152
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 200.5 seconds
Total time used  : 227.4 seconds
Total memory used: 380.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

