DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/mlp4_245.qasm

qsyn> qccp -a
Clifford: 10620
└── CX: 8232
T-family: 8232
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 8.08 seconds
Total time used  : 8.08 seconds
Total memory used: 174.3 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 8.36 seconds
Total time used  : 16.44 seconds
Total memory used: 174.3 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 14660
└── CX: 8358
T-family: 3324
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 68.39 seconds
Total time used  : 84.83 seconds
Total memory used: 175.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

