DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/pm1_249.qasm

qsyn> qccp -a
Clifford: 1006
└── CX: 771
T-family: 770
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.11 seconds
Total time used  : 0.11 seconds
Total memory used: 4.727 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.26 seconds
Total time used  : 0.37 seconds
Total memory used: 4.727 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 1503
└── CX: 694
T-family: 370
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.59 seconds
Total time used  : 0.96 seconds
Total memory used: 7.723 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

