DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd53_251.qasm

qsyn> qccp -a
Clifford: 731
└── CX: 564
T-family: 560
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.08 seconds
Total time used  : 0.08 seconds
Total memory used: 4.398 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.12 seconds
Total time used  : 0.2 seconds
Total memory used: 4.398 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 1155
└── CX: 544
T-family: 280
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.61 seconds
Total time used  : 0.81 seconds
Total memory used: 6.102 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

