DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/rd73_252.qasm

qsyn> qccp -a
Clifford: 3004
└── CX: 2319
T-family: 2317
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.69 seconds
Total time used  : 2.69 seconds
Total memory used: 71.48 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.97 seconds
Total time used  : 3.66 seconds
Total memory used: 71.48 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 4643
└── CX: 2482
T-family: 1045
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 7.66 seconds
Total time used  : 11.32 seconds
Total memory used: 71.48 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

