DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqn_258.qasm

qsyn> qccp -a
Clifford: 5764
└── CX: 4459
T-family: 4459
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 11.25 seconds
Total time used  : 11.25 seconds
Total memory used: 265.2 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.58 seconds
Total time used  : 12.83 seconds
Total memory used: 265.2 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 8927
└── CX: 4632
T-family: 2097
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 18.83 seconds
Total time used  : 31.66 seconds
Total memory used: 265.2 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

