DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/sqrt8_260.qasm

qsyn> qccp -a
Clifford: 1700
└── CX: 1314
T-family: 1309
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.7 seconds
Total time used  : 0.7 seconds
Total memory used: 36.69 M Bytes

qsyn> zx2qc
Error: no free column!!
Error: no free column!!
Finish extracting!

qsyn> usage
Period time used : 0.64 seconds
Total time used  : 1.34 seconds
Total memory used: 36.69 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 2650
└── CX: 1388
T-family: 581
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.14 seconds
Total time used  : 3.48 seconds
Total memory used: 36.69 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

