DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/square_root_7.qasm

qsyn> qccp -a
Clifford: 4711
└── CX: 3089
T-family: 2919
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.48 seconds
Total time used  : 0.48 seconds
Total memory used: 11.55 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 1.03 seconds
Total time used  : 1.51 seconds
Total memory used: 11.55 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 5268
└── CX: 2770
T-family: 1109
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 4.85 seconds
Total time used  : 6.36 seconds
Total memory used: 25.1 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

