DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_278.qasm

qsyn> qccp -a
Clifford: 33234
└── CX: 26692
T-family: 21532
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 16.21 seconds
Total time used  : 16.21 seconds
Total memory used: 370.8 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 10.39 seconds
Total time used  : 26.6 seconds
Total memory used: 370.8 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 65486
└── CX: 35278
T-family: 12772
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 740.5 seconds
Total time used  : 767.1 seconds
Total memory used: 370.8 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

