DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/urf1_149.qasm

qsyn> qccp -a
Clifford: 103986
└── CX: 80878
T-family: 80878
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 36.67 seconds
Total time used  : 36.67 seconds
Total memory used: 555.3 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 31.09 seconds
Total time used  : 67.76 seconds
Total memory used: 555.3 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 195135
└── CX: 93347
T-family: 40380
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 4642 seconds
Total time used  : 4710 seconds
Total memory used: 587.9 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

