DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> ver 0
Note: verbose level is set to 0

qsyn> qccr ../../benchmark/benchmark_SABRE/large/z4_268.qasm

qsyn> qccp -a
Clifford: 1736
└── CX: 1343
T-family: 1337
Others  : 0

qsyn> qc2zx

qsyn> zxgs -fr

qsyn> usage
Period time used : 0.29 seconds
Total time used  : 0.29 seconds
Total memory used: 9.656 M Bytes

qsyn> zx2qc
Finish extracting!

qsyn> usage
Period time used : 0.47 seconds
Total time used  : 0.76 seconds
Total memory used: 9.656 M Bytes

qsyn> qcp
-> #QCir: 2
-> Now focus on: 1

qsyn> qccp -a
Clifford: 2691
└── CX: 1445
T-family: 631
Others  : 0

qsyn> qc2zx

qsyn> zxgadj

qsyn> zxcomp 0

qsyn> zxgs -fr

qsyn> usage
Period time used : 2.26 seconds
Total time used  : 3.02 seconds
Total memory used: 11.25 M Bytes

qsyn> zxgt -id 
The graph is an identity!

qsyn> qq -f

