DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccp -q
Error: QCir list is empty now. Please QCNEW/QCCRead/QCBAdd before QCCPrint.

qsyn> qcga -cx 0 1
Error: QCir list is empty now. Please QCNEW/QCCRead/QCBAdd before QCGAdd.

qsyn> qcba
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qccp -q
Q 0  

qsyn> qcga -h
Error: Missing option after (-h)!!

qsyn> qcga -h 0

qsyn> qccp -q
Q 0  - h( 0)-

qsyn> qcga -cx 0 1
Error: qubit ID is not in current circuit!!
Error: Illegal option!! (1)

qsyn> qcba 3

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  
Q 2  
Q 3  

qsyn> qcga -cx 0 2

qsyn> qccp -q
Q 0  - h( 0)--cx( 1)-
Q 1  
Q 2  ---------cx( 1)-
Q 3  

qsyn> qcga -cx 1 3

qsyn> qccp -q
Q 0  - h( 0)--cx( 1)-
Q 1  -cx( 2)-
Q 2  ---------cx( 1)-
Q 3  -cx( 2)-

qsyn> qcga -t 2

qsyn> qcga -cx 2 1

qsyn> qcga -x 3

qsyn> qcga -t 3

qsyn> qcga -cx 3 2

qsyn> qcga -cx 0 1

qsyn> qccp -q
Q 0  - h( 0)--cx( 1)------------------cx( 8)-
Q 1  -cx( 2)------------------cx( 4)--cx( 8)-
Q 2  ---------cx( 1)-- t( 3)--cx( 4)--cx( 7)-
Q 3  -cx( 2)-- x( 5)-- t( 6)----------cx( 7)-

qsyn> qcga -pr -rz -ph 0.00001 0

qsyn> qcga -pr -rz -ph 1.2345 0

qsyn> qcgp 10
          ┌────┐ 
Q0 Start ─┤ RZ ├─ G9
          └────┘ 
Rotate Phase: 112π/285

qsyn> qcgp 9 -t
        ┌────┐ 
Q0 G10 ─┤ RZ ├─ G0
        └────┘ 
Rotate Phase: 0
Execute at t= 1

qsyn> qccp -q
Q 0  -rz(10)--rz( 9)-- h( 0)--cx( 1)------------------cx( 8)-
Q 1  -cx( 2)----------------------------------cx( 4)--cx( 8)-
Q 2  -------------------------cx( 1)-- t( 3)--cx( 4)--cx( 7)-
Q 3  -cx( 2)-- x( 5)-- t( 6)--------------------------cx( 7)-

qsyn> qccp -ZX
Gate 2 (cx)

ID:	0	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6

Gate 5 (x)

ID:	0	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	π	#Neighbors:	2	(0, -) (2, -) 
ID:	2	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(1, -) 
Total #Vertices: 3

Gate 6 (t)

ID:	0	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	π/4	#Neighbors:	2	(0, -) (2, -) 
ID:	2	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(1, -) 
Total #Vertices: 3

Gate 10 (rz)

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	112π/285	#Neighbors:	2	(0, -) (2, -) 
ID:	2	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
Total #Vertices: 3

Gate 9 (rz)

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(0, -) (2, -) 
ID:	2	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
Total #Vertices: 3

Gate 0 (h)

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(0, -) (2, -) 
ID:	2	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(1, -) 
Total #Vertices: 3

Gate 1 (cx)

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6

Gate 3 (t)

ID:	0	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	π/4	#Neighbors:	2	(0, -) (2, -) 
ID:	2	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(1, -) 
Total #Vertices: 3

Gate 4 (cx)

ID:	0	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6

Gate 7 (cx)

ID:	0	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6

Gate 8 (cx)

ID:	0	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6


qsyn> q -f

