DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccp -q
Error: quantum circuit is not yet constructed!!

qsyn> qcga -cx 0 1
Error: no available qubits. Please read a quantum circuit or add qubit(s)!!

qsyn> qcba

qsyn> qccp -q
Q 0  

qsyn> qcga -h
Error: Missing option after (-h)!!

qsyn> qcga -h 0

qsyn> qccp -q
Q 0  - h( 0)-

qsyn> qcga -cx 0 1
Error: qubit ID is not in current circuit!!
Error: Illegal option!! (1)

qsyn> qcba 3

qsyn> qccp -q
Q 0  - h( 0)-
Q 1  
Q 2  
Q 3  

qsyn> qcga -cx 0 2

qsyn> qccp -q
Q 0  - h( 0)--cx( 1)-
Q 1  
Q 2  ---------cx( 1)-
Q 3  

qsyn> qcga -cx 1 3

qsyn> qccp -q
Q 0  - h( 0)--cx( 1)-
Q 1  -cx( 2)-
Q 2  ---------cx( 1)-
Q 3  -cx( 2)-

qsyn> qcga -t 2

qsyn> qcga -cx 2 1

qsyn> qcga -x 3

qsyn> qcga -t 3

qsyn> qcga -cx 3 2

qsyn> qcga -cx 0 1

qsyn> qccp -q
Q 0  - h( 0)--cx( 1)------------------cx( 8)-
Q 1  -cx( 2)------------------cx( 4)--cx( 8)-
Q 2  ---------cx( 1)-- t( 3)--cx( 4)--cx( 7)-
Q 3  -cx( 2)-- x( 5)-- t( 6)----------cx( 7)-

qsyn> qcga -pr -rz -ph 0.00001 0

qsyn> qcga -pr -rz -ph 1.2345 0

qsyn> qcgp 10
          ┌────┐ 
Q0 Start ─┤ RZ ├─ G9
          └────┘ 
Rotate Phase: 112π/285

qsyn> qcgp 9 -t
        ┌────┐ 
Q0 G10 ─┤ RZ ├─ G0
        └────┘ 
Rotate Phase: 0
Execute at t= 1

qsyn> qccp -q
Q 0  -rz(10)--rz( 9)-- h( 0)--cx( 1)------------------cx( 8)-
Q 1  -cx( 2)----------------------------------cx( 4)--cx( 8)-
Q 2  -------------------------cx( 1)-- t( 3)--cx( 4)--cx( 7)-
Q 3  -cx( 2)-- x( 5)-- t( 6)--------------------------cx( 7)-

qsyn> qccp -ZX
Gate 2 (cx)

ID:	3	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(1, -) 
ID:	4	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(2, -) (3, -) (5, -) 
ID:	2	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(1, -) (4, -) (6, -) 
ID:	5	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(1, -) 
ID:	6	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(2, -) 
Total #Vertices: 6

Gate 5 (x)

ID:	4	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(3, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	3	Phase:	π	#Neighbors:	2	(4, -) (5, -) 
ID:	5	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 3

Gate 6 (t)

ID:	5	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(4, -) 
ID:	4	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	π/4	#Neighbors:	2	(5, -) (6, -) 
ID:	6	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(4, -) 
Total #Vertices: 3

Gate 10 (rz)

ID:	6	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
ID:	5	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	112π/285	#Neighbors:	2	(6, -) (7, -) 
ID:	7	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(5, -) 
Total #Vertices: 3

Gate 9 (rz)

ID:	7	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
ID:	6	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	2	(7, -) (8, -) 
ID:	8	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(6, -) 
Total #Vertices: 3

Gate 0 (h)

ID:	8	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
ID:	7	VertexType:	[1m[33mH[0m[0m	Qubit:	0	Phase:	π	#Neighbors:	2	(8, -) (9, -) 
ID:	9	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(7, -) 
Total #Vertices: 3

Gate 1 (cx)

ID:	10	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	11	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(9, -) 
ID:	8	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(9, -) (10, -) (12, -) 
ID:	9	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(8, -) (11, -) (13, -) 
ID:	12	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(8, -) 
ID:	13	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(9, -) 
Total #Vertices: 6

Gate 3 (t)

ID:	11	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(10, -) 
ID:	10	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	π/4	#Neighbors:	2	(11, -) (12, -) 
ID:	12	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(10, -) 
Total #Vertices: 3

Gate 4 (cx)

ID:	13	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(11, -) 
ID:	14	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(12, -) 
ID:	11	VertexType:	[1m[32mZ[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(12, -) (13, -) (15, -) 
ID:	12	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(11, -) (14, -) (16, -) 
ID:	15	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(11, -) 
ID:	16	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(12, -) 
Total #Vertices: 6

Gate 7 (cx)

ID:	15	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(13, -) 
ID:	16	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(14, -) 
ID:	13	VertexType:	[1m[32mZ[0m[0m	Qubit:	3	Phase:	0	#Neighbors:	3	(14, -) (15, -) (17, -) 
ID:	14	VertexType:	[1m[31mX[0m[0m	Qubit:	2	Phase:	0	#Neighbors:	3	(13, -) (16, -) (18, -) 
ID:	17	VertexType:	●	Qubit:	3	Phase:	0	#Neighbors:	1	(13, -) 
ID:	18	VertexType:	●	Qubit:	2	Phase:	0	#Neighbors:	1	(14, -) 
Total #Vertices: 6

Gate 8 (cx)

ID:	17	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(15, -) 
ID:	18	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(16, -) 
ID:	15	VertexType:	[1m[32mZ[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(16, -) (17, -) (19, -) 
ID:	16	VertexType:	[1m[31mX[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(15, -) (18, -) (20, -) 
ID:	19	VertexType:	●	Qubit:	0	Phase:	0	#Neighbors:	1	(15, -) 
ID:	20	VertexType:	●	Qubit:	1	Phase:	0	#Neighbors:	1	(16, -) 
Total #Vertices: 6


qsyn> q -f

