DV Lab, NTUEE, Qsyn 0.4.2
qsyn> color off
Note: color mode is set to off

qsyn> qcba 2
Note: QCir list is empty now. Create a new one.
Create and checkout to QCir 0

qsyn> qcgadd -mcp -phase pi/2 0 1 

qsyn> qcgp 0 -t
Q0 Start ───●─── End
          ┌─┴─┐ 
Q1 Start ─┤ P ├─ End
          └───┘ 
Rotate Phase: π/2
Execute at t= 1

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 3)	  #Neighbors:   1     (4, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 3)	  #Neighbors:   1     (5, -) 
ID:   4 (Z, π/4)         (Qubit, Col): (0, 2)	  #Neighbors:   3     (0, -) (1, -) (6, H) 
ID:   5 (Z, π/4)         (Qubit, Col): (1, 2)	  #Neighbors:   3     (2, -) (3, -) (6, H) 
ID:   6 (Z, 0)           (Qubit, Col): (-1, 2)	  #Neighbors:   3     (4, H) (5, H) (7, H) 
ID:   7 (Z, 7π/4)        (Qubit, Col): (-2, 2)	  #Neighbors:   1     (6, H) 
Total #Vertices: 8


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  1.000000e+00-2.775558e-16i,
   0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   1.000000e+00-2.775558e-16i,  0.000000e+00+0.000000e+00i},
 { 0.000000e+00+0.000000e+00i,  0.000000e+00+0.000000e+00i,
   0.000000e+00+0.000000e+00i,  2.640570e-16+1.000000e+00i}}
#Dim:    2	Info: ZX 0

qsyn> qcnew
Create and checkout to QCir 1

qsyn> qcba 2

qsyn> qcgadd -mcrz -phase pi/2 0 1

qsyn> qcgp 0 -t
Q0 Start ────●──── End
          ┌──┴──┐ 
Q1 Start ─┤  RZ ├─ End
          └─────┘ 
Rotate Phase: π/2
Execute at t= 1

qsyn> qc2zx
Create and checkout to Graph 1

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 3)	  #Neighbors:   1     (4, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 3)	  #Neighbors:   1     (5, -) 
ID:   4 (Z, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   3     (0, -) (1, -) (6, H) 
ID:   5 (Z, π/4)         (Qubit, Col): (1, 2)	  #Neighbors:   3     (2, -) (3, -) (6, H) 
ID:   6 (Z, 0)           (Qubit, Col): (-1, 2)	  #Neighbors:   3     (4, H) (5, H) (7, H) 
ID:   7 (Z, 7π/4)        (Qubit, Col): (-2, 2)	  #Neighbors:   1     (6, H) 
Total #Vertices: 8


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tsp 1
{{ 1.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  1.      -2.775558e-16i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.707107-7.071068e-01i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.707107+7.071068e-01i}}
#Dim:    2	Info: ZX 1

qsyn> qq -f

