DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qcba 2
Note: QCir list is empty now. Create a new one.
Create and checkout to QCir 0

qsyn> qcgadd -mcp -phase pi/2 0 1 

qsyn> qcgadd -mcrz -phase -pi/2 0 1

qsyn> qcgadd -tdg 0

qsyn> qcgp 0 -t
Q0 Start â”€â”€â”€â—â”€â”€â”€ G1
          â”Œâ”€â”´â”€â” 
Q1 Start â”€â”¤ P â”œâ”€ G1
          â””â”€â”€â”€â”˜ 
Rotate Phase: Ï€/2
Execute at t= 2

qsyn> qcgp 1 -t
Q0 G0 â”€â”€â”€â”€â—â”€â”€â”€â”€ G2
       â”Œâ”€â”€â”´â”€â”€â” 
Q1 G0 â”€â”¤  RZ â”œâ”€ End
       â””â”€â”€â”€â”€â”€â”˜ 
Rotate Phase: -Ï€/2
Execute at t= 4

qsyn> qcgp 2 -t
       â”Œâ”€â”€â”€â”€â”€â” 
Q0 G1 â”€â”¤ Tdg â”œâ”€ End
       â””â”€â”€â”€â”€â”€â”˜ 
Execute at t= 5

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 7)	  #Neighbors:   1     (12, -) 
ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 7)	  #Neighbors:   1     (9, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (0, 4)	  #Neighbors:   3     (0, -) (6, [1m[34mH[0m[0m) (8, -) 
ID:   5 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (1, 4)	  #Neighbors:   3     (2, -) (6, [1m[34mH[0m[0m) (9, -) 
ID:   6 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 4)	  #Neighbors:   3     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 
ID:   7 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (-2, 4)	  #Neighbors:   1     (6, [1m[34mH[0m[0m) 
ID:   8 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (0, 6)	  #Neighbors:   3     (4, -) (10, [1m[34mH[0m[0m) (12, -) 
ID:   9 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (1, 6)	  #Neighbors:   3     (3, -) (5, -) (10, [1m[34mH[0m[0m) 
ID:  10 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 6)	  #Neighbors:   3     (8, [1m[34mH[0m[0m) (9, [1m[34mH[0m[0m) (11, [1m[34mH[0m[0m) 
ID:  11 ([1m[32mZ[0m[0m, Ï€/4)         (Qubit, Col): (-2, 6)	  #Neighbors:   1     (10, [1m[34mH[0m[0m) 
ID:  12 ([1m[32mZ[0m[0m, -Ï€/4)        (Qubit, Col): (0, 6)	  #Neighbors:   2     (1, -) (8, -) 
Total #Vertices: 13


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> qcnew
Create and checkout to QCir 1

qsyn> qcba 2

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> qq -f

