DV Lab, NTUEE, Qsyn 0.3.0
qsyn> color 0
Note: colored is set to 0

qsyn> qcba 3
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qcgadd -mcp -phase pi/4 0 1 2

qsyn> qcgp 0 -t
Q0 Start ────●──── End
Q1 Start ────●──── End
          ┌──┴──┐ 
Q2 Start ─┤  RZ ├─ End
          └─────┘ 
Rotate Phase: π/4
Execute at t= 0

qsyn> qc2zx
Traverse and build the graph... 
Successfully generated Graph 0
Checkout to Graph 0

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (6, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 2)	  #Neighbors:   1     (6, -) 
ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (7, -) 
ID:   3 (●, 0)           (Qubit, Col): (1, 2)	  #Neighbors:   1     (7, -) 
ID:   4 (●, 0)           (Qubit, Col): (2, 0)	  #Neighbors:   1     (8, -) 
ID:   5 (●, 0)           (Qubit, Col): (2, 2)	  #Neighbors:   1     (8, -) 
ID:   6 (Z, π/16)        (Qubit, Col): (0, 1)	  #Neighbors:   5     (0, -) (1, -) (9, H) (11, H) (15, H) 
ID:   7 (Z, π/16)        (Qubit, Col): (1, 1)	  #Neighbors:   5     (2, -) (3, -) (9, H) (13, H) (15, H) 
ID:   8 (Z, π/16)        (Qubit, Col): (2, 1)	  #Neighbors:   5     (4, -) (5, -) (11, H) (13, H) (15, H) 
ID:   9 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (6, H) (7, H) (10, H) 
ID:  10 (Z, 31π/16)      (Qubit, Col): (-2, 1)	  #Neighbors:   1     (9, H) 
ID:  11 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (6, H) (8, H) (12, H) 
ID:  12 (Z, 31π/16)      (Qubit, Col): (-2, 1)	  #Neighbors:   1     (11, H) 
ID:  13 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   3     (7, H) (8, H) (14, H) 
ID:  14 (Z, 31π/16)      (Qubit, Col): (-2, 1)	  #Neighbors:   1     (13, H) 
ID:  15 (Z, 0)           (Qubit, Col): (-1, 1)	  #Neighbors:   4     (6, H) (7, H) (8, H) (16, H) 
ID:  16 (Z, π/16)        (Qubit, Col): (-2, 1)	  #Neighbors:   1     (15, H) 
Total #Vertices: 17


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> tsp 0
{{ 1.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  1.      -9.241996e-16i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   1.      -9.436896e-16i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  1.      -9.436896e-16i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   1.      -9.436896e-16i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  1.      -9.436896e-16i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   1.      -1.089235e-15i,  0.      +0.000000e+00i},
 { 0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.      +0.000000e+00i,
   0.      +0.000000e+00i,  0.707107+7.071068e-01i}}
#Dim:    2	Info: ZX 0

qsyn> qcnew
Successfully generated QCir 1
Checkout to QCir 1

qsyn> qcba 3

qsyn> qcgadd -mcrz -phase pi/4 0 1 2
