qsyn> qcba 2
Note: QCir list is empty now. Create a new one.

qsyn> qcgadd mcp -ph pi/3 0 1

qsyn> qccp -q
Q 0  ---------cp( 0)-
Q 1  ---------cp( 0)-

qsyn> qcgp 0
Q0 Start ───●─── End
          ┌─┴─┐ 
Q1 Start ─┤ P ├─ End
          └───┘ 
Rotate Phase: π/3

qsyn> qc2ts

qsyn> qc2zx

qsyn> zxgp -q

ID:   7 (Z, -π/6)        (Qubit, Col): (-2, 4)        #Neighbors:   1     (6, H)


ID:   6 (Z, 0)           (Qubit, Col): (-1, 4)        #Neighbors:   3     (4, H) (5, H) (7, H)


ID:   0 (●, 0)           (Qubit, Col): (0, 0)         #Neighbors:   1     (4, -)
ID:   1 (●, 0)           (Qubit, Col): (0, 5)         #Neighbors:   1     (4, -)
ID:   4 (Z, π/6)         (Qubit, Col): (0, 4)         #Neighbors:   3     (0, -) (1, -) (6, H)


ID:   2 (●, 0)           (Qubit, Col): (1, 0)         #Neighbors:   1     (5, -)
ID:   3 (●, 0)           (Qubit, Col): (1, 5)         #Neighbors:   1     (5, -)
ID:   5 (Z, π/6)         (Qubit, Col): (1, 4)         #Neighbors:   3     (2, -) (3, -) (6, H)


qsyn> zxgs -fr

qsyn> zxgp -q

ID:   7 (Z, -π/6)        (Qubit, Col): (-2, 4)        #Neighbors:   1     (6, H)


ID:   6 (Z, 0)           (Qubit, Col): (-1, 4)        #Neighbors:   3     (4, H) (5, H) (7, H)


ID:   0 (●, 0)           (Qubit, Col): (0, 0)         #Neighbors:   1     (4, -)
ID:   1 (●, 0)           (Qubit, Col): (0, 5)         #Neighbors:   1     (4, -)
ID:   4 (Z, π/6)         (Qubit, Col): (0, 4)         #Neighbors:   3     (0, -) (1, -) (6, H)


ID:   2 (●, 0)           (Qubit, Col): (1, 0)         #Neighbors:   1     (5, -)
ID:   3 (●, 0)           (Qubit, Col): (1, 5)         #Neighbors:   1     (5, -)
ID:   5 (Z, π/6)         (Qubit, Col): (1, 4)         #Neighbors:   3     (2, -) (3, -) (6, H)


qsyn> zx2ts

qsyn> tensor equiv 0 1
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qcr

qsyn> zxr

qsyn> tensor clear

qsyn> 
qsyn> qcba 1
Note: QCir list is empty now. Create a new one.

qsyn> qcgadd mcp -ph pi/3 0

qsyn> qcgp 0
          ┌───┐ 
Q0 Start ─┤ P ├─ End
          └───┘ 
Rotate Phase: π/3

qsyn> qc2zx

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)         #Neighbors:   1     (2, -)
ID:   1 (●, 0)           (Qubit, Col): (0, 3)         #Neighbors:   1     (2, -)
ID:   2 (Z, π/3)         (Qubit, Col): (0, 2)         #Neighbors:   2     (0, -) (1, -)
Total #Vertices: 3


qsyn> quit -f

