DV Lab, NTUEE, Qsyn 0.4.2
qsyn> qcba 2
Note: QCir list is empty now. Create a new one.
Create and checkout to QCir 0

qsyn> qcgadd -MCP -PH pi/3 0 1

qsyn> qccp -q
Q 0  ---------cp( 0)-
Q 1  ---------cp( 0)-

qsyn> qcgp 0
Q0 Start â”€â”€â”€â—â”€â”€â”€ End
          â”Œâ”€â”´â”€â” 
Q1 Start â”€â”¤ P â”œâ”€ End
          â””â”€â”€â”€â”˜ 
Rotate Phase: Ï€/3

qsyn> qc2ts
Traverse and build the tensor... 
Successfully added Tensor 0
Stored the resulting tensor as tensor id 0

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgp -Q

ID:   7 ([1m[32mZ[0m[0m, -Ï€/6)        (Qubit, Col): (-2, 4)	  #Neighbors:   1     (6, [1m[34mH[0m[0m) 


ID:   6 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 4)	  #Neighbors:   3     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 


ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 5)	  #Neighbors:   1     (4, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€/6)         (Qubit, Col): (0, 4)	  #Neighbors:   3     (0, -) (1, -) (6, [1m[34mH[0m[0m) 


ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 5)	  #Neighbors:   1     (5, -) 
ID:   5 ([1m[32mZ[0m[0m, Ï€/6)         (Qubit, Col): (1, 4)	  #Neighbors:   3     (2, -) (3, -) (6, [1m[34mH[0m[0m) 


qsyn> zxgs -fr

All rules applied in order:

qsyn> zxgp -Q

ID:   7 ([1m[32mZ[0m[0m, -Ï€/6)        (Qubit, Col): (-2, 4)	  #Neighbors:   1     (6, [1m[34mH[0m[0m) 


ID:   6 ([1m[32mZ[0m[0m, 0)           (Qubit, Col): (-1, 4)	  #Neighbors:   3     (4, [1m[34mH[0m[0m) (5, [1m[34mH[0m[0m) (7, [1m[34mH[0m[0m) 


ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 5)	  #Neighbors:   1     (4, -) 
ID:   4 ([1m[32mZ[0m[0m, Ï€/6)         (Qubit, Col): (0, 4)	  #Neighbors:   3     (0, -) (1, -) (6, [1m[34mH[0m[0m) 


ID:   2 (â—, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, -) 
ID:   3 (â—, 0)           (Qubit, Col): (1, 5)	  #Neighbors:   1     (5, -) 
ID:   5 ([1m[32mZ[0m[0m, Ï€/6)         (Qubit, Col): (1, 4)	  #Neighbors:   3     (2, -) (3, -) (6, [1m[34mH[0m[0m) 


qsyn> zx2ts
Traverse and build the tensor... 
Successfully added Tensor 1
Stored the resulting tensor as tensor id 1

qsyn> tseq 0 1
[1m[32mEquivalent[0m[0m
- Global Norm : 1
- Global Phase: 0

qsyn> qcr

qsyn> zxr

qsyn> tsr

qsyn> 
qsyn> qcba 1
Note: QCir list is empty now. Create a new one.
Create and checkout to QCir 0

qsyn> qcgadd -MCP -PH pi/3 0

qsyn> qcgp 0
          â”Œâ”€â”€â”€â” 
Q0 Start â”€â”¤ P â”œâ”€ End
          â””â”€â”€â”€â”˜ 
Rotate Phase: Ï€/3

qsyn> qc2zx
Create and checkout to Graph 0

qsyn> zxgp -v

ID:   0 (â—, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, -) 
ID:   1 (â—, 0)           (Qubit, Col): (0, 3)	  #Neighbors:   1     (2, -) 
ID:   2 ([1m[32mZ[0m[0m, Ï€/3)         (Qubit, Col): (0, 2)	  #Neighbors:   2     (0, -) (1, -) 
Total #Vertices: 3


qsyn> qq -f

