DV Lab, NTUEE, Qsyn 0.5.1
qsyn> qcba 2
Note: QCir list is empty now. Create a new one.
Created and checked out to QCir 0

qsyn> qcgadd -MCPX -PH pi 0 1

qsyn> qccp -q
Q 0  ---------cp( 0)-
Q 1  ---------cp( 0)-

qsyn> qcgp 0
Q0 Start ────●──── End
          ┌──┴──┐ 
Q1 Start ─┤  PX ├─ End
          └─────┘ 
Rotate Phase: π

qsyn> qc2ts
Traverse and build the tensor... 
Created and checked out to Tensor 0

qsyn> qc2zx
Created and checked out to ZXGraph 0

qsyn> zxgp -Q

ID:   7 (Z, -π/2)        (Qubit, Col): (-2, 4)	  #Neighbors:   1     (6, H) 


ID:   6 (Z, 0)           (Qubit, Col): (-1, 4)	  #Neighbors:   3     (4, H) (5, H) (7, H) 


ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 5)	  #Neighbors:   1     (4, -) 
ID:   4 (Z, π/2)         (Qubit, Col): (0, 4)	  #Neighbors:   3     (0, -) (1, -) (6, H) 


ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, H) 
ID:   3 (●, 0)           (Qubit, Col): (1, 5)	  #Neighbors:   1     (5, H) 
ID:   5 (Z, π/2)         (Qubit, Col): (1, 4)	  #Neighbors:   3     (2, H) (3, H) (6, H) 


qsyn> zxgs -fr

All rules applied in order:
Local Complementation Rule    2 iterations.
  1) 1 matches
  2) 1 matches

qsyn> zxgp -Q

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (4, -) 
ID:   1 (●, 0)           (Qubit, Col): (0, 5)	  #Neighbors:   1     (4, -) 
ID:   4 (Z, 0)           (Qubit, Col): (0, 4)	  #Neighbors:   3     (0, -) (1, -) (5, H) 


ID:   2 (●, 0)           (Qubit, Col): (1, 0)	  #Neighbors:   1     (5, H) 
ID:   3 (●, 0)           (Qubit, Col): (1, 5)	  #Neighbors:   1     (5, H) 
ID:   5 (Z, 0)           (Qubit, Col): (1, 4)	  #Neighbors:   3     (2, H) (3, H) (4, H) 


qsyn> zx2ts
Traverse and build the tensor... 
Created and checked out to Tensor 1

qsyn> tseq 0 1
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qcr

qsyn> zxr

qsyn> tsr

qsyn> tsr

qsyn> 
qsyn> qcba 1
Note: QCir list is empty now. Create a new one.
Created and checked out to QCir 0

qsyn> qcgadd -MCPX -PH pi 0

qsyn> qcgp 0
          ┌────┐ 
Q0 Start ─┤ PX ├─ End
          └────┘ 
Rotate Phase: π

qsyn> qc2zx
Created and checked out to ZXGraph 0

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)	  #Neighbors:   1     (2, H) 
ID:   1 (●, 0)           (Qubit, Col): (0, 3)	  #Neighbors:   1     (2, H) 
ID:   2 (Z, π)           (Qubit, Col): (0, 2)	  #Neighbors:   2     (0, H) (1, H) 
Total #Vertices: 3


qsyn> qq -f

