qsyn> qcba 2
Note: QCir list is empty now. Create a new one.

qsyn> qcgadd mcpx -ph pi 0 1

qsyn> qccp -q
Q 0  ---------cx( 0)-
Q 1  ---------cx( 0)-

qsyn> qcgp 0
Q0 Start ───●─── End
          ┌─┴─┐ 
Q1 Start ─┤ X ├─ End
          └───┘ 

qsyn> qc2ts

qsyn> qc2zx

qsyn> zxgp -q

ID:   0 (●, 0)           (Qubit, Col): (0, 0)         #Neighbors:   1     (4, -)
ID:   1 (●, 0)           (Qubit, Col): (0, 5)         #Neighbors:   1     (4, -)
ID:   4 (Z, 0)           (Qubit, Col): (0, 4)         #Neighbors:   3     (0, -) (1, -) (5, -)


ID:   2 (●, 0)           (Qubit, Col): (1, 0)         #Neighbors:   1     (5, -)
ID:   3 (●, 0)           (Qubit, Col): (1, 5)         #Neighbors:   1     (5, -)
ID:   5 (X, 0)           (Qubit, Col): (1, 4)         #Neighbors:   3     (2, -) (3, -) (4, -)


qsyn> zxgs -fr

qsyn> zxgp -q

ID:   0 (●, 0)           (Qubit, Col): (0, 0)         #Neighbors:   1     (4, -)
ID:   1 (●, 0)           (Qubit, Col): (0, 5)         #Neighbors:   1     (4, -)
ID:   4 (Z, 0)           (Qubit, Col): (0, 4)         #Neighbors:   3     (0, -) (1, -) (5, H)


ID:   2 (●, 0)           (Qubit, Col): (1, 0)         #Neighbors:   1     (5, H)
ID:   3 (●, 0)           (Qubit, Col): (1, 5)         #Neighbors:   1     (5, H)
ID:   5 (Z, 0)           (Qubit, Col): (1, 4)         #Neighbors:   3     (2, H) (3, H) (4, H)


qsyn> zx2ts

qsyn> tseq 0 1
Equivalent
- Global Norm : 1
- Global Phase: 0

qsyn> qcr

qsyn> zxr

qsyn> tsr

qsyn> tsr

qsyn> 
qsyn> qcba 1
Note: QCir list is empty now. Create a new one.

qsyn> qcgadd mcpx -ph pi 0

qsyn> qcgp 0
          ┌───┐ 
Q0 Start ─┤ X ├─ End
          └───┘ 

qsyn> qc2zx

qsyn> zxgp -v

ID:   0 (●, 0)           (Qubit, Col): (0, 0)         #Neighbors:   1     (2, -)
ID:   1 (●, 0)           (Qubit, Col): (0, 3)         #Neighbors:   1     (2, -)
ID:   2 (X, π)           (Qubit, Col): (0, 2)         #Neighbors:   2     (0, -) (1, -)
Total #Vertices: 3


qsyn> qq -f

