DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qcba 11
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qcga -mcrx -ph pi 0 2 10 9

qsyn> qcga -mcrz -ph pi 0 2 6 4 10 3 7

qsyn> qcga -cx 8 1

qsyn> qcga -ccx 9 4 5

qsyn> qcga -mcrz -ph pi 8

qsyn> qccp -q
Q 0  -mc( 0)--mc( 1)-
Q 1  -cx( 2)-
Q 2  -mc( 0)--mc( 1)-
Q 3  ---------mc( 1)-
Q 4  ---------mc( 1)--cc( 3)-
Q 5  -----------------cc( 3)-
Q 6  ---------mc( 1)-
Q 7  ---------mc( 1)-
Q 8  -cx( 2)--rz( 4)-
Q 9  -mc( 0)----------cc( 3)-
Q10  -mc( 0)--mc( 1)-

qsyn> qcgp 0
Q 0 Start ────●──── G1
Q 2 Start ────●──── G1
Q10 Start ────●──── G1
           ┌──┴──┐ 
Q 9 Start ─┤  RX ├─ G3
           └─────┘ 
Rotate Phase: π

qsyn> qcgp 1
Q 0 G0    ────●──── End
Q 2 G0    ────●──── End
Q 6 Start ────●──── End
Q 4 Start ────●──── G3
Q10 G0    ────●──── End
Q 3 Start ────●──── End
           ┌──┴──┐ 
Q 7 Start ─┤  RZ ├─ End
           └─────┘ 
Rotate Phase: π

qsyn> qcgp 2
Q8 Start ───●─── G4
          ┌─┴─┐ 
Q1 Start ─┤ X ├─ End
          └───┘ 

qsyn> qcgp 3
Q9 G0    ───●─── End
Q4 G1    ───●─── End
          ┌─┴─┐ 
Q5 Start ─┤ X ├─ End
          └───┘ 

qsyn> qcgp 4
       ┌────┐ 
Q8 G2 ─┤ RZ ├─ End
       └────┘ 
Rotate Phase: π

qsyn> qq -f

