DV Lab, NTUEE, Qsyn 0.3.0
qsyn> qccr benchmark/benchmark_SABRE/small/3_17_13.qasm
Note: QCir list is empty now. Create a new one.
Successfully generated QCir 0
Checkout to QCir 0

qsyn> qccp -q
Q 0  ---------cx( 1)-- h( 3)-- t( 6)----------cx( 8)--cx( 9)-- t(14)----------cx(15)--cx(16)-- h(18)-- t(20)--cx(23)----------cx(25)--cx(27)--td(28)----------cx(32)--cx(33)-
Q 1  -----------------cx( 2)-- t( 4)--cx( 7)----------cx( 9)--cx(11)--td(12)----------cx(16)--cx(17)-- t(21)--cx(23)--cx(24)--td(26)--cx(27)--td(29)--cx(31)----------cx(33)--cx(35)-
Q 2  - x( 0)--cx( 1)--cx( 2)-- t( 5)--cx( 7)--cx( 8)--td(10)--cx(11)--td(13)--cx(15)----------cx(17)-- h(19)-- t(22)--cx(24)--cx(25)-- t(30)----------cx(31)--cx(32)-- h(34)--cx(35)-

qsyn> qcgp 1
Q0 Start â”€â”€â”€â—â”€â”€â”€ G3
          â”Œâ”€â”´â”€â” 
Q2 G0    â”€â”¤ X â”œâ”€ G2
          â””â”€â”€â”€â”˜ 

qsyn> qcgp 26 -T
        â”Œâ”€â”€â”€â”€â”€â” 
Q1 G24 â”€â”¤ Tdg â”œâ”€ G27
        â””â”€â”€â”€â”€â”€â”˜ 
Execute at t= 15

qsyn> qcgd 24

qsyn> qcgp 24
Error: id 24 not found!!
Error: Illegal option!! (24)

qsyn> qcgp 26
        â”Œâ”€â”€â”€â”€â”€â” 
Q1 G23 â”€â”¤ Tdg â”œâ”€ G27
        â””â”€â”€â”€â”€â”€â”˜ 

qsyn> qcgp 26 -ZX

ID:	0	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(1, -) 
ID:	1	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	7Ï€/4	#Neighbors:	2	(0, -) (2, -) 
ID:	2	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(1, -) 
Total #Vertices: 3


qsyn> qcgp 26 -T
        â”Œâ”€â”€â”€â”€â”€â” 
Q1 G23 â”€â”¤ Tdg â”œâ”€ G27
        â””â”€â”€â”€â”€â”€â”˜ 
Execute at t= 14

qsyn> qcgp 23 -ZX

ID:	0	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(2, -) 
ID:	1	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
ID:	2	VertexType:	[1m[32mZ[0m[0m	Qubit:	1	Phase:	0	#Neighbors:	3	(0, -) (3, -) (4, -) 
ID:	3	VertexType:	[1m[31mX[0m[0m	Qubit:	0	Phase:	0	#Neighbors:	3	(1, -) (2, -) (5, -) 
ID:	4	VertexType:	â—	Qubit:	1	Phase:	0	#Neighbors:	1	(2, -) 
ID:	5	VertexType:	â—	Qubit:	0	Phase:	0	#Neighbors:	1	(3, -) 
Total #Vertices: 6


qsyn> q -f

